[{"by":["jeffbee"],"id":[24530159],"kids":[24530228],"parent":[24504519],"text":["These single-threaded results are spectacular. This laptop posts a web browser performance score (on Speedometer 2) higher than any system AnandTech has ever tested, save one (a Core i9-10900K, a factory overclock in essence). A laptop that beats almost all high-end desktop systems in web browser performance would be nice to have."],"time":["2020-09-19 22:36:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ColanR"],"id":[24530101],"kids":[24530150,24531302,24530388,24531517],"parent":[24504519],"text":["There&#x27;s almost no comparisons made to AMD in the article, which I would have been interested in.  Last sentence:<p>&gt; Tiger Lake isn’t sardine oil basting AMD just yet, but it stands to compete well in a number of key markets.<p>That just sounds like a polite way of saying that AMD is still very much on top."],"time":["2020-09-19 22:23:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ksec"],"id":[24532614],"kids":{},"parent":[24504519],"text":["I am sort of sad to see those numbers, not because they are bad, but they are better than what I expected. And I cant help but think had Intel had this in 2018 as they were originally scheduled. Apple wouldn&#x27;t have to switch over to ARM ( Yet ). These CPUs are 25W, meaning not MacBook Pro TDP range.<p>Even though I intensely dislike the new keyboard, not fond of the Touch Bar, at least I could get a x86 compatible MacBook. Now it is increasingly looking like the current Intel MacBook Pro may be the last."],"time":["2020-09-20 10:03:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["person_of_color"],"id":[24531451],"kids":{},"parent":[24504519],"text":["How will this fare against A14?"],"time":["2020-09-20 03:53:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["intricatedetail"],"id":[24532928],"kids":{},"parent":[24504519],"text":["AMD is still behind when it comes to real-time signal processing. Ryzen benchmarks look impressive, but sadly they can&#x27;t top Intel&#x27;s single core performance."],"time":["2020-09-20 11:43:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tus88"],"id":[24530149],"kids":[24530711,24530464,24530171],"parent":[24504519],"text":["Anyone know why Anand hasn&#x27;t reviewed the 3080 yet?"],"time":["2020-09-19 22:34:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["akmittal"],"id":[24530186],"kids":[24530612],"parent":[24504519],"text":["Intel has really improved their GPU. Intel 11th gen come with av1 hardware decode, amd does not even do VP9."],"time":["2020-09-19 22:38:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["4cao"],"id":[24530575],"kids":[24530755],"parent":[24504519],"text":["If they can&#x27;t come up with any better products at the moment, they could at least ditch these National Geographic-themed compound codenames: Coffee Lake, Whiskey Lake, Kaby Lake (named after a Portuguese footballer?) and now it&#x27;s Tiger Lake for a change.<p>Since there isn&#x27;t even a single &quot;lake&quot; named after something that can actually be found <i>in<\/i> a lake or <i>near<\/i> it, such as an aquatic animal, and there are also products from the same category with unrelated codenames (East Beach, Basin Falls, Chief River, River Forest, Forest Crystal, etc.) [1] why not just keep the first noun only and make things simpler. It&#x27;s not as if it would cause any further confusion at this point.<p>1. List of some recent Intel codenames (not for the faint-hearted): <a href=\"https:&#x2F;&#x2F;www.intel.com&#x2F;content&#x2F;www&#x2F;us&#x2F;en&#x2F;design&#x2F;products-and-solutions&#x2F;processors-and-chipsets&#x2F;platform-codenames.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intel.com&#x2F;content&#x2F;www&#x2F;us&#x2F;en&#x2F;design&#x2F;products-and-...<\/a>"],"time":["2020-09-19 23:57:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tyingq"],"id":[24523868],"kids":[24525840],"parent":[24512516],"text":["<i>&quot;Your seven-hour scenic flight will include low level flybys of unique Australian destinations across Queensland, the Northern Territory and New South Wales including the Great Barrier Reef, Uluru, Kata Tjuta, Byron Bay and iconic Sydney Harbour. &quot;<\/i><p>The offer did include some perks, not just a random flight over a bunch of random ocean.<p>Similarly, wood cabin rentals are very hot in the US now. An opportunity to do something different that breaks up the monotony without notably raising the COVID risk.<p>Fairly smart move from Qantas, from my POV. People are desperate for a safe(-ish) diversion.  I found the <i>&quot;virtual safe room escapes&quot;<\/i> business model to be pretty similar."],"time":["2020-09-19 03:16:24"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24523645],"kids":[24526813,24525159,24523758],"parent":[24512516],"text":["Don’t they already offer flights to Antarctica that don’t land for sightseeing? And those are 12 hour flights too.<p>It’s interesting that other airlines are adapting by introducing these ‘excursion’ flights for the pent up tourist market."],"time":["2020-09-19 02:50:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cletus"],"id":[24524159],"kids":[24524380,24524258,24524279,24524616,24524572],"parent":[24512516],"text":["While I agree this is a pretty pointless activity, I&#x27;ll point out that modern commercial jets get ~89mpg&#x2F;passenger [1]. A Ford F150 gets about 21mpg.<p>Likewise commercial aviation yields about 0.2 deaths per 10 billion passenger miles [2] compared to 1.13 deaths per 100 million miles driving in the US [3], over 500 times higher.<p>[1]:<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fuel_economy_in_aircraft#:~:text=Lufthansa%2C%20when%20it%20ordered%20both,seat%20layout%20for%20WOW%20Air\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fuel_economy_in_aircraft#:~:te...<\/a>.<p>[2]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Aviation_safety#:~:text=The%20number%20of%20deaths%20per,flying%20in%20a%20commercial%20airplane\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Aviation_safety#:~:text=The%20...<\/a>.<p>[3]: <a href=\"https:&#x2F;&#x2F;www.iihs.org&#x2F;topics&#x2F;fatality-statistics&#x2F;detail&#x2F;state-by-state#:~:text=There%20were%2033%2C654%20fatal%20motor,Columbia%20to%2022.2%20in%20Mississippi\" rel=\"nofollow\">https:&#x2F;&#x2F;www.iihs.org&#x2F;topics&#x2F;fatality-statistics&#x2F;detail&#x2F;state...<\/a>."],"time":["2020-09-19 03:54:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["brettermeier"],"id":[24523998],"kids":[24524890,24524249],"parent":[24512516],"text":["Well, as if there is no climate change... stupid mankind."],"time":["2020-09-19 03:32:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Johnny555"],"id":[24525164],"kids":{},"parent":[24512516],"text":["For me, the best part of a 7 hour flight is getting off the plane (even when I fly business class), I can&#x27;t imagine doing it for no reason."],"time":["2020-09-19 06:46:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["neolog"],"id":[24523912],"kids":[24524322,24523957,24524647,24523950],"parent":[24512516],"text":["I hope flying low over pretty places doesn&#x27;t become popular. Planes are really noisy."],"time":["2020-09-19 03:21:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["lifeformed"],"id":[24524714],"kids":{},"parent":[24512516],"text":["Imagine doing this and not getting a window seat."],"time":["2020-09-19 05:26:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jonny_eh"],"id":[24523704],"kids":[24523965,24523735,24523898,24524353,24524621,24524305],"parent":[24512516],"text":["Seems bad for the environment"],"time":["2020-09-19 02:55:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":["monomyth"],"id":[24525662],"kids":[24526008],"parent":[24512516],"text":["yup, that&#x27;s going to help with pollution so much.<p>Why not just invest into cruise airships?"],"time":["2020-09-19 08:43:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["lyime"],"id":[24524782],"kids":{},"parent":[24512516],"text":["Sounds terrible."],"time":["2020-09-19 05:40:32"],"type":["comment"],"deleted":{},"dead":{}},{"by":["aaron695"],"id":[24524672],"kids":{},"parent":[24512516],"text":["Reminds me of <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;I_Am_Rich\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;I_Am_Rich<\/a><p>I would however say there is a market for explaining what you see when you fly."],"time":["2020-09-19 05:17:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["irvingprime"],"id":[24529841],"kids":[24531976,24532310,24530202,24531262,24531403],"parent":[24527978],"text":["What&#x27;s it like to be old?<p>My boss is younger than I am and is absolutely sure he knows more about my job than I do, even though I&#x27;ve been doing it since before he was born and he never did it at all.<p>People on TV keep trying to sell me stuff like Metamucil, some new kind of cane or similar silly gadget, or a scam investment, none of which I want.<p>My grandkids can&#x27;t understand why I can&#x27;t read things they&#x27;re holding right in front of my face until I&#x27;ve spent twenty minutes finding, then cleaning, my glasses.<p>My wife has heard all of my jokes and all of my excuses. She now criticizes the former and laughs at the latter, instead of the other way around.<p>My friends sound like cranky old sticks-in-the-mud who wish they could turn back the clock to a time that wasn&#x27;t nearly as wonderful as they claim to remember it was.<p>A trip to the supermarket now tires me out and instead of going out with (surviving) friends, I really look forward to taking a nap on the couch. Really.<p>The celebrities I recognize are senile and&#x2F;or decrepit. The ones who are currently popular are appalling.<p>I don&#x27;t have enough money to retire but dream of it every day (See the above comment about my boss).<p>Life is fantastic, except when it&#x27;s not. Whichever it is now, pretty soon, it will be the other one.<p>My advice: Pay attention."],"time":["2020-09-19 21:28:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jfoutz"],"id":[24529510],"kids":[24533586,24533649],"parent":[24527978],"text":["First, you&#x27;ll probably never think of yourself as old. You&#x27;ll look in the mirror and wonder why 20 year old you has all this gray hair and wrinkles.<p>Second, it&#x27;s ok to let things slide for a while, but the longer you let them slide, the tougher they are to fix (and if you wait too long, some things can&#x27;t be fixed). See plenty of other comments about teeth, back, RSI, diet. If you decide to let something go for a while, pick a time to follow up on it, and reevaluate.<p>Third, problems get bigger, stakes get higher. But you&#x27;ll learn more tricks for coping with those problems. Sorta grim, but suicide rates by age climb till 50ish. around then you&#x27;ll have (sorta) seen it all, there&#x27;s not much that the world can throw at you that&#x27;ll put you in a complete tailspin.<p>I can&#x27;t tell you how to live your life. I&#x27;d suggest, be true to yourself, be true to your ethics. If you don&#x27;t know what those are yet, try to figure out who you are. When you&#x27;re stuck in a stressful situation, at the end do you want to feel vindicated? do you want to have a great outcome for everyone? do you want to just leave it all behind? Do you want to just grit your teeth and get through it? Those all point to different values, and can help you figure out who you are.<p>Some people age gracefully and some don&#x27;t. some people get to make choices about that, and some don&#x27;t. It&#x27;s going to be ok.  Everybody gets through their life one way or another."],"time":["2020-09-19 20:33:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mark_l_watson"],"id":[24530980],"kids":[24531060,24533027],"parent":[24527978],"text":["I am 69, so I will chime in here: I now spend much more time dedicated to the food I eat, exercise, and meditation.<p>A good thing is that I mostly no longer care much about changing other people&#x27;s opinions on things. I certainly enjoy talking and expressing myself but if someone listens to me then that is sufficient - they don&#x27;t have to agree with me. It works the other way also: even if I disagree with someone, I can enjoy hearing what they say.<p>I retired 1 1&#x2F;2 years ago and have been enjoying having lots of time to read, write books, spend time with friends and family, and hiking. That said, just yesterday I verbally agreed to a job offer for work that was just too interesting to pass up. Assuming that the employment contract looks good, then I am all-in.<p>My advice is to not worry about getting old, just make sure that you enjoy your life as much as possible. There are sayings about living life one day at a time, but that seems too coarse grained. I would suggest enjoying every minute of your life, and if you are not happy right now, this instant, then file a bug report with yourself. You can&#x27;t do good work if you are not totally into the moment of what you are doing. You can&#x27;t enjoy listening to someone if you are inside your own head and not giving that person your full attention. Play time and family&#x2F;friend time are wasted if you are thinking about wanting to be doing something else.<p>Thanks for posing a good question."],"time":["2020-09-20 01:32:35"],"type":["comment"],"deleted":{},"dead":{}},{"by":["eludwig"],"id":[24529166],"kids":[24530034,24530491,24530414,24529390,24536893,24534976,24529347],"parent":[24527978],"text":["Physically, my best advice is to take good care of your back and your teeth.<p>These 2 things can make a huge quality of life difference once you are past 40. I would also add your eyes, but there is not a lot you can do about that one! Almost everyone needs reading glasses by 40. Glasses suck, but you get used to it.<p>Psychologically, the best I can say is to forgive yourself for any stupid things you did when you were young. Try to be as kind to yourself as you would be to others. I think of this as the &quot;inverse golden rule.&quot; Really important as you get older, because regrets and self-doubt pile up otherwise."],"time":["2020-09-19 19:44:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Lendal"],"id":[24530265],"kids":[24537276,24530855,24530428,24530311],"parent":[24527978],"text":["I remember when I was a teenager and wondering what life would be like at 50. Now I know.<p>You feel exactly the same, only with less time left. You&#x27;re still you. You still feel the same. You still want to experience all the same things and achieve. But now with less time, you have to start triaging some goals and face reality.<p>I remember thinking I have all the time in the world. Now I don&#x27;t. So I guess that&#x27;s the main difference.<p>Also, I used to hold the illusion that I&#x27;d always have my family and parents to talk to. But that&#x27;s not true either."],"time":["2020-09-19 22:56:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["softwaredoug"],"id":[24528885],"kids":[24529000,24529035,24531896,24529038],"parent":[24527978],"text":["Don’t give too much of your life to trying to control (ie politics, other people...).<p>How to do this is of course hard. Meditation helps me. Relationships. Balancing my consumption of news. Staying away from histrionic people that drive that anxiety (read Twitter). Taking a break from that which bothers me (developing hobbies and other interests).<p>Even as I get older I increasingly have a sense that all attempts to control will be resisted by others. Even when you have their best interests at heart. People willfully, sometimes ignorantly make their own big mistakes to resist being controlled. Sometimes though we’re not as smart as we think we are. This applies to so many situations, including work, politics, and parenting!<p>In work situations I am conscious more and more of wanting to lead by following, stepping back, let other people be in charge and get the glory. It’s really the most sustainable path for a sane life. Instead of doing, teach. Instead of teach, listen to other people’s wisdom. Paradoxically by being silent and non-action can sometimes have the biggest impact."],"time":["2020-09-19 19:09:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jedberg"],"id":[24530473],"kids":[24531197,24532258,24532348,24531615,24541073],"parent":[24527978],"text":["No matter how you live your youth, you will probably regret it when you are older.  Unless you inherit so much money that you don&#x27;t have to ever work in your life.<p>If you spend your youth having fun and enjoying your youth, then when you get to middle age you&#x27;ll have wished you worked harder and saved more so you could be wealthy and comfortable.<p>If you work your butt off in your youth and have lots of money and successful career, you&#x27;ll wish you spent more time relaxing and having fun in your youth.<p>The key is finding a good balance between working hard and playing hard.  Your career won&#x27;t suffer if you take a week long vacation.  Your health will be fine if you sometimes volunteer to do a weekend shift.  Do both and you can be successful and happy about how you spent your youth."],"time":["2020-09-19 23:37:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kinkrtyavimoodh"],"id":[24531269],"kids":{},"parent":[24527978],"text":["Being generally mindful of what you eat and how much you weigh should be second nature to you, not something you start doing frantically when you are 50 pounds overweight.<p>Weigh yourself at least once a week in a consistent fashion (say, in the morning after peeing and pooping). If you notice your weight drifting up (&gt; 1 lb over long-term baseline) for two weeks, do a quick audit of your diet, cut on excess sugar, carbs etc. until it&#x27;s back to the baseline.<p>It&#x27;s relatively trivial to lose 1-2lbs over a few weeks. But doing it once you are 50 lbs overweight will be one of the hardest things you will do, coz you will feel like shit on most days.<p>Also, if you have not generally been athletic in your youth, beware of doing extreme bulk-cut cycles to gain muscle in your 30s and later. It&#x27;s easy to gain fat, hard to gain muscle, and you are much more likely to end up just fat while convincing yourself you are &#x27;bulking&#x27;."],"time":["2020-09-20 02:54:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["inglor_cz"],"id":[24532802],"kids":[24543805],"parent":[24527978],"text":["IDK if at 42 I am considered older, which means that I probably am.<p>Do take care of your health. Really, do. Even though genetic makeup of our bodies obviously plays a role, at my age the gap between people who care and people who don&#x27;t starts resembling a chasm. You have slender and vital fortysomethings that still hike in the mountains and you have 400lb T2 diabetes sufferers who have hard time tying their shoelaces. Don&#x27;t strive to be the second type. Imprisoning yourself in sick body is not cool.<p>Some substances like tobacco, alcohol and sugar are emphatically bad for you, especially in quantities that we tend to consume. Our modern society is all about overconsumption, so buyer, beware. Having a piece of cake every few weeks is OK, but you will be driven into making it a daily habit, unless you resist the pressure. Resist it.<p>There is one more reason to keep yourself healthy. There are absolutely fantastic treatments in the research pipeline. Stem cell regeneration, genetic modifications etc. Some of those will fizzle out in the testing phase, but some will not, and those that prove themselves will change what &quot;aging&quot; even means. In 2050, heart attacks, atherosclerosis and cancers may be as rare as scurvy is today. Today&#x27;s middle aged and young people will probably have much better silver years than anyone before.<p>But you really need to survive the next decade(s) to make use of those developments."],"time":["2020-09-20 10:58:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Smaug123"],"id":[24529244],"kids":[24529357,24529435],"parent":[24527978],"text":["This is not my advice - I&#x27;m 26 - but was given to me at school by a now-retired teacher I greatly respect. It sounds quite wise, and I trust the source.<p>I paraphrase: &quot;Learn to classify people into three categories: givers, sharers, and takers. Surround yourself with givers. Sharers are also acceptable. Cut out the takers as quickly as you can.&quot;<p>A verbatim follow-on quote: &quot;Takers make a beeline for givers. The needy are always anxious to drain the emotions and finances of those who are givers, before somehow or other they move on to sponge elsewhere, leaving givers to wonder at their own foolishness.&quot;<p>(Edit: apparently people don&#x27;t want advice from older people to younger people if it&#x27;s not the older person giving it. I can only apologise. It&#x27;s the primary piece of concrete actionable life advice I remember that was given to me by anyone more than three times my age.)"],"time":["2020-09-19 19:55:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rikroots"],"id":[24530609],"kids":[24534298],"parent":[24527978],"text":["1. Find good friends; keep good friends. You&#x27;ll probably only find a handful of these throughout your life. Good friends help validate your existence and make life worth living. They will surprise you. They may turn out to be a lot older than you, or a lot younger. They may be people you grow up with, or only meet online. You may go for years without meeting&#x2F;talking to them, but as soon as you&#x27;re together again everything just becomes &#x27;right&#x27; again. Good friends: they really are the meaning of life!<p>2. Anyone who tells you they know what they&#x27;re doing - they&#x27;re lying. There&#x27;s no instruction manual to life. There&#x27;s no Grand Design or plan or destiny or whatever. Everybody around you is making it up - somehow making life work - as they go through each hour of the day, each day of the year. What works for someone else might work for you. Or it might not. It&#x27;s your adventure: go live it!<p>3. In spite of (2) above, learn to listen. Really listen. Open your ears, then open them again. It&#x27;s how you learn stuff. Taker time to listen to people who you wouldn&#x27;t normally listen to - like people you take for granted. A lot of the stuff you get to learn will be really useful - often in very unexpected ways. A lot of it will be of no use to you whatsoever, but the act of being listened to may have a profound effect on the person you&#x27;re listening to. You never know - that person might just turn into your next Good Friend.<p>4. Growing old - it hurts. A lot. It hurts your confidence; it hurts your self-image. It hurts your bones and muscles in ways you never imagined it could hurt. I think there&#x27;s a lesson in this, but I haven&#x27;t managed to learn it yet. I particularly hate my bladder when it wakes me up at Stupid O&#x27;Clock because I forgot the lesson about not drinking hot beverages too close to bedtime.<p>5. Power naps, on the other hand - they&#x27;re cool!"],"time":["2020-09-20 00:03:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["the_resistence"],"id":[24533846],"kids":[24539769],"parent":[24527978],"text":["My advice at mid-50s to younger people is to learn 1. manage your energy for your long term health, 2. enjoy time with the highest quality people you can find (I mean that in terms of good language, hopeful, constructive&#x2F;collaborative in nature and working on themselves, empathetic to all those around you), and lastly say &quot;yes&quot; to almost everything and enjoy to the max. If my life were a candle, every year it is slowly losing some if its brightness&#x2F;energy through no fault or effort on my own. I had an unusual situation which aged me faster than I ever wished for-- lost my mid-30s wife to a rare cancer 3 years after diagnosis. A part of me died with her and my heart will never heal.  Still I wake up hopeful every day. We are all along for a short ride, enjoy the hell out of it. It could&#x2F;will disappear in an instant."],"time":["2020-09-20 15:18:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tasty_freeze"],"id":[24530554],"kids":[24531049,24532108,24530627],"parent":[24527978],"text":["I&#x27;m 56, so not that old, but age is increasingly a concern. Confirming what others have said - I am very much in touch with the teenage me and everything between. The days are long and the decades are short, indeed.<p>Health - for me, health it isn&#x27;t about living a long time, it is living with self sufficiency and minimizing pain. I am not afraid of death, but I am afraid of the years of infirmity which often precedes it. I&#x27;m afraid of living the end of my life without my wife, but even more afraid of leaving her to finish life alone.<p>Regrets - I wasted too many years missing opportunities for fear of disappointing my parents or (later) risking appearing foolish. I assume HN has a higher than normal mix of introverts, so maybe you can relate.<p>Urgency - turning 30, 40, even 50 didn&#x27;t phase me; I felt young and time seemed endless. But in the past five years the switch has flipped. In 14 years I&#x27;ll be 70. The mortality curve is tilting up dramatically; friends and family will have died (perhaps me too). Many of the things that I always wanted to do will not be possible, so I had better attend to them now. There are far too many such desires, so triaging what is most important takes up more of time.<p>Work&#x2F;life - I&#x27;ll do my job competently and I&#x27;ll leave it to the younger folks to be the hero at work. I think back on the deadline death marches and jumping on grenades to get projects back on schedule ... and every one of those deadlines was a sham. The products I sacrificed so much for were in the discount bin a year later."],"time":["2020-09-19 23:52:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tchaffee"],"id":[24529537],"kids":{},"parent":[24527978],"text":["Say no to fun stuff 20% of the time and invest that money - the younger the better. Time is your very best friend when it comes to retiring comfortably. But say &quot;yes&quot; to enough things that you&#x27;ll have fond memories to look back on with friends and family.<p>Time does start passing quicker. Perhaps the brain slows down and you capture fewer frames per second, but the end result is you start to learn how important it is to prioritize to avoid having spent your precious time on trivial things instead of meaningful things.<p>Time is infinitely valuable compared to money. Do the math. You can always earn more money, but you will run out of time. Does that contradict my first statement? No. When you&#x27;re older you&#x27;ll want enough money to be able to spend your time as you wish.<p>The vast majority of things you think are of the utmost priority now will seem trivial looking back on them ten years later. If you can learn this early it makes it far easier to remain rational about your decisions and how much things are worth.<p>Your body will start getting in the way of things you want to accomplish. You&#x27;ll get tired sooner, you&#x27;ll have health problems that interrupt your momentum or require long periods of recovery, it will be frustrating to struggle at things that were once easy. Don&#x27;t wait too late to do the things you are truly passionate about. Retirement might be too late."],"time":["2020-09-19 20:36:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["japhyr"],"id":[24534789],"kids":{},"parent":[24527978],"text":["I&#x27;m only 47, but I have a couple guiding principles that have been helpful so far. The first is to stay flexible. I&#x27;ve been a runner, hiker, bicyclist, climber, kayaker etc all my life. I&#x27;ve gone in and out of shape depending on what&#x27;s happening in my life. The only times I&#x27;ve really struggled physically have been when I let my muscles get really tight. Three weeks of steady stretching has done more than anything to make me feel better physically. If I can&#x27;t run for some reason, maintaining flexibility makes it much easier to pick up any of these activities again.<p>The second is to find some new, significant challenge in each decade of life. Learning new things keeps us humble and alive. In my twenties I focused on teaching and long-distance bicycle travel. In my thirties I moved to Alaska and began doing mountain rescue work. In my forties I wrote a book, changed careers, and learned to drive a boat on the ocean. Each of these new experiences made me feel like I was 20 again, taking me far outside my comfort zone. In future decades I hope to learn a musical instrument well, and travel internationally. I&#x27;d also like to take another long bicycle trip and live without a motor for an extended period again.<p>There is great joy in growing old; it&#x27;s much better than the alternative. :)"],"time":["2020-09-20 18:09:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jeffrallen"],"id":[24533804],"kids":{},"parent":[24527978],"text":["I&#x27;m surprised that most of these answers are individualistic. I&#x27;m 48, so not really the target respondent, but I&#x27;ve got this to say: getting old is not about me, it&#x27;s about what I have to give to my wife, my children, my colleagues, my church, and my community. I have faith I&#x27;ll get what I need back from them, when I need it. For now, I&#x27;m investing in my future by investing in those around me."],"time":["2020-09-20 15:10:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ljnelson"],"id":[24529398],"kids":{},"parent":[24527978],"text":["This seems like it isn&#x27;t physically related, but it is: as the years accumulate, it becomes more and more clear that the person staring back at you in the mirror is the one you have to live with most intimately. Do the best you can with what you have, in all things, always.  The person in the mirror will know whether it was the best you could, and he or she or they will also know whether you can be forgiven for any given action given what you had at the time. The biggest part of this is unkindness: If you are unkind, that person in the mirror will never let you forget it. You may not spend much time on this when you are young but you will spend a lot of time on it when you are older."],"time":["2020-09-19 20:17:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jimhefferon"],"id":[24529483],"kids":{},"parent":[24527978],"text":["61.  Choose your life partner with care.<p>Three in the morning and a kid with 105 who has been throwing up for a day and you have to decide what to do.  A crappy apartment but making a morgage would be a real stretch, no fun for years, and you need to work it out.  A job you want but in a place far away from family and friends.   These things and many more will be between you and them.<p>Finding somebody you like, and admire, and who you like to get sexy with, and who has something of the same idea about money as you do, and who wants many of the same things in life, is tough."],"time":["2020-09-19 20:29:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["stephc_int13"],"id":[24530295],"kids":[24532284],"parent":[24527978],"text":["My first advice would be to not underestimate the importance of sleep. This is a key factor for both quality of life and productivity. The only way to optimize sleep is to sleep enough.<p>Second, try to understand the power of compound interests as soon as you can.  Life is long enough to invest and see the returns. Invest in yourself and in projects with long-term value, don&#x27;t be seduced by shortcuts and don&#x27;t be a slave.<p>Last thing, there is a lot of blind and seemingly unjust randomness in life, it is better to embrace it."],"time":["2020-09-19 23:03:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["qw"],"id":[24529050],"kids":[24529416,24529361],"parent":[24527978],"text":["When I was younger, I could skip most of the homework because I learned enough during class. The mandatory assignments were sometimes finished quickly just before I had to turn them in.<p>I didn&#x27;t get the necessary practice and discipline to do independent work unless I did it for fun. This had to be learned the hard way when I grew older."],"time":["2020-09-19 19:27:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["PopeDotNinja"],"id":[24531540],"kids":{},"parent":[24527978],"text":["I’m 45.  At 40 I wondered if I’d ever feel successful.  I’d just been fired from a shit job that took advantage of me and once again I was trying to scramble to find meaningful employment.  I found it a month later, and now retirement at 50 seems like a remote possibility if save aggressively and live a modest life.<p>Feeling hopeless at 40 sucked more than feeling hopeless at 20.  Feeling hopeful at 45 is more amazing than feeling hopeful at 25.  So I guess I appreciate the good and the bad more now than I used to."],"time":["2020-09-20 04:21:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jedberg"],"id":[24530499],"kids":{},"parent":[24527978],"text":["Your body just won&#x27;t work like it used to, even if you do all the right things to keep it up.  When I was in my 20s I could spend all day working the yard, cutting, raking, digging, sweeping.  I would stretch afterwards and be find the next day.  Now, despite having an even greater level of day-to-day physical activity and more exercise, it will take me a few days to recover.<p>Once you hit 40 you start feeling random pains in places.  Sometimes pretty intense pain.  Your doctor will have no idea what caused it and tell you it&#x27;s normal, but let them know if it happens again.  And after a while you&#x27;ll just stop telling them, because it&#x27;s just a thing that happens now."],"time":["2020-09-19 23:40:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sizzle"],"id":[24531396],"kids":[24531458],"parent":[24527978],"text":["Ageism in tech is real. Don&#x27;t act like you won&#x27;t be old one day when you scoff at an older engineer&#x27;s resume during the interview process.<p>You will blink your eyes and be on the other side of the interview table in due time and be thinking the same thing my friend."],"time":["2020-09-20 03:37:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["austincheney"],"id":[24528137],"kids":[24529402],"parent":[24527978],"text":["Be cognizant of phony social pretexts. I can remember everybody saying I needed to go to college. I did but I don’t college to be a software developer. Go to college not because of some bullshit social pretext but because you honestly want an expanded education.<p>Do the hard things first. Hard things get easier with practice but practice takes time. The easy things remain easy regardless of practice and just rob you of the time required by the hard things."],"time":["2020-09-19 17:37:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kyriakos"],"id":[24529320],"kids":[24529642],"parent":[24527978],"text":["Losing weight or gaining muscle mass gets harder and harder as you age so the older you get so its important to keep a diet and exercise routine that keeps you at a good condition cause letting go makes things go bad much quicker and takes way more effort to get back in shape."],"time":["2020-09-19 20:06:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hazeii"],"id":[24529268],"kids":[24532974,24530640],"parent":[24527978],"text":["Ride a bicycle and learn C (I&#x27;ve been doing the first for 50+ years and the second for 30+ [0]).<p>Some skills never go out of fashion.<p>[0] Personally, I found learning C harder than falling off bicycles."],"time":["2020-09-19 19:59:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["somberi"],"id":[24529502],"kids":[24541586,24530416],"parent":[24527978],"text":["I am 47.  This Buddhist quote captures the rapidity of life - &quot;Days are long; Decades are short&quot;.<p>Be kind. Really try to be kind. As young person, I am sure you already can recollect a few instances you have been kind; increase the frequency and amplitude of it."],"time":["2020-09-19 20:32:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["new_guy"],"id":[24529219],"kids":[24529362,24529241],"parent":[24527978],"text":["1, people don&#x27;t feel old mentally, they feel like a young person trapped in an old persons body<p>2, time goes by way faster than you think, blink and you&#x27;ll quite literally miss decades of your life<p>advice? don&#x27;t ever put off until tomorrow what you can do today, the old you is depending on the you now to look out for him&#x2F;her."],"time":["2020-09-19 19:51:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["everybodyknows"],"id":[24530841],"kids":{},"parent":[24527978],"text":["If you often don&#x27;t feel well, keep investigating. Don&#x27;t just let it go if you see a couple of docs and they can&#x27;t help.<p>Certain disorders are so subtle and poorly understood that they may go undiagnosed for years -- and those years may later be recalled as having held very little fun for you.  Examples: autoimmune, food intolerance."],"time":["2020-09-20 00:55:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["techbio"],"id":[24528763],"kids":[24530263],"parent":[24527978],"text":["This reminds me of the time I interviewed for a developer job at a young startup (college dropouts and just-grads), and the interviewer asked me, age 26, &quot;what is like to be so old?&quot;<p>Given time, you&#x27;ll see."],"time":["2020-09-19 18:54:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["didip"],"id":[24531229],"kids":[24532025],"parent":[24527978],"text":["Don&#x27;t wait until you past 40 years old to take care of your health. Starts now.<p>Physical exercise becomes more important to fight against aging. Especially core exercises to take care of your back.<p>Watch your diet and eat well because it&#x27;s so much harder to lose weight when you are older. Not to mention your innards are deteriorating fast if you abuse them.<p>Contact sports or extreme sports has super high cost when you are older. Imagine breaking your wrist playing snowboard and you have to be out of work for multiple months, unable to make a living by typing, etc."],"time":["2020-09-20 02:44:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["axaxs"],"id":[24529448],"kids":[24531238,24529473],"parent":[24527978],"text":["I&#x27;m not &#x27;old&#x27;, but I&#x27;m not young anymore either, though I still remember it.  My biggest personal gripe is my brain slowly slipping.  It&#x27;s just not as fast as it used to be, and my memory not anywhere as good.  I was always a person who could remember everything, even playback full conversations in my head.  Now I barely remember what I had for dinner a couple days back.<p>This has affected my work as I used to just be able to sit and code for hours in Vim as I&#x27;d have all the function signatures memorized, but now I spend a lot more time in the docs and have to use a proper IDE.  I now write more helpful comments, so I can remember why I did something.  Also, I find myself having to take notes to come back to later.  I wish it was a skill I&#x27;d picked up when I was younger, rather than having to learn now."],"time":["2020-09-19 20:23:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["AnimalMuppet"],"id":[24528285],"kids":{},"parent":[24527978],"text":["Take care of your body.<p>People matter.  Learn how to interact well with them.  Yes, it matters that you be yourself, and that you hold to what is true, but don&#x27;t use either of those as an excuse to be clumsy (or worse, brutal) with people.<p>Even things like clothes matter, because they&#x27;re part of how we interact with people."],"time":["2020-09-19 17:53:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dave333"],"id":[24561970],"kids":{},"parent":[24527978],"text":["Be careful with diet and avoid any extreme diets. I went on a low calorie diet for a couple of years and lost weight, but I ate a lot of a generic pudding product that turned out to contain a lot of titanium dioxide that I believe caused me to get sick with the rare yellow nail syndrome and now I have compromised lung function rather like CPOD.\nAnother thing that is much more important than people realize is gut microbiome.\nHave fun while you can - don&#x27;t leave it until later."],"time":["2020-09-23 03:24:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["neltnerb"],"id":[24529265],"kids":{},"parent":[24527978],"text":["My experience with aging is that you accumulate more and more injuries and illnesses and heal more and more slowly.<p>The advice I&#x27;d give is to assume that any activity you might ever want to do will be harder next year."],"time":["2020-09-19 19:58:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24561948],"kids":{},"parent":[24527978],"text":{},"time":["2020-09-23 03:18:50"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["avenger123"],"id":[24532064],"kids":[24532745],"parent":[24527978],"text":["It&#x27;s never too late to get healthy at any age. I&#x27;ve realized this after many years but have finally started to take it seriously.<p>I follow a lot of literature and social media around fitness. I think the rise of social media has made fitness seem out of reach for most people. Seeing these fitness personalities usually being in the top percentile in terms of genetics for body weight, muscle definition and just looking amazing makes the rest of us feel like it&#x27;s not something we can do easily. Having most of these people spout their pseudo science also doesn&#x27;t help. It&#x27;s hard for any sane person to understand what to do, whether its diet (keto, low-carb, water fasting, carnivore diet, etc.) since there is so many possibilities.<p>As I&#x27;ve grown older I&#x27;ve realized that staying fit has so many benefits that it might as well be the best anti-aging change we can make for ourselves.<p>If you&#x27;re over 25% or more body fat, it&#x27;s worth figuring out how to bring that down to 20% or less. See how far you can go. Not all of us can get to 12% and maintain it without feeling like we&#x27;re starving ourselves but I think the higher range is doable.<p>I&#x27;ve realized for diet and exercise there is no one answer for anyone. The wisdom of eat less, exercise more seems to be the ultimate truth.<p>What that looks like for each person is unique. Personally for me I&#x27;ve tried all of it. I&#x27;ve done the 7 day water fast, intermittent fasting, low-carb eating, etc. At the end, as long as I&#x27;m eating within my maintenance calories relatively good clean food it doesn&#x27;t matter for me which one I do.<p>For exercise, I&#x27;ve settled on three total body weightlifting sessions with half an hour cardio session on the non-weightlifting days.<p>So, the best thing you can do as you getting older is figure out what works for you. There is so many ways of eating and exercising and sometimes it takes a while to understand what works for your body."],"time":["2020-09-20 07:24:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["endori97"],"id":[24529238],"kids":[24529817,24529269],"parent":[24527978],"text":["Experience the benefits of fasting -- it will take care of excess weight and has other benefits."],"time":["2020-09-19 19:54:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["chadcmulligan"],"id":[24530603],"kids":{},"parent":[24527978],"text":["Don&#x27;t worry - it will all work out. I spent a lot of time when I was younger worrying about stuff - stuff that never happened. The stuff that did happen I never thought about until it happened. I don&#x27;t worry any more - everyone I know who&#x27;s having a good second half doesn&#x27;t worry. (I don&#x27;t mean skip the basics - save some money, look after your health, don&#x27;t drink to much)"],"time":["2020-09-20 00:02:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["xupybd"],"id":[24530292],"kids":[24530457],"parent":[24527978],"text":["My father is 64. He has just been given months to live. He will be the second in my family to die from lung disease caused by smoking. My advice for any young person, don&#x27;t smoke it&#x27;ll rob you of years of life."],"time":["2020-09-19 23:02:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["motohagiography"],"id":[24529386],"kids":[24529670],"parent":[24527978],"text":["1. Language is just a tool our species uses to act through others, invented as a necessary means to protect and manage children and that has evolved to other uses, but it is a narrow keyhole through which to experience the world, or to express it. Most suffering is an artifact of it, and most joy is inexpressible in it.<p>2. Regret is almost always about what you didn&#x27;t do, and rarely about what you chose freely or decided yourself.<p>3. Understand the effect of compounding in every endeavour.<p>4. There is no 4."],"time":["2020-09-19 20:15:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["p0d"],"id":[24533887],"kids":{},"parent":[24527978],"text":["I had my 25th wedding anniversary this week. My advice is to go for the boy&#x2F;girl you think is too good for you. Whether that be brains, personality or looks. The young often lack confidence despite their cockyness. I got lucky and got the girl who was out of my league. My self doubt nearly sent me down a different path."],"time":["2020-09-20 15:24:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["baccheion"],"id":[24530654],"kids":{},"parent":[24527978],"text":["I realized at some point that if I took a 1-year break between high school and college, I could&#x27;ve secured retirement right away.<p>$12&#x2F;hr is $24k&#x2F;year. The summer after high school and the full year that follows is 1.25 years. That&#x27;s now $30k. Working nights and weekends (2 part-time jobs) doubles it to $60k. After taxes, there&#x27;s roughly $48k left. $40k would roughly double (in the original year&#x27;s currency) every 10 years if the S&amp;P 500 kept growing at the historical average 7% over inflation. That&#x27;s $640k at 59 and $1.28MM at 69.<p>Meet all RDAs with just a variety of quality whole foods, 1:1:1 calcium:phosphorus:magnesium, and ensure sufficient quality sleep. Sustained-release melatonin eventually. ZMA may work well enough for younger males.<p>Keep big hormones at pubertal levels as long as you can. Naturally (just foods, vitamins, and minerals; not excess protein or other tricks) raise IGF-1 as much as you can. Match levels of progesterone&#x2F;melatonin, hGH, and DHEA present at the age IGF-1 represents.<p>At most 5-10% of romantic pairings can be minimally mutually satisfying once the dust settles. Not 5-10% of relationships entered by a person. Rather, 5-10 out of 100 randomly selected males and 5-10 out of 100 randomly selected women. Such a reality does not mute love, lust, the initial high&#x2F;spark that can last months up to even 2.5 years, or pregnancy.<p>Many can go a long time without realizing compatibility once paired is uncommon. Worse, as 20% or 50% of women encountered (by MSW) are a mutual match. Overlap (many matching with the same 20%), aesthetic misalignments, etc all reduce likelihood of progression.<p>The typical ages at which men and women get married are 29 and 28. 50% between those 26-35 end in divorce within 10 years. 2&#x2F;3rds of second marriages end within 10 years. 75% of third.<p>80% of people over 40 have been married at least once. 80% of women over 40 have had at least 1 child.<p>25-30 are peak years for saving. And f*cking. Avoid (relationships,) marriage and definitely kids until after. Wait until you can think clearly.<p>Why buy a house if you don&#x27;t have any kids? Houses are easily a trap. Always pay cash (ie, avoid debt). Even for a car. Even for an education (tricky). And even for a house!<p>Save at least 50% of take-home salary to a high-yield investment account, even if just buying up the S&amp;P 500 fund. Eventually, the amount saved&#x2F;compounded will recover all after-tax money ever earned. At such a time, the interest&#x2F;DRIP income will replace the take-home salary. Usually happens in 15-20 years."],"time":["2020-09-20 00:13:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MrDresden"],"id":[24533626],"kids":{},"parent":[24527978],"text":["If I can be so bold to offer up some of what I have learned in my short existence (am in my mid thirties), none of which is my own wisdom but simply cemented in place by my own experiences.<p>After going through a tough time with a parent in my early twenties, where an accident involving brain hemorrhaging caused a massive shift in personality and speech, I can not stress enough how good advice it is to savour and fully utilize each moment with your loved ones while you can. He ended up passing away less then a year after the accident.<p>Get rid of your fomo. There will always be new tech. There will always be something new. You can&#x27;t do, see, experience, read, learn it all. Having gone through my twenties often in crippling fear of being &quot;left behind&quot;, I look back now and see that I enjoyed those years less because of this need to be up on everything, which just had the oppposite intended effect.<p>Your health is important no matter your age, your mental health doubly so. Strive to work smart, not hard. Realize when you are being pushed into a situation where your health is going to be impacted, and stand your ground against it. I have gone through three burnouts, each one more serious than the previous one. One caused a relationship to end. Last one required me to seek professional assistance (which by the way helped immensely and I now openly talk to people about without shame). Know your limits, and work on pushing them in a reasonable manner, but do so on your terms if that is what you want to do.<p>Realize how difficult it is to live with another human being for a long time, and how rare it is to find somebody who genuinenly loves you for who you are as a person (both the good and the bad) and will stand by your side through thick and thin (and your own bullshit). Treasure that kind of relationship, above anything else. Momentary opportunities come and go. Never jepordize what you have for short time gains.<p>And be financially smart and frugal. Save. But also live life."],"time":["2020-09-20 14:31:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bornabox"],"id":[24532849],"kids":{},"parent":[24527978],"text":["I&#x27;ve learned that &quot;old&quot; is just a sliding scale. \nWhen I was in my teens, I considered 30 old.\nWhen I was in my 20s, I considered 40 old. And so on.\nDon&#x27;t get too hung up on the exact number.<p>Also, there&#x27;s a physical age and a mental age.\nOne definition of old is, when these numbers don&#x27;t match up anymore. And yes, by this definition some young people are old and vice versa - that&#x27;s the idea!<p>Saying, &quot;I&#x27;ll do that when I&#x27;m older or when I retire&quot; just means that you&#x27;ll never do it.<p>Getting older usually means acquiring more experiences. It doesn&#x27;t mean that everyone is equally good at it, typically a healthy dose of self-reflection helps.<p>And lastly, memories tend to fade, which is a blessing, pr sometimes a curse. But mostly it helps to blur things in the past. Which explains why older people tend to idealise how things used to be (they only remember the good parts). But it also helps people get over things."],"time":["2020-09-20 11:15:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["superasn"],"id":[24529106],"kids":[24529413,24529289,24530758],"parent":[24527978],"text":["I&#x27;ve posted about this many times here and so have a lot of other people: If you&#x27;re suffering from any chronic aches or pains especially back pain or RSI it may be TMS (though only a doctor can tell you that but you need to be informed).<p>The internet and medical community is full of misinformed people who will fill your head about how a pinched nerve or a slipped disc can cause you immense pain and some doctor may even put you under the knife. But at least read about TMS before you do something drastic.<p>See tmswiki.org (not my site) for hundreds and thousands of people who have recovered from decades of back pain after spending hundreds and thousands of dollars but never realized it could be simple TMS which doesn&#x27;t cost a dime to fix.<p>I&#x27;m amongst one of these people and after nearly suffering for many many years did someone on hacker news posted about it and that comment changed my life literally. Pain is all I could think about back then and it interfered with my work, relationships, life. Just reading Sarnos book got me halfway there. Then daily exercises and watching hundreds of testimonials on YouTube made by common people helped me more."],"time":["2020-09-19 19:34:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["wadavis"],"id":[24531986],"kids":[24533720],"parent":[24527978],"text":["How old is &quot;old&quot;? FWIW as i got &quot;older&quot;:<p>Health:<p>when young I suffered muscle pain when I worked out. At 40 the pain changed to a skeletal pain, which wasn&#x27;t nice. At 60 it started to be more tendonitis than anything else. At 70 it&#x27;s gone unless I suffer an injury, whereupon weird stuff happens, e.g. hand injured a little in a fall, subsequent cat scratches cause the injury to flare up, time to get an antibiotic injection - strange!<p>I <i>feel<\/i> heavy, especially when I lay down to sleep at night. OTOH I&#x27;m working out more consistently than I ever have, my weight is down from 220 to 185, and so probably I&#x27;m more dense.<p>I&#x27;m <i>much<\/i> quicker than I ever was: I catch falling objects mid-air, stop other&#x27;s falls, intercept slips and, in general, am scary quick. This weirds me out a bit. I have heard that some people are quicker than others but, other than extremely obvious cases of physically slow people, didn&#x27;t believe that it was possible for one person to be significantly quicker than another. I&#x27;ve changed my mind about that now.<p>I have no known serious problems - everything is working fine, and am primarily concerned about my CV system: all else will IMO follow. I take a low dosage statin but I may not need it. More importantly, I&#x27;m realizing the simple frailty of the human body and so have re-evaluated different activities: driving (still do), cycling(won&#x27;t do - crazy in my city!). \nBack pain: had it since I lifted too much weight 40 years ago. Almost debilitating in the last 2 years until I found some simple exercises that made it go away. Most every man will suffer at least one serious back injury - if you do, you just have to keep searching until you find the fix that works for you.<p>Advice:<p>1. Don&#x27;t ever ever pick up more weight than you&#x27;ve picked up before unless it is a real emergency, \n2. If a sexual opportunity seems too good to be true, it probably is - don&#x27;t accept it. Herpes(or worse) is no fun, no matter how the herpetic community may spin it. Note to my younger self: don&#x27;t touch the beautiful blonde!<p>3. Always take the highest offer but be ready to walk out if things go badly.<p>4. Don&#x27;t fall for the sunken-cost fallacy - if you&#x27;re in a bad relationship of any sort then get out early and consider yourself lucky. See &quot;The Art of Thinking Clearly by Rolf Dobelli for more. This especially includes love."],"time":["2020-09-20 06:55:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tomohawk"],"id":[24531119],"kids":{},"parent":[24527978],"text":["Life&#x27;s short.  Don&#x27;t spend it in debt to banks.  Paying off your debts is life changing.  Imagine heading into the 2008 recession with a paid off house and car, and an emergency fund that will pay at least 6 months of expenses.  Financial worries are one of the top 3 things couples argue about.  Be different.<p>Don&#x27;t sabotage yourself by not taking care of your body.  Avoid alcohol, tobacco, and other drugs.  You can live without them, and you&#x27;ll be much healthier.  Avoid excess sugar.  If its not a desert, it should not be high in sugar.  Work out.  Take walks.  Hike.  By the time you&#x27;re 50, you&#x27;ll notice that people who have not taken care of themselves are no longer able to work mentally demanding jobs.<p>Pay attention to stress.  It&#x27;s the big killer.  It will kill your ability to think, and your ability to have meaningful relationships.  And, eventually, it will kill you.  If you&#x27;re getting stressed, find a different way, a different job - change whatever you have to."],"time":["2020-09-20 02:14:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jelliclesfarm"],"id":[24528236],"kids":[24529277,24528884,24529316,24528432],"parent":[24527978],"text":["I think growing old in 1900 is diff from growing old in 2020. I don’t think these are experiences that translate well over time and place.<p>‘What advice would I give my younger self’ also doesn’t compute. Because that would mean that I would end up with entirely different life experience and the person giving the advice would not exist as they would have changed. In sci fi, this would be the classic causal loop&#x2F;temporal paradox time travel dilemma.<p>If this is about health, you are better off obtaining a DNA report and go through the high risk illnesses you have inherited with your physician. I did this and was able to identify a few things missed by my previous maternal units. Some of them probably died because one mutation was undiagnosed.<p>From a dietary perspective, follow the grandmother diet. Eat what your longest living ancestors lived. It helps if you haven’t migrated far off.<p>P.S: Don’t rely on dna ancestry reports migrations. I am South East Asian and ancestry report suggested that I had a Finnish ancestor. I doubt if I can follow the Sami diet. In California. So there is that...<p>My suggestion is to draw a family tree for upto 4-7 generations. 7 is ideal but would be tough for most."],"time":["2020-09-19 17:48:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["audition"],"id":[24549273],"kids":{},"parent":[24527978],"text":["Bill Gates Sr. answered the question this way: I can relate to the answer the late Bruce Bliven, a former editor of the New Republic, was reported to have given when someone asked him what it felt like to be an old man.\nHe said, “I don&#x27;t feel like an old man. I feel like a young man with something the matter with him.”<p>How do you avoid, prevent or postpone getting &quot;something the matter&quot; with you?  I second what others in this thread have said: attend to diet and exercise, take care not to injure your eyes, ears, back or knees.  Diet might be the most important place to start - have a look at <a href=\"https:&#x2F;&#x2F;gamechangersmovie.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gamechangersmovie.com&#x2F;<\/a>"],"time":["2020-09-22 00:51:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mr_toad"],"id":[24531207],"kids":{},"parent":[24527978],"text":["Turns out that loud music really does damage your hearing."],"time":["2020-09-20 02:38:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["wombatmobile"],"id":[24533554],"kids":{},"parent":[24527978],"text":["&quot;I highly recommend getting older!  There&#x27;s less tendency to people-please.&quot;<p>-- Alanis Morrissette<p>&quot;As I started getting older, I realized, &#x27;I&#x27;m so happy!&#x27;  I didn&#x27;t expect this.  I wasn&#x27;t happy when I was young.&quot;<p>-- Jane Fonda"],"time":["2020-09-20 14:15:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["LVB"],"id":[24529508],"kids":{},"parent":[24527978],"text":["I actively avoid trying to let nostalgia creep in too often. I don’t spend much time reminiscing, listening to old music, rewatching things, looking at pictures, etc. This seems to not match what most of my cohort does, but I recognized a correlation between too much looking back and feeling somber."],"time":["2020-09-19 20:32:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Simulacra"],"id":[24528867],"kids":[24529429,24530927,24529415],"parent":[24527978],"text":["Trust no one, just because you work well with someone doesn’t mean they like you."],"time":["2020-09-19 19:07:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ljsocal"],"id":[24534723],"kids":{},"parent":[24527978],"text":["1) save&#x2F;invest $ aggressively. Financial independence has huge benefits in the near-term and long-term. You don’t need most of the crap you’re buying. \n2) if you choose to have kids, make spending time with them priority #1. There is nothing more rewarding. \n3) immerse yourself in nature frequently (without much gear)\n4) find opportunities to work&#x2F;volunteer&#x2F;friend with people from a diverse array of backgrounds\n5) listen:talk 5:1\n6) amen to dental care comments\n7) learn continually about a wide array of topics"],"time":["2020-09-20 18:00:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["lucas_membrane"],"id":[24532779],"kids":{},"parent":[24527978],"text":["Advice #1:  You are what you do every day.   Choose to be something good and do it every day.   An organizing principle of time management is that all we have is our time here.  What you do every day should rarely appear urgent and you may find it difficult, but if it is what you want to be, it sustains focus and peace of mind.<p>Advice #2:  Associate with people of the highest aspirations who live lives of character and integrity according  to strong moral and ethical standards that you can admire. Solitary virtue is often futile, and I wish I had given people less credit for being interesting."],"time":["2020-09-20 10:50:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sizzle"],"id":[24531421],"kids":{},"parent":[24527978],"text":["With sufficient age, cancer is highly likely to rear its ugly head. After a certain age, waking up without pain and enjoying the simple things in life like good food, conversation with family and friends, a laugh, etc. are a gift and a blessing."],"time":["2020-09-20 03:44:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rasengan0"],"id":[24530682],"kids":{},"parent":[24527978],"text":["&gt;what would you advise younger people(...your own younger self)<p>Labels are meaningless; attach at your own peril - \nBrands, religions, ideology, all other thought patterns, people - choose local,intrinsic context; what works is all a crapshoot + past generational gifts anyway.<p>Keep learning; there&#x27;s always something new and it never gets old learning new perspectives<p>You can endure much more than you think.<p>Remember all those challenges and struggles you overcame or failed? This one is no different, but you&#x27;re still here.<p>Let go, relax.<p>Pay attention; your life depends on it.<p>Stop living in the past; that person&#x2F;life is different and done or in some other multiverse. Live now with all it&#x27;s joys and sorrows.<p>Outdoors and nature: she always heals<p>Bonus insight: you become more invisible and that has opportunities!"],"time":["2020-09-20 00:18:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["upstill"],"id":[24534765],"kids":{},"parent":[24527978],"text":["As a man gets older, he seems more harmless, even neutered. At 66, I can now have much more substantive conversations with (for example) young women.<p>Advice: some lessons come only with age. People often don&#x27;t learn not to care what other people think (because they&#x27;re not thinking of them at all) until their 30&#x27;s. It was only recently that I really learned that if you don&#x27;t have expectations, you can&#x27;t be disappointed."],"time":["2020-09-20 18:07:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["JohnL4"],"id":[24550119],"kids":{},"parent":[24527978],"text":["(1) Trust your instincts. Really listen to that inner voice.<p>(2) I forget.<p>No wait! I remember! Be really careful who you have kids with (see item (1)). Most mistakes you can walk away from, but when an innocent human life (or two) is involved, you don&#x27;t get to just reset.<p>(3) Bonus free advice (NOW how much would you pay?): Invest for the long term. Consider total return. Don&#x27;t try to time the stock market."],"time":["2020-09-22 03:53:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["GeekyBear"],"id":[24531471],"kids":{},"parent":[24527978],"text":["On romance:<p>It&#x27;s better to find someone who likes what you are than try to become something you&#x27;re not.<p>also<p>Robert A. Heinlein Quote: “It&#x27;s amazing how much &#x27;mature wisdom&#x27; resembles being too tired.”"],"time":["2020-09-20 03:59:45"],"type":["comment"],"deleted":{},"dead":{}},{"by":["surfsvammel"],"id":[24529377],"kids":[24529442,24529404],"parent":[24527978],"text":["Make friends. Keep friends.\nMaking new friends get much harder when you are older."],"time":["2020-09-19 20:13:24"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jrochkind1"],"id":[24531066],"kids":{},"parent":[24527978],"text":["The things you spend time doing will become the things you do: What you&#x27;re good at doing, what you have a habit of doing.<p>So be intentional to spend time doing things you actually want to focus on, or become good at, or have as habits.<p>I suspect this advice, like most advice from the old to the young, is difficult to really understand or follow from the perspective of the young."],"time":["2020-09-20 01:56:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["J_cst"],"id":[24529019],"kids":[24529830,24532062,24529080],"parent":[24527978],"text":["Try to eat well. I had no &#x27;dietary education&#x27; from my family (basically it was an &quot;eat what you like, when you like&quot;) and at 44 I fiscally felt so bad that I went to my doctor saying &quot;I need to be checked as I think I have something really bad&quot;. I went through a number of checks and I was fine. This was also worsened as I am not obese, so I did not connect in a first instance my feeling bad with my eating habits.\nI decided to loose some weight and I put myself on a quite silly diet since few months now. I am eating mon-fri one time every 24 hours. Basically I have a meal a day (a dinner) and any junk food or sweet has been banned. I have lost weight (and I&#x27;m still loosing about 800&#x2F;1000 grams per week) and I feel great now.\nMy second advice is to pick a job which aligns with the things you enjoy doing. This will not necessarily lead to money, but still you will enjoy it. Consider we work the majority of our time."],"time":["2020-09-19 19:23:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Volcacius"],"id":[24534750],"kids":{},"parent":[24527978],"text":["My grandma is turning 107 next month. \nShe is still in perfect shape cognitive wise and in reasonable physical shape for her age.\nWhen you have lived for so long, you have an interesting perspective on things.\nI think what she would probably tell you is that the most important thing in life is to be independent and to be able to adapt to changes. Everything is temporary. Anything you take for granted right now is gonna be gone at some point. Any person that is currently in your life is gonna die at some point. Death is really the only constant, and you have to be okay with that."],"time":["2020-09-20 18:05:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["james-skemp"],"id":[24534441],"kids":[24535660],"parent":[24527978],"text":["Surprised a search for caffeine doesn&#x27;t find anything on the page.<p>Having given up soda around college (and never getting into coffee, and rarely drinking alcohol), almost 20 years later I&#x27;m glad I have the ability to drink just a little bit and get a good short burst of energy.<p>Treat caffeine as you&#x27;d treat aspirin, or bandages, especially when you&#x27;re younger and you really do have an efficient power generator, and ability to do more with less. You&#x27;ll have less of a tolerance you need to beat to get the same effect when you&#x27;re older."],"time":["2020-09-20 17:04:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["caramelsuit"],"id":[24531753],"kids":{},"parent":[24527978],"text":["Can&#x27;t tell you what it&#x27;s like, that would spoil the surprise.\nAdvice: take good care of your teeth and skin. Avoid impacts, broken bones or serious strain injury. Minor injury you receive when young will become more aches and pains as you age. Keep your back strong and straight. Lift with your legs. Wear hats and long sleeved shirts when your going to be in the sun for a long time. Treat your friendships and romances seriously, the embarrassments of your mistakes will be with you for a long time. Fill your memory with as many beautiful things as you can, it makes reminiscing more enjoyable. Don&#x27;t talk so much!"],"time":["2020-09-20 05:48:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cortesoft"],"id":[24530294],"kids":{},"parent":[24527978],"text":["One of the crazy parts about being older is how time feels different. 10 years ago seems like yesterday, but when I was young that seemed like forever. It doesn&#x27;t seem like the world changed much until you actually think about the details."],"time":["2020-09-19 23:02:45"],"type":["comment"],"deleted":{},"dead":{}},{"by":["AndrewOMartin"],"id":[24530460],"kids":{},"parent":[24527978],"text":["Echoing some of the advice in this thread, Christopher Hitchens said (possibly quoting someone else) something along the lines of &quot;It becomes increasingly obvious that you can&#x27;t make new old friends&quot;."],"time":["2020-09-19 23:33:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ytNumbers"],"id":[24530283],"kids":[24536541],"parent":[24527978],"text":["Avoid becoming addicted to anything (e.g., don&#x27;t consume unhealthy illicit substances). Get enough sleep, sunlight, and exercise. Also, make sure you adopt a healthy diet where you remember to also consume things that will improve your gut bacteria so that your body thoroughly absorbs all those healthy nutrients. Of course, if you don&#x27;t care how long you live, you can ignore all of the above advice. Some people say they don&#x27;t want to live forever, but I&#x27;ve yet to encounter anyone who was happy to exit this world like a satisfied diner at a restaurant."],"time":["2020-09-19 23:00:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24539746],"kids":{},"parent":[24527978],"text":{},"time":["2020-09-21 06:16:58"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["sjg007"],"id":[24530524],"kids":{},"parent":[24527978],"text":["Fund your retirement.<p>Don&#x27;t waste time with romantic partners who don&#x27;t love and respect you.<p>Don&#x27;t waste time with people who don&#x27;t have your best interests at heart.<p>Get as much education as you can handle and ask for help along the way."],"time":["2020-09-19 23:47:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tomcam"],"id":[24530802],"kids":[24536941,24531169],"parent":[24527978],"text":["I&#x27;m about 60. My early life left me with no confidence that I would make it this far, so by the time I was 21 I was getting ready to die.<p>What it&#x27;s been like to grow old<p>* My body&#x27;s in officially lousy shape, but I don&#x27;t feel much worse than I did at 21. Sure, arthritis makes music harder, and being fat makes it hard to tie my shoes. For some reason, though I know I should feel worse, I don&#x27;t really.<p>* When you literally wake up glad to be alive every day, and I have done so for half a century, minor things like your body betraying you or someone else&#x27;s political leanings take on much less importance.<p>* I am never, ever bored. There are so many things I want to learn, so many products I want to create. I have never known a programming language so well that it bored me, because I always used them as vehicles to get something interesting done. They are tools to me. Like any craftsperson, good tools are important but they are always subservient to the product.<p>* I have been fighting a losing battle with weight for 50+ years. It&#x27;s terrible. I am ashamed that I&#x27;m morbidly obese and dependent on diabetes and high blood pressure pills. Every time I go out I&#x27;m embarrassed to be fat. Every thin person I see is a rebuke, unless they&#x27;re smoking. (To me smokers are honorary fat people.)  Don&#x27;t fucking tell me to eat right and exercise right and sleep right. I fucking know it. It&#x27;s just hard and I never stop trying.<p>* I have been a horrible insomniac for 55 years. I figured by now there would be a cure for it. A good night of sleep for me is 3 1&#x2F;2 hours. A bad night of sleep is 20 minutes. 3 1&#x2F;2 hours is not enough for me to feel good for most of the day but it&#x27;s enough to get essential work done.<p>* After a traumatic brain injury when young, my memory went bad. Consequently I have always been a slow learner. I have probably suffered some cognitive slowdowns but I don&#x27;t notice them at my age. Learning is hard for me now, but it was hard for me at 21. I just have to work harder than anyone else. Fine with me! I chose work I enjoy.<p>* I still have absolutely no problem pulling all-nighters when the project interests me.<p>Things I saw that other people didn&#x27;t seem to see as much<p>* By the time I was 14 I had observed that SV-type jobs were cyclical. Even though I wasn&#x27;t tech-oriented then I realized if I ever got into a tech field I&#x27;d have to keep up in order to remain relevant. Decades and many millions of dollars later, I still keep up. I have worked for myself for the last 21 years but I still act as if I may need to get a job at Google tomorrow. I still study every night (in my case, Go, py4web, and database infrastructure).<p>* Whenever I got a job, I assumed things might get bad so I always stayed within bicycling distance in case there was a gas shortage or something.<p>* I saw that two-income families often contained two people who came home with a need to share their stress, but also take care of the kids. This results in neither one wanting to listen to the other, and the resulting tension harms family life. So I made a deal with my wife that one of us work, and one stay home. Didn&#x27;t care which one (turned out that I was the worker, and we both like it that way). Also I married someone who understood that sometimes I have to work hard. We planned to be poorer than our friends, but the opposite happened. I was able to get ahead by studying at night and trying out different ideas.<p>* From a very early age I saw that some people got hit hard by &quot;unexpected&quot; events like high medical expenses or business failures. I knew I would either have to safe very carefully (like Asians, who make up most of my family) or be a good earner. I ended up being a good earner who doesn&#x27;t save as carefully as he could. Result: I spent $40K&#x2F;year on insurance premiums and can easily absorb it. I own several houses outright and have no debt.<p>* I never had a &quot;special&quot; way of treating women I dated. There was never a me-who-buys-flowers vs. a me-who-ignores-her-once-we-get-married. I always dated women I liked to be with during daily activities, like shopping or doing the laundry. I just never take the people close to me for granted. Of course I buy flowers for my wife after being married 30 years, and it&#x27;s always because they look like good flowers, not because it&#x27;s a day merchants tell me to buy them.<p>* I read history. I understand how long empires last. I love America and its values, but I fear the mob. So I own lots of guns and have always lived in places that felt defensible.<p>* You know those old movies and stories where the person is given a second chance on life and appreciates people around in a new light? I have always been that way. My wife, not so much. So we see our children differently. To me they are enormous treasures and (not recommending this, it&#x27;s just me) even though they&#x27;re all adults I live in abject fear that something bad happens to them.<p>What would I advise younger people to do? Well, my most successful idea, I think, was to figure out by 25 what my core values were, because everything comes out of that. In my particular case, it went:<p>* No one cares about your job more than you do. For me this led to the understanding that I should start my own business. You don&#x27;t have to and, more important, may not want to! But I feel it&#x27;s less risky than working for someone else. If you don&#x27;t do that at least save up for a rainy year (below)<p>* Be a decent citizen<p>* Treat people different from me with respect<p>* Try to admit when I&#x27;m wrong<p>* Treat my kids with at least as much respect as I would treat Bill Gates or a cop or a waiter, and be as polite to them as I would be to anyone else<p>* Do work that wouldn&#x27;t embarrass my kids if they told their friends about it<p>* Being rich is good because it helps with independence and safety buffers, but it&#x27;s always subordinate to taking care of the people I love<p>* Expect people to be motivated by their base instincts, and by incentives. People are neither natively good or bad, so be ready for them to be bad. That means understanding your core values and sticking to them<p>* Take logical risks you can afford and be ready to learn from them<p>* Feel free to cut harmful family members out of your life. I will guess that I went through more than my share of bad stuff when young. This left me with a very simple rule. Family is important, but it&#x27;s also what others make of it. I would give family members who harmed me an explanation of why I felt bad, then ghost them if nothing changed. Nothing ever changed. Do I feel bad after they died? Do I feel like I should have connected better with the people who raped or beat or neglected or abused me or accused me of horrible things I didn&#x27;t do? Absolutely not. I have never regretted removing harmful people from my life, family or not<p>* When you&#x27;re evaluating doing something big, the more you like it, the more you should try to talk yourself out of it. You should be super honest about both the potential upsides and the potential downsides. Project what would happen to you a year after the worst or the best happened<p>* Expect bad things to happen. Easy for me to say now? Sure, but I was totally ready for Covid by the year 2000. Completely. So were observant Mormons and many Chinese people<p>* Avoid debt<p>* Have at least a year&#x27;s living expenses saved in case of unemployment, unrest, etc.<p>Obviously YMMV, but because I wanted nothing more than to escape from my childhood home&#x2F;school life, by 13 I had read autobiographies of famous achievers and had crystalized these values based on their successes and mistakes. I developed as a way of escaping the present. It was either that or kill myself. I&#x27;m very glad I didn&#x27;t kill myself but I needed some logical reason to have hope."],"time":["2020-09-20 00:46:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rcar1046"],"id":[24529311],"kids":[24531315,24529391,24533896],"parent":[24527978],"text":["Be in service to someone or something without expecting anything in return.<p>For me it is my dog."],"time":["2020-09-19 20:05:35"],"type":["comment"],"deleted":{},"dead":{}},{"by":["simonblack"],"id":[24531022],"kids":{},"parent":[24527978],"text":["You still feel the same as when you are in your twenties. In fact in answer to the the question &quot;How old do you feel?&quot; I always feel like I&#x27;m about 22.<p>However ..... for some reason you can&#x27;t do as much. Some jobs that you could do all day once upon a time now leave you exhausted after an hour or so. Those hills seem steeper than they look. That package is heavier than you thought it was. I suppose I&#x27;m trying to say that your body hasn&#x27;t maintained the same youthfulness as your head has."],"time":["2020-09-20 01:42:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["xyzal"],"id":[24540388],"kids":{},"parent":[24527978],"text":["I hope this does not come across as too sentimental.<p>I am 38 years old, and I can see my parents getting more frail every day.<p>Talk to them while you can. I could not shake off the teenager-like attitude of being too busy to spend quality time with them for far too long and now I regret it."],"time":["2020-09-21 08:19:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["EvanAnderson"],"id":[24532078],"kids":{},"parent":[24527978],"text":["Don&#x27;t put off experiences. Thinking &quot;I&#x27;ll do that later&quot; when you have an opportunity now is a recipe for never having that experience.<p>I&#x27;m 43 and I recently had a reasonably bad bike wreck. The recovery time for cuts and bruises really surprised me, compared with inline skating injuries in my 20s. I can definitely tell the body isn&#x27;t working as well as it did."],"time":["2020-09-20 07:26:45"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sys_64738"],"id":[24529503],"kids":[24533904],"parent":[24527978],"text":["Don&#x27;t listen to other people."],"time":["2020-09-19 20:32:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dudekula"],"id":[24539044],"kids":{},"parent":[24527978],"text":["As I got older, the list of important things&#x2F;questions that matter to me got smaller and smaller, finally left with only one question, &quot;how do we really explain a mind?&quot; afraid that I may not have an answer in my lifetime!"],"time":["2020-09-21 03:56:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["euroderf"],"id":[24533135],"kids":{},"parent":[24527978],"text":["63yo here. As you get older, a lot of things get easier. For example public speaking. It&#x27;s terrifying when you&#x27;re young. But at this point I consider myself well-read enough that I could talk to any group of people about any topic for ten minutes without breaking a sweat (or being paralyzed by fear and indecision)."],"time":["2020-09-20 12:31:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["alea_iacta_est"],"id":[24549846],"kids":{},"parent":[24527978],"text":["My only advice, don&#x27;t listen to advices, nobody has figured out this weird thing we call life."],"time":["2020-09-22 02:48:05"],"type":["comment"],"deleted":{},"dead":{}},{"by":["technological"],"id":[24537035],"kids":{},"parent":[24527978],"text":["One thing I say is have zero expectations of anything and everything then your life will be great.<p>When i stopped having expectations then I did not add any complains when someone i loved did not behave&#x2F;respond the way I like it and was happy."],"time":["2020-09-20 22:16:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["was8309"],"id":[24529772],"kids":[24575157],"parent":[24527978],"text":["keep a journal in plain text"],"time":["2020-09-19 21:16:53"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24531741],"kids":{},"parent":[24527978],"text":{},"time":["2020-09-20 05:44:30"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["NaOH"],"id":[24531323],"kids":{},"parent":[24527978],"text":["What stands out to me as I’ve aged are the people I’ve known, the memories of experiences with them, and the times I’ve given and received the kinds of help which benefit lives. None of these things compel me to words of reminiscence, but remembering them brings feelings of grace and gratitude."],"time":["2020-09-20 03:12:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["aidenn0"],"id":[24534601],"kids":{},"parent":[24527978],"text":["Optimistic failures are so common, that I assume every idea&#x2F;business&#x2F;etc. will fail, and I&#x27;m right most of the time.<p>That doesn&#x27;t mean <i>you<\/i> will fail, but it means I&#x27;m not going to be particularly excited."],"time":["2020-09-20 17:38:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gpsx"],"id":[24531959],"kids":{},"parent":[24527978],"text":["I don&#x27;t feel nearly as smart or &quot;outstanding&quot; as I did when I was younger. But I don&#x27;t think it is because I have gotten much less smart or outstanding. I think my perception has become more accurate."],"time":["2020-09-20 06:46:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["unstatusthequo"],"id":[24531605],"kids":[24532117],"parent":[24527978],"text":["Wear a mask. Most of the “young” I see don’t seem to care, think it won’t affect them, or are fine getting the ‘Rona because they are confident they will weather it.  Help other young people learn that it’s not all about them."],"time":["2020-09-20 04:45:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gaahrdner"],"id":[24532366],"kids":{},"parent":[24527978],"text":["Your question seems to be mostly concerned about the human body, so you probably know the answer; eat healthily most of the time, exercise regularly, make sure you regularly get good sleep.<p>Oh, and wear sunscreen."],"time":["2020-09-20 08:56:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["DanBC"],"id":[24533857],"kids":{},"parent":[24527978],"text":["1) Start your pension planning as early as possible.<p>2) Maintain friendships outside your main relationship.<p>3) Spend time with your children.<p>4) Look after your physical and mental health. Eat good food. Get exercise."],"time":["2020-09-20 15:20:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pmoriarty"],"id":[24529842],"kids":{},"parent":[24527978],"text":["Seek out mentors, make connections and keep them.  These are often more valuable than technical skills.  Of course, making such connections and acquiring mentors is a lot easier if you&#x27;re effective at what you do or distinguish yourself in some way, so skills and accomplishments are also very important.<p>Seek out experts in the fields you&#x27;re interested and start a correspondence with them and meet them if possible.  Ask their advice about things that interest you and that they are experts in.<p>Many times in your life you will be faced with a choice between the hard road and the easy road.  Most people take the easy road to mediocrity.  You can further distinguish yourself, learn a lot more, gain more skills, and grow tougher by choosing the hard road.<p>Learn something thoroughly.  If you are an expert at something you will be in demand.  Generalists and jacks-of-all-trades get a nice, broad perspective and can make connections between fields that narrow specialists can&#x27;t, but usually it&#x27;s more feasible for specialists to broaden their horizons than for a generalist to become a real expert, especially later in life.<p>Be persistent.  If you can master the skill of doing that which will improve your life and the lives of others no matter how unpleasant or boring that task is, especially over the long haul, then you will accomplish much more than most, who tend to easily give up and move on to something else.<p>Related to this, whenever you start something that will take a long time to finish, expect that there will be boring, frustrating periods where everything will seem hopeless.  Plan well ahead of time what you&#x27;ll do to overcome them when you&#x27;ll encounter them.  This is a place where your mentors and experts in the field can help, as you can ask them for advice when you run in to a roadblock.<p>Surround yourself with people who bring you up, not try to drag you down to their level or who are completely unmotivated.  Always try to be around people who are smarter than you, who are better than you at something you&#x27;re interested in, and who you can learn from and be inspired by.<p>Don&#x27;t study for the test, but value knowledge for its own sake, to learn useful skills, and to improve yourself.  This connects to the next crucial point:<p>Read A LOT.  You can gain many lifetimes of experience through books.  Real books, not blog post and tweets.  It would not hurt to start by reading through &quot;the classics&quot;, but often lists of classics overlook much excellent foreign literature, so try to seek out the best of what different cultures have to offer.<p>Travel (when the plague is over).  Few things can open your mind to what is possible, let you meet fantastically interesting people, have unforgettable experiences, learn about other cultures and ways of being, and open up new opportunities for you than travel.<p>On the subject of travel, I would advise you to go off the beaten path and avoid super touristy areas.  Stay in hostels.. it&#x27;s a fantastic way to meet people and can save you a ton of money too.  Don&#x27;t try to see too much at once, and try to stay in one place for a good week or two, if you can, instead of doing 7 countries in a weekend.<p>Once you&#x27;ve traveled a while and got a taste of many different countries you&#x27;re bound to find a favorite.  Try living there for a year or two.  You&#x27;ll get a perspective on the place that a quick visit will not give you, and let you use it as a base for exploring other places in the area, and you&#x27;ll gain even more valuable connections there that you couldn&#x27;t as a mere tourist.<p>Learn some foreign languages.  This is yet another way to make great connections and get to appreciate other places and cultures at a level you couldn&#x27;t if you were just monolingual.  It&#x27;ll also open you up to the literature of other countries on a level you just can&#x27;t get by reading it in translation.  Many books don&#x27;t even have translations, so you&#x27;ll be at an advantage there too.<p>Learn to like yourself, enjoy your own company, and be your own best friend.  Always seek out new subjects to learn and new teachers to learn from.  A great teacher can make anything interesting.<p>Exercise and take thorough stock of what you&#x27;re eating to make sure you don&#x27;t have any nutritional imbalances.  This can greatly affect your mood and energy levels, and ultimately let you live a lot longer and with many fewer debilitating conditions than you&#x27;d have otherwise.  A sure way to physical misery is to not take care of your body.<p>Finally, try to help people and be as useful to them as possible.  Apart from this being the right thing to do, it&#x27;s also a lot more fulfilling than being purely selfish, and people are usually glad to be of help to someone who&#x27;s helped them.  So by helping others you&#x27;ll be helping yourself."],"time":["2020-09-19 21:28:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["guerrilla"],"id":[24530196],"kids":{},"parent":[24527978],"text":["Have you seen &quot;Being 97&quot;? [1]<p>[1]. <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qX6NztnPU-4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qX6NztnPU-4<\/a>"],"time":["2020-09-19 22:41:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tubularhells"],"id":[24529097],"kids":{},"parent":[24527978],"text":["Older people THINK they can remember what it was like to be young."],"time":["2020-09-19 19:32:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bitxbit"],"id":[24537546],"kids":{},"parent":[24527978],"text":["Taking an hour-long walk during lunch is the best thing I ever did for my health and work productivity."],"time":["2020-09-20 23:24:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24530713],"kids":{},"parent":[24527978],"text":{},"time":["2020-09-20 00:23:12"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["intricatedetail"],"id":[24532832],"kids":{},"parent":[24527978],"text":["Remove all negative people from your life. I wish I had done this from school time onwards..."],"time":["2020-09-20 11:08:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["phil21"],"id":[24530039],"kids":{},"parent":[24527978],"text":["Man, I&#x27;m not even that old yet - but feel old, I guess.  Pushing 40.<p>At this point of my life, I can definitely say my outlook will change in 20 years.  20 years ago I would have thought my belief systems to be set in stone more or less.  If this is true, you will miss a whole lot of personal growth.  It may depend on the person but I&#x27;ve certainly developed a whole lot more empathy and benefit of the doubt for people I would not have had in the past.  I&#x27;ve also learned the world is a whole lot harsher and nicer than many would report, and humanity&#x2F;society is a very complex thing.  99.9% of the world wants to hug you, not hit you, is something I always try to keep in mind.<p>A lot of this is based on what you expose yourself to though, so I&#x27;ve noted it&#x27;s pretty easy to &quot;grow&quot; in the opposite direction if you never get out of your &quot;early 20&#x27;s&quot; bubble of high school friends, or if you get &quot;stuck&quot; in a such a rut early on in life too scared to make the next step.<p>The largest lesson I think I&#x27;ve learned is that almost all my regrets have to do with inaction vs. action regardless of outcome.  I highly regret many things I was too lazy&#x2F;scared&#x2F;talked out of doing, but even the things that turned out (at the moment) absolutely horrible that I actively participated in with my best effort I do not regret now in the least.  At the worst some were learning experiences, most turned into (via completely unexpected ways) amazing experiences and opportunities.  Note that this can mean almost anything - relationships, work, life experiences, travel, etc.<p>I guess all I can really give as 100% &quot;for sure&quot; advice is I have never regretted anything I&#x27;ve truly given 100% of my effort into.  I&#x27;ve only regretted the moments where I&#x27;ve half-assed something.  And this is regardless of outcomes.  If I can go to my grave saying I did my best and tried to make my tiny corner of the world better - I&#x27;ll be quite happy.<p>That and the mundane daily positive personal habits you can get into the earlier the better.  You make yourself a far more attractive partner if you take basic care of yourself like doctor and dentist visits, basic daily hygiene, and at least making an attempt at eating healthy&#x2F;being active.  Others have covered this far more than I have, but I certainly endorse their advice.  I simply wanted to point out it goes beyond your own personal health - your health is important to others in your life and for me at least it was easy to forget that for some time.<p>Also something I haven&#x27;t seen said a lot here - surrounding yourself early with positive friends who share your values&#x2F;aspirations in life is exceedingly important.  I firmly believe in the &quot;you are the average of your 5 best friends&quot; theory."],"time":["2020-09-19 22:09:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sjg007"],"id":[24531539],"kids":{},"parent":[24527978],"text":["Vote."],"time":["2020-09-20 04:20:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tompark"],"id":[24530590],"kids":{},"parent":[24527978],"text":["I had this same question after being surprised when I needed reading glasses and when single strands of mutant hair sprouted from various places (eyebrows, neck, etc). My parents passed when I was a young adult so I didn&#x27;t have many older people around to ask about these kinds of topics.<p>You focused specifically on physical health. Others have given good advice (teeth, hearing, etc). I&#x27;d add several other points:<p>-- At around 50, your chances of getting cancer hit an inflection point on the &quot;hockey stick&quot; growth curve [1], so you need to get regular (annual) screenings. A good health plan is helpful; when I was on Kaiser HMO they were really good about following up on this.\n[1] <a href=\"https:&#x2F;&#x2F;www.cancerresearchuk.org&#x2F;health-professional&#x2F;cancer-statistics&#x2F;incidence&#x2F;age\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cancerresearchuk.org&#x2F;health-professional&#x2F;cancer-...<\/a><p>-- Exercise doesn&#x27;t have to be intensive to work well. I rarely go to a gym now; when I was younger, the overhead of going to the gym made me think I had to workout for an hour or more, but in my case it backfired, bc it led to a gut reaction of &quot;ugh&quot; whenever I thought of the gym. I&#x27;m pretty committed to hiking, so now I walk outdoors (mineral sunscreen, of course) for an hour per day and that&#x27;s enough. If you can choose to live somewhere where you can do this year-round then do it. That alone is transformative. When I first started hiking, my knees would hurt, especially going downhill, but after a few painful hikes, it eased up and now many years later my knees never bother me.<p>-- Highly-suggested weight training books (e.g. Starting Strength) insist on free weights, barbells. I find that 30 min of body weight circuits (and dumbbells) 3x&#x2F;wk is plenty. Just get into the habit. The benefits accrue over time, whereas you&#x27;ll see peers your age or younger neglect this and that neglect also accrues over time. Most people don&#x27;t add 25 lbs of belly fat in one year, it&#x27;s more like 2-5 lbs per year over decades.<p>-- Most my friends are younger than me and alcohol is still a big part of socializing, but as I get older I dislike the effects more. Not that I drank much in the first place, but now I&#x27;ve cut back even more. On average not even once per month, and never more than 2 drinks per occasion.<p>-- Diet is obviously important. Michael Pollan&#x27;s advice: &quot;Eat food. Not too much. Mostly plants.&quot; I still eat too much meat but include greens in every meal. My advice is to cook. As I got older I started cooking at home more. Over the course of a decade I eventually worked up to cooking every meal at home. It helps to establish the habit if you have someone (spouse, family) to cook for, but now I have the habit, it&#x27;s easy to cook for myself. When you cook, you can eliminate added sugar. All processed food has sugar in it, so I cook everything from scratch. It sounds like a pain, and when I was younger I would never have imagined myself doing it, but when you practice it, you can do it quickly. I eliminated sugar on weekdays. If you follow David Sinclair&#x27;s longevity advice, you&#x27;d cut out sugar entirely, but I still partake on weekends.<p>-- So far I&#x27;ve been super lucky and have no major health issues&#x2F;struggles. I&#x27;m &quot;old&quot;, but not elderly. I still do long distance treks. People I meet are always surprised at my age and energy level. The biggest tell is white hair, or dry scraggly hair. I used to think I&#x27;d be interested to hear health issues from people in the 70-90 age range, but I suspect it&#x27;s so different for everyone that it wouldn&#x27;t be that useful. I believe there&#x27;s enough longevity advice out there that if you pay attention to the right sources then you can see what&#x27;s coming up and what you should be doing."],"time":["2020-09-20 00:00:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tluyben2"],"id":[24532804],"kids":{},"parent":[24527978],"text":["Not too old yet, 45. But learned many things already because I did a lot of things. Hope to learn a lot more; let’s do this again in 10 years here. Anyway;<p>If you have enough money, stop trying to get more and live your life instead with your family and friends. Apparently it is really hard for people who gathered a few 100k&#x2F;million (depending where you live) to just let it be and enjoy. Moreso (as I understand) in the US than in the EU. In the EU you hardly need money to begin with depending where you live and want to live; Where I live, all my neighbours live of around 500&#x2F;mo. As a wfh software dev, 500 is literally a few hours work. And that would be me alone working from home; my wife does too... The always trying to get more and buy crap turns out, when you get older (and friends&#x2F;family starting to die off&#x2F;get ill) you understand it really does not matter at all. But then it might already be too late to correct it, even with all your cash. It is hilarious to me to read all these ‘time managed’, mostly Americans on here; every second of their day as efficiently managed as they can. And for what? Go outside, walk in a forest, talk to strangers; Running the same time managed wheel every day; that I find the real waste of time trapped in your own rat cage. I needed to grow older for this though to realise some of it; I never did the timemanagement thing (as I always believed it is sheer insanity; but I guess that is a matter of what you think counts as valuable; I enjoy walking in nature, I do not enjoy spending time in the gym efficiently and eating soylent  to save a few hours in my day; those hours are valuably spent on thinking in the forest, chatting with friends in the sun on the square etc; then I use 4-5 hours to write code, which I already worked out in my head while walking; for backend and firmware coding, that is far more efficient than just ramming in as many chars as you can and then trying to run it; also something I learned as I got older; I am much faster in delivering than my young colleagues; not because I am smarter but experience and thinking shit through before just hammering it in and letting unittests tell it is wrong; I find that an actual utter waste of time) however I did miss important events I should not have missed because I was working for a few extra bucks. Events that will never  repeat.<p>Ofcourse we are lucky to be able to work from home and people who do not want to move to a different&#x2F;cheaper place obviously have less choices, but also that gets easier when getting older, at least in my experience. The city becomes less interesting; freedom and space more. With covid we saw here that indeed people are not <i>that<\/i> married to their cities and their cramped appartments: lot of houses sold that were empty for years; now suddenly they have almost no cost of living (even going to a restaurant for a complete meal and drinks costs 6 euros pp if you fancy that) and space to breath. So the money earned in the ratrace suddenly might get you well into retirement and then there are state pensions and hospitals are free anyway. Especially if you have a house or mortgage in the city, you can sell it and that’ll keep you good for 20-40 years if you don’t buy rubbish. Or you can rent it out and you are good basically forever. Not that I like that personally but I know many who did exactly that so they could retire at &lt;40.<p>Physically; do fasting and weights; really helps energy levels and pushes back on loss of muscle mass which will happen when you get older. I notice that people who focus less on their wasteline and more on bulk make it far longer in a far more robust way. Skinny muscleless ex runners&#x2F;cardios don’t do so well when going 80. Obviously do not get too fat, do not smoke&#x2F;vape(although, ofcourse my entire village smokes 3-4 packs&#x2F;day and the elderly are in their 80s&#x2F;90s puffing away while sitting in the full sun for hours without sunscreen, but that is just, I guess, survivors bias), take care of your teeth and when you feel something weird anywhere, go to the doctor. People wait way too long, especially men.<p>Edit; a more depressing thing of getting older, for me, was seeing how incompetent, lazy and untrustworthy people are. We tolerate blatant lies from\nceo’s, cto’s and our colleagues almost every day. From small ones (I will work this weekend for this one time and then ‘my computer was broken but miraculously works again on monday’) to potentially company breaking lies by sales from vendors ‘yes this feature is done and delivered’; 2 weeks before beta; ‘oh did he say it was? no that is done somewhere in 2021 but we do not know when yet). I see it everywhere now; it was always there but it starts to really annoy me now."],"time":["2020-09-20 10:59:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["aaron695"],"id":[24530917],"kids":[24532127],"parent":[24527978],"text":["You will become a Conservative.<p>I have no idea what that means other than you&#x27;d probably hate your future self so give people around you a break for their values you disagree with."],"time":["2020-09-20 01:15:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["synchrone"],"id":[24525914],"kids":[24528697,24526394],"parent":[24514548],"text":["I searched all over the web for a reliable and scalable plain message queue that could work in a full disk-backed mode, not requiring the data to fit in memory.<p>Was very impressed with how little RAM and CPU it consumed under load."],"time":["2020-09-19 09:52:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jitl"],"id":[24525745],"kids":[24527624,24526239],"parent":[24514548],"text":["What is this used for? Is this kinda sorta like a Kafka? Do you implement message bus with this? Queue task workers? Change data capture stuff like secondary indexes or materialized views?<p>As an outsider without deep experience in this space, I struggle to evaluate this kind of software. When would I want this VS things-that-look-like-it? What about hosted offerings like SQS? (Maybe I should read a book)"],"time":["2020-09-19 09:05:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["02020202"],"id":[24527862],"kids":{},"parent":[24514548],"text":["i prefer kvdb-backed grpc for messaging to these pubsub projects because there is always some caveat. either it has at-least-once delivery or at-most-once delivery and other times it will disconnect clients if they are too slow or producers are too fast. there is always something. so tailor-made solution works out the best for me. easy and fast to write. works as one wants it to work. and with go, it&#x27;s a piece of cake and also part of single binary, no external dependencies."],"time":["2020-09-19 17:03:08"],"type":["comment"],"deleted":{},"dead":{}},{"by":["est"],"id":[24527869],"kids":{},"parent":[24514548],"text":["nsq is a solid piece of technology. 20k conections on a single nsqd, no complaints."],"time":["2020-09-19 17:04:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Datenstrom"],"id":[24528468],"kids":{},"parent":[24528072],"text":["These are pretty good results, but not SOTA currently EfficientNet-B7 outperforms this on ImageNet-1000. ImageNet in particular is around 84% top-1 and 97% top-5. Claiming the last few percentages can be much harder than the first so it would be interesting to see this integrated into other approaches still.<p>For comparison to other methods see, ImageNet Classification Leaderboards[1], Object Detection on COCO test-dev[2], Semantic Segmentation on COCO 2017[3]. Unfortunately COCO 2017 does not have many entries, I&#x27;m not aware of a better summary of SOTA methods.<p>[1]: <a href=\"https:&#x2F;&#x2F;kobiso.github.io&#x2F;Computer-Vision-Leaderboard&#x2F;imagenet\" rel=\"nofollow\">https:&#x2F;&#x2F;kobiso.github.io&#x2F;Computer-Vision-Leaderboard&#x2F;imagene...<\/a><p>[2]: <a href=\"https:&#x2F;&#x2F;paperswithcode.com&#x2F;sota&#x2F;object-detection-on-coco\" rel=\"nofollow\">https:&#x2F;&#x2F;paperswithcode.com&#x2F;sota&#x2F;object-detection-on-coco<\/a><p>[3]: <a href=\"https:&#x2F;&#x2F;paperswithcode.com&#x2F;sota&#x2F;semantic-segmentation-on-coco-2017\" rel=\"nofollow\">https:&#x2F;&#x2F;paperswithcode.com&#x2F;sota&#x2F;semantic-segmentation-on-coc...<\/a>"],"time":["2020-09-19 18:16:08"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cs702"],"id":[24529894],"kids":{},"parent":[24528072],"text":["The headline is too linkbaity for my taste. The idea is simple: Apply a mixture of multiple affine transformations, e.g., weighted by Softmax attention, instead of just a single affine transformation, to renormalize the data. The use of attention likely increases running time both in training and testing. See also Datenstrom&#x27;s comment: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24528468\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24528468<\/a>"],"time":["2020-09-19 21:39:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24528320],"kids":[24529839],"parent":[24528072],"text":["“For example, top-1 accuracy in the ImageNet-1000 improved by between 0.5% and 2.7%. And Average Precision (AP) accuracy increased by up to 1.8% for bounding box and 2.2% for semantic mask in MS-COCO.“<p>Just how significant are these results?"],"time":["2020-09-19 17:57:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["carapace"],"id":[24528054],"kids":[24528502,24528287,24528520],"parent":[24527392],"text":["&gt; The man who committed the act was said to be &lt;OMITTED&gt;, and the ancients attempted to wipe his name away from history.<p>Right, so maybe stop spreading it around?  I mean, it&#x27;s the only way to defeat him."],"time":["2020-09-19 17:28:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Animats"],"id":[24529572],"kids":{},"parent":[24527392],"text":["It was rebuilt, though. The final destruction was by evangelical Christians around 407 AD. They couldn&#x27;t tolerate competition.[1][2]<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Persecution_of_pagans_in_the_late_Roman_Empire\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Persecution_of_pagans_in_the_l...<\/a><p>[2] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Temple_of_Artemis#Final_destruction\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Temple_of_Artemis#Final_destru...<\/a>"],"time":["2020-09-19 20:42:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tresCommatoso"],"id":[24530004],"kids":{},"parent":[24527392],"text":["Nothing lasts forever, but that which is alive, and propagates from generation to generation."],"time":["2020-09-19 22:02:44"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["allan_golds"],"id":[24528003],"kids":{},"parent":[24527392],"text":["Paywall"],"time":["2020-09-19 17:21:55"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["MichaelZuo"],"id":[24528387],"kids":[24528411,24528772,24528484,24528545],"parent":[24527392],"text":["Paywalled article. Is there another source?"],"time":["2020-09-19 18:05:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rdtwo"],"id":[24524883],"kids":[24532115],"parent":[24523901],"text":["I guess I appreciate the transparency. There have historically been accusations of domain name squatting by godaddy so weather true or not I think they did the right thing trying to present a case that they aren’t a bad actor. The posts definitely did some additional damage to their brand and I think it’s good for them to address the accusations, especially when the thread got dogpiled by their competitors."],"time":["2020-09-19 05:56:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["wdr1"],"id":[24529761],"kids":[24530480],"parent":[24523901],"text":["I wonder if GoDaddy is unwittingly helping others exploit when someone is searching for domains.<p>E.g., if there&#x27;s ML in their suggestions, and they look at cohorts, when I search for D after A, B, C, they&#x27;ll start to suggest D to others looking for A, B, C.<p>Then all I have to do is watch A, B or C for changes, and when I see D, I know it&#x27;s become <i>someone<\/i> is interested."],"time":["2020-09-19 21:15:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["crazygringo"],"id":[24524852],"kids":[24529524,24529547,24528210,24529993,24528660,24530632,24525439,24533806,24530764],"parent":[24523901],"text":["The fact that a completely unsubstantiated accusation [1] from a throwaway HN account got an astounding <i>1,615<\/i> upvotes yesterday...<p>...really saddens me.<p>Like they say, &quot;a lie gets halfway around the world before the truth puts on it boots.&quot;<p>I really wish people had higher standards for actual evidence before jumping to conclusions.<p>Now let&#x27;s see if <i>this<\/i> post gets a similar 1,000+ upvotes, as fairness would dictate. Something tells me it won&#x27;t, but I&#x27;d love to be proven wrong. I&#x27;d be shocked if it even makes it to 50.<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24506303\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24506303<\/a>"],"time":["2020-09-19 05:52:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["londons_explore"],"id":[24524891],"kids":[24526101,24525998],"parent":[24523901],"text":["How many &quot;fraudulent&quot; registrations and cancellations does GoDaddy do each day?<p>Could it be that it isn&#x27;t GoDaddy being malicious, but perhaps a third party?  It&#x27;s pretty easy to get a feed of queries into the GoDaddy search box - all you&#x27;d need to do is partner with any registrar."],"time":["2020-09-19 05:58:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hasperdi"],"id":[24532104],"kids":{},"parent":[24523901],"text":["Just avoid GoDaddy if you can. They treat customers like shit anyway. Trying to upswell you stuff all the time. It’s the kind of company that you can’t rely to behave and act in your interest as a customer."],"time":["2020-09-20 07:36:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["andrewmcwatters"],"id":[24531248],"kids":[24533050],"parent":[24523901],"text":["Who cares. Why would anyone use GoDaddy after the December 2011 boycott?"],"time":["2020-09-20 02:49:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cipherzero"],"id":[24524412],"kids":[24524742],"parent":[24523901],"text":["GoDaddy’s response to the earlier accusations from the throwaway account here: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24506303\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24506303<\/a>"],"time":["2020-09-19 04:37:24"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24529581],"kids":{},"parent":[24523901],"text":{},"time":["2020-09-19 20:43:20"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["zatel"],"id":[24530533],"kids":{},"parent":[24523901],"text":["Thank you for reminding me to buy [my name].com back since it&#x27;s lapsed"],"time":["2020-09-19 23:49:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24526281],"kids":{},"parent":[24523901],"text":{},"time":["2020-09-19 11:40:08"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["toyg"],"id":[24526133],"kids":[24529709],"parent":[24523901],"text":["This is all extremely convenient. It’s not just “it wasn’t me” but even “it wasn’t me, somebody was hacked, the domain will become available again tomorrow”. Methinks the lady doth protest too much, this might well be godaddy’s SOP when caught red-handed.<p>Be as it may, the fact that GD is so casual about pwned accounts being an everyday occurrence should suggest people that it’s better to stay away from their lumbering carcass of a service."],"time":["2020-09-19 10:53:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["svntid"],"id":[24526504],"kids":{},"parent":[24523901],"text":["We developed software for a competitor of them and they did 100% the same thing. The domains were of course not bought by the company directly but a third-party guy."],"time":["2020-09-19 12:43:31"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["barry27"],"id":[24526421],"kids":{},"parent":[24523901],"text":["i searched godaddy several years ago for a domain name which i thought was reasonably good. it turns out it had _just_ been registered but i could offer to buy it. bummer for me that, uh, somebody was hacked at that exact time and the hacker decided to register that name mere milliseconds before me.<p>i have often thought about how unlucky i was that day, usually while i am registering domain names using other companies."],"time":["2020-09-19 12:23:56"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["aaron695"],"id":[24525734],"kids":[24526762],"parent":[24523901],"text":["Gell-Mann Amnesia effect<p>This is every HN post."],"time":["2020-09-19 09:03:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gigmana"],"id":[24533827],"kids":{},"parent":[24523901],"text":["You can use a tool like this one to search for domain name securely. <a href=\"https:&#x2F;&#x2F;www.domainhamper.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.domainhamper.com&#x2F;<\/a>"],"time":["2020-09-20 15:15:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ncmncm"],"id":[24530303],"kids":[24531924,24531004,24531714],"parent":[24514085],"text":["I don&#x27;t know if SCons is <i>still<\/i> slow, but in 2018 it was definitely very, very slow. I doubt it has improved much, as its maintainers were in similar denial then.<p>When we used it at MongoDB, somebody (thanks Mathias!) put together apparatus to make it generate a ninja config instead of building by itself. That was fast! Anyway, after you had the ninja config.<p>But the edit-build-test cycle did not include a slow SCons run anymore, and that was huge.<p>The MongoDB internal wiki had a page titled &quot;SCons Isn&#x27;t <i>That<\/i> Slow&quot;, with advice for how to live with how slow it really was, later including (&quot;unofficial&quot;) ninja and ccache setup. (Which I added.)<p>But at least it wasn&#x27;t WAF."],"time":["2020-09-19 23:04:58"],"type":["comment"],"deleted":{},"dead":{}},{"by":["qppo"],"id":[24529874],"kids":[24529990,24530245],"parent":[24514085],"text":["I feel like if you close with &quot;only 20% slower than make&quot; you can&#x27;t justify the title &quot;is not slow.&quot;<p>20% is a pretty huge margin for large builds, which I wouldn&#x27;t consider using make for in the first place. CMake + Ninja has shaved enormous amounts of time off my builds from make, so why should I use something that&#x27;s even slower?"],"time":["2020-09-19 21:34:09"],"type":["comment"],"deleted":{},"dead":{}},{"by":["beervirus"],"id":[24529971],"kids":[24530748],"parent":[24514085],"text":["Rebuttal here: <a href=\"https:&#x2F;&#x2F;blog.melski.net&#x2F;2013&#x2F;12&#x2F;11&#x2F;update-scons-is-still-really-slow&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.melski.net&#x2F;2013&#x2F;12&#x2F;11&#x2F;update-scons-is-still-rea...<\/a>"],"time":["2020-09-19 21:57:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dTal"],"id":[24530097],"kids":{},"parent":[24514085],"text":["Ironically, hitting the front page of HN with a title of &quot;SCons Is Not Slow&quot; is, for me, <i>excellent<\/i> circumstantial evidence that SCons is, in fact, slow."],"time":["2020-09-19 22:23:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mmorearty"],"id":[24530062],"kids":{},"parent":[24514085],"text":["Scons is definitely slow in some scenarios. It has O(m * n) performance if a rule has m inputs and n outputs. I tdiscovered this when working with a code base that had a single rule with all .ts files as inputs, and all .js files as outputs. As the number of files we had got bigger, SCons got painfully slow. Of course we can rewrite our rules, but that shouldn’t be necessary, especially since it was quite hard to figure out why our builds got so slow."],"time":["2020-09-19 22:15:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["onebaddog"],"id":[24535991],"kids":{},"parent":[24514085],"text":["As the maintainer of SCons I can assure you that we are aware of SCons&#x27;s performance issue.<p>The page in question is actually quite old at this point.<p>Since the content was written Ninja, Cmake, Bazel, and other build systems have launched and become mature.<p>We are slowly working through the easiest of the list of known performance issues.<p>In addition MongoDB has contributed their Ninja file output logic.\nWe expect to integrate that in the next major release.<p>Projects like MongoDB, Godot, VMware, PlatformIO, and many others use SCons.\nOne of it&#x27;s strengths is the ability to correctly build complex builds.<p>Please engage with the community our users mailing list, IRC Channel, or discord server if you&#x27;re a user.<p>One frustration for the project is that users run into issues using SCons and never reach out and ask for help. \nMany times a small change in usage will resolve whatever has a user stuck."],"time":["2020-09-20 20:18:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dimator"],"id":[24530026],"kids":[24530216],"parent":[24514085],"text":["Slow or not, it becomes cryptic to write Sconsfiles with any complexity, and it&#x27;s <i>impossible<\/i> to debug."],"time":["2020-09-19 22:06:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["amelius"],"id":[24529843],"kids":[24529865,24529868,24529939,24529934,24530481,24529890],"parent":[24514085],"text":["I hope that FOSS can converge to a single build system as much as possible, because it&#x27;s not very convenient to learn them all."],"time":["2020-09-19 21:28:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["budabudimir"],"id":[24532824],"kids":{},"parent":[24514085],"text":["Indeed, I had the misfortune of using SCons on one project back in 2017-2019. It was ridiculous how slow it was. Even for the case when &quot;Nothing to be done&quot; was the result it took 20-40 seconds to output the message.<p>Thankfully we switched to ninja."],"time":["2020-09-20 11:07:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gfxgirl"],"id":[24530988],"kids":[24532706],"parent":[24514085],"text":["SCons is the worst experience I&#x27;ve had with a build system. No one, even its advocates, ever really understood what was going on. Things became so much simpler and orders of magnitude faster when we switched away"],"time":["2020-09-20 01:34:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mypalmike"],"id":[24530376],"kids":{},"parent":[24514085],"text":["Maybe add (2014) to the title? It looks like the text may have been revised a few times since, but the original appears to be at least that old."],"time":["2020-09-19 23:18:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["29athrowaway"],"id":[24530191],"kids":[24530356,24531771],"parent":[24514085],"text":["I have not tried SCons, and I have not heard about it in a while. \nIs it good? who does it compare to CMkae or Bazel?<p>For context, I don&#x27;t like autotools."],"time":["2020-09-19 22:40:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["person_of_color"],"id":[24532085],"kids":[24532587,24532514],"parent":[24514085],"text":["Do people use tup?"],"time":["2020-09-20 07:29:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["person_of_color"],"id":[24532089],"kids":{},"parent":[24514085],"text":["We need a deep learning based build system."],"time":["2020-09-20 07:29:55"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bob1029"],"id":[24529412],"kids":[24530156,24529664],"parent":[24529078],"text":["I wonder if you could train a neural network to analyze these masks. I.e. going from physical mask images back down to EDA simulation without humans needing to decode everything visually."],"time":["2020-09-19 20:18:32"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kens"],"id":[24529164],"kids":[24529530,24529365],"parent":[24529078],"text":["Author here to answer your questions about the Nanoprocessor :-)"],"time":["2020-09-19 19:44:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ncmncm"],"id":[24531941],"kids":{},"parent":[24529078],"text":["Speaking of increment&#x2F;decrement architectures and Turing completeness, the Brainfuck programming language provides only one-byte increment, decrement, index via the single register and inc&#x2F;dec, and branch-on-zero operations, and is Turing complete. It is very specifically designed to be unpleasant to program in, but to provide a glow of satisfaction at having succeeded in programming anything at all recognizable.<p>A Brainfuck interpreter in Brainfuck is around ~4-500 bytes. In C, it has been achieved (taking truly gross liberties with C semantics) in 144 bytes -- about two lines, necessarily including substrings &quot;main(c,v)&quot; and &quot;putchar(&quot;.<p>Programming a nanoprocessor would differ from programming Brainfuck, but would feel curiously familiar."],"time":["2020-09-20 06:42:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24529512],"kids":[24529753],"parent":[24529078],"text":["Seeing the detail analysis of what is now an esoteric item is really fascinating. How much work does it take to get a close look at a chip this sized?"],"time":["2020-09-19 20:33:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Fatheroftruth"],"id":[24529691],"kids":{},"parent":[24529078],"text":["<a href=\"https:&#x2F;&#x2F;amirarticles.com&#x2F;positive-points-of-trump-term&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;amirarticles.com&#x2F;positive-points-of-trump-term&#x2F;<\/a>\nTrump becomes very popular every day, lets discuss some points to find out why people love him more compare to Biden? I choose only a few important Positive Points of Trump 1st Term, but there are too many more."],"time":["2020-09-19 21:03:12"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["sokoloff"],"id":[24523850],"kids":[24529001,24524237],"parent":[24522485],"text":["Just tried this on my account (around 12 folders and 45 designs); it worked pretty well and is definitely useful.<p>It did crash on several different projects. The first was one where I&#x27;d imported a bunch of very detailed model parts for a Raspberry Pi. I just skipped over that project in subsequent runs. (Probably was from this link: <a href=\"https:&#x2F;&#x2F;gallery.autodesk.com&#x2F;fusion360&#x2F;projects&#x2F;124986&#x2F;raspberry-pi-3-bplus\" rel=\"nofollow\">https:&#x2F;&#x2F;gallery.autodesk.com&#x2F;fusion360&#x2F;projects&#x2F;124986&#x2F;raspb...<\/a> )<p>However, it still crashed on some other runs with much simpler models. (It was a Fusion360 crash, with 0 bytes in the timestamp.txt log file. In each case, it seemed like it exported an entire design but crashed while loading and before exporting any file types of the next one.)<p>I tried to find a reproducible case, but didn&#x27;t get to an entirely reproducible case. Along the path, I did find a (stops script, but doesn&#x27;t crash F360) error &quot;ascii codec can&#x27;t encode character &#x27;\\u2019&#x27; in position 20: ordinal not in range (128)&quot;<p>I presume that was on a project named &quot;Name&#x27;s phone&quot; (where the apostrophe is a right-single-quotation-mark), however that project does appear to have successfully exported on a prior run before I tried to find a repro case for it. That exported into a directory named with a right-single-quotation-mark while the relevant files in that directory had the mark changed to ascii 0x27 (single-quote).<p>It also only exports visible bodies. I will sometimes have a project with multiple bodies and if the visibility is set to 0, they seem to not be exported by this process. If they&#x27;re all set to 1, they&#x27;re exported as a single output stl&#x2F;step. Not a deal-breaker, but is something to be aware of. Still awesome&#x2F;thanks!"],"time":["2020-09-19 03:13:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tanvach"],"id":[24523239],"kids":{},"parent":[24522485],"text":["This is awesome. For context: Fusion 360 personal license is being locked down in October, and will restrict many useful functions, including exporting projects as STEP file (industry standard file format)."],"time":["2020-09-19 02:13:55"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sokoloff"],"id":[24522906],"kids":{},"parent":[24522485],"text":["I can only hope that Autodesk has analytics running on F360 activities and sees the uptick in exports here...<p>Thanks for the tool!"],"time":["2020-09-19 01:33:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ireflect"],"id":[24523646],"kids":{},"parent":[24522485],"text":["Here’s another one which exports sketches to DXF files in addition to the 3D models.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;Jnesselr&#x2F;fusion-360-total-exporter\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Jnesselr&#x2F;fusion-360-total-exporter<\/a>"],"time":["2020-09-19 02:50:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["PaulHoule"],"id":[24528157],"kids":[24528204,24529205],"parent":[24527928],"text":["1&#x2F;3 of that is health insurance.<p>Health insurance is a weird one because even though people think they want it when &quot;daddy&quot; is paying for it,  if they got to trade health insurance for something that cost about as much such as<p>* two months of vacation a year\n* free housing for life,  etc.<p>many would pick the later.  Michael Foucault,  in his &quot;birth of the clinic&quot; points out that rich people who could afford (say) Heart Bypass Surgery couldn&#x27;t get it unless somehow other people who couldn&#x27;t afford the surgery could get it,  because otherwise the surgery wouldn&#x27;t be done often enough to not be a death sentence."],"time":["2020-09-19 17:39:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["clairity"],"id":[24528623],"kids":[24528682,24528769,24528807,24528723],"parent":[24527928],"text":["&gt; &quot;Capital income amounts for two percent of income for the bottom 99 percent of households.&quot; (page 7 of the pdf)<p>so 98% of capital income accrues to the 1% who have no monopoly on how best to allocate capital--see irrational capital flight into tech stocks and real estate, and a lack of real innovation, rather than iteration, in the past 50 years.<p>blind faith in market efficiencies in a profoundly unfair and corrupt marketplace only worsens our economy overall. this must be kept in mind in any discussion of the captured regulatory environment and tax policy.<p>we&#x27;re losing economic dynamism to the whims of the rich, and to the detriment of all."],"time":["2020-09-19 18:35:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rdlecler1"],"id":[24529151],"kids":[24529252],"parent":[24527928],"text":["People are much more mobile today than in the 60s. So while the top 5th may be improving, I would guess that much of that is in major cities where the cost of housing and education far exceeded income growth. It’s not just growth in income it’s growth in income relative to your local cost of living."],"time":["2020-09-19 19:42:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["seibelj"],"id":[24528279],"kids":[24528364,24528656,24528392,24528377],"parent":[24527928],"text":["We all agree that people in general act in their economic self interest. We also agree that people prefer to donate money to specific causes they support rather than pay extra in taxes - I think this is a fair statement. Redistribution as a concept has widespread support, but the mechanism to do so has wide disagreement, so each person tends to prefer selecting their own mechanism of redistribution through donations to non-profits rather than pay extra to the government.<p>Therefore, any solution proposed through the (long, compromised, imperfect, special-interest ridden, full-of-holes) government legislative process will be relatively easy to bypass by motivated rich people with the means to pay professionals to structure their assets accordingly, as has been the case for centuries. And the rich won&#x27;t necessarily do it with sinister intent - they may still give a huge amount of money to causes they support, but simply disagree with giving it to the government as a blank check. Or maybe the rich are just greedy and self-interested. But either way, the government will be unable to take this money.<p>I don&#x27;t think any redistribution mechanism implemented by the government can attack the rich long-term. They may get snagged initially, then quickly reorganize their assets to avoid such issues. The true people who get snagged are the middle class, who actually do pay taxes (while the poor often have negative-taxes and receive the redistribution), but do not have the means to restructure themselves to avoid the taxes.<p>So we are left with 2 options - the first are broad, universal tax increases (which no one advocated for in the US election except Bernie Sanders) rather than (inevitably-failing) soak-the-rich taxes, and the second being to restructure society to provide the same or more services to people using less taxes.<p>I prefer the latter - we should be adding efficiency to the state, while giving people more choice on how to help each other. I don&#x27;t want to delve into the details in this comment. But my overall point is that taxes targeting the rich and super-rich will fail, as they always have and always will, so we need some other solution if we desire to reduce inequality."],"time":["2020-09-19 17:53:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24528593],"kids":[24528678],"parent":[24527928],"text":["Hasn’t the definition of taxable income changed over this period? I wonder how a normalized version would look."],"time":["2020-09-19 18:31:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tlb"],"id":[24530337],"kids":{},"parent":[24529835],"text":["Keep in mind: If you do something that bothers Lego or any of the rights holders for their tie-ins, you have a problem. If you have $1M and 2-5 years to spend on litigation, a court might be able to determine exactly how much of a problem you have. But if you don&#x27;t have that much time and money, you have an insurmountable problem. All you can do is cease &amp; desist.<p>For example, the case of whether the Java API is copyrightable has been going on for 10 years and we still don&#x27;t know the answer. Google and Oracle can afford to duke it out for that long, but you probably can&#x27;t.<p>So exactly what the law allows only matters if you&#x27;re prepared to litigate. Otherwise, plan A should be to not bother anyone.<p>A strategy that sometimes works is to proactively reach out and talk about how your site will be good free marketing for their products."],"time":["2020-09-19 23:11:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["asperous"],"id":[24530400],"kids":[24530511,24530444],"parent":[24529835],"text":["There is an answer from a real lawyer on this website [1]<p>Summary: &quot;Copyright covers works of original authorship fixed in any tangible medium of expression, even LEGO building bricks.&quot;<p>[1] <a href=\"https:&#x2F;&#x2F;www.avvo.com&#x2F;legal-answers&#x2F;can-you-copyright-a-lego-model-design--1595500.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.avvo.com&#x2F;legal-answers&#x2F;can-you-copyright-a-lego-...<\/a>"],"time":["2020-09-19 23:21:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["esquivalience"],"id":[24530170],"kids":[24530347],"parent":[24529835],"text":["Copyright law is variable worldwide and (in the EU) the question is actually shifting a bit at the moment but speaking very generally,<p>You can create your own things in Lego and that will be your own copyright work if you&#x27;ve exercised your own creative input in making it.<p>If it&#x27;s a copy of someone else&#x27;s Lego model (or equivalent) that&#x27;s not your work and would infringe theirs.<p>If you&#x27;re portraying some external thing with Lego the question is more complicated. It varies from a general impressionist rendition of some thing (your work) to a pixel-by-pixel perfect recreation in little Lego dots (not your work). But that&#x27;s not specific to Lego.<p>This is just a thumbnail sketch of a huge question. Your examples are useful but don&#x27;t cover the full range of texture that real life brings."],"time":["2020-09-19 22:36:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Kosirich"],"id":[24530259],"kids":[24530316,24530266],"parent":[24529835],"text":["I highly recommend that you contact LEGO’s customer service directly with the question, as they are easy to reach and they really take pride in being available and they try to provide answers or point to people who can (source: dude trust me)"],"time":["2020-09-19 22:54:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["extra88"],"id":[24530822],"kids":[24530848],"parent":[24529835],"text":["&gt; Lego bricks are a system. Their website footer says LEGO System A&#x2F;S, DK-7190 Billund, Denmark. And that in the US systems are not copyrightable<p>Having the word &quot;System&quot; in the company name doesn&#x27;t mean anything. But a Lego System does seem to be a thing [0], &quot;The LEGO System means that: all elements fit together, can be used in multiple ways, can be built together. This means that bricks bought years ago will fit perfectly with bricks bought in the future.&quot;<p>I&#x27;m not sure what &quot;system&quot; means in a copyright sense but I what Lego seems to mean by &quot;system&quot; is a consistent set of parts and ways for those parts to fit together. If that&#x27;s what copyright means by &quot;system&quot; you can&#x27;t copyright that but I think that&#x27;s what Lego has patented.<p>The existence of the system would have no bearing on the copyrightability of any work created out of the parts they designed and connected using their system. I can buy a bunch of gray and white Lego, fit them together to make a sculpture that looks like my cat and have a copyright on that work (if it&#x27;s sufficiently original).<p>[0] <a href=\"https:&#x2F;&#x2F;www.lego.com&#x2F;en-us&#x2F;lego-history&#x2F;lego-system-in-play-60d5efbce6cf46a78794f108b3c19bda\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lego.com&#x2F;en-us&#x2F;lego-history&#x2F;lego-system-in-play-...<\/a>"],"time":["2020-09-20 00:51:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["geofft"],"id":[24530181],"kids":[24530296],"parent":[24529835],"text":["&gt; <i>My understanding is that Lego bricks are a system. Their website footer says LEGO System A&#x2F;S, DK-7190 Billund, Denmark.<\/i><p>&gt; <i>And that in the US systems are not copyrightable: <a href=\"https:&#x2F;&#x2F;www.law.cornell.edu&#x2F;uscode&#x2F;text&#x2F;17&#x2F;102\" rel=\"nofollow\">https:&#x2F;&#x2F;www.law.cornell.edu&#x2F;uscode&#x2F;text&#x2F;17&#x2F;102<\/a><\/i><p>Wouldn&#x27;t this logic imply that operating systems are not copyrightable, or that works created using products from Adobe Systems Inc. are not copyrightable?"],"time":["2020-09-19 22:38:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pbhjpbhj"],"id":[24530227],"kids":{},"parent":[24529835],"text":["IANAL; this is not legal advice.<p>My instinct is yes lego models would attract copyright protection, but copyright applies to works that have a distinctive quality to them. If you make a generic house, no copyright.<p>Also, people only infringe if they copy, just creating the same lego model isn&#x27;t enough and courts are likely to need extraordinary proof to sway the &#x27;balance of probabilities&#x27; towards the work being a copy.<p>Yes, instructions can be reproduced as they are factual and not artistic, but you can&#x27;t necessarily copy the way the instructions are presented (eg images are likely to be protected by copyright, but an image of a single brick wouldn&#x27;t pass the distinctiveness threshold; and also probably wouldn&#x27;t be copied).<p>You&#x27;d need to make it explicitly clear if you didn&#x27;t have trademark approval from Lego that your lego models were not originated by them (if your images show their bricks or use the word &quot;lego&quot;).<p>In the UK, Design Rights might be more relevant, but I know very little about them. In other countries Utility Patents might also have relevance.<p>If your designs are functional then the functional elements won&#x27;t accrue copyright&#x2F;design rights.<p>In UK you&#x27;d probably be limited to actual damages for infringements (people copying your lego model), ~£0.<p>I consider lego to be genericised, but courts would probably disagree.<p><i>This post represents my private, personal opinion and in no way relates to my employment.<\/i>"],"time":["2020-09-19 22:49:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tgflynn"],"id":[24530509],"kids":[24530828],"parent":[24529835],"text":["I&#x27;m not a lawyer, but I think you are misunderstanding paragraph b:<p>&gt; In no case does copyright protection for an original work of authorship extend to any idea, procedure, process, system, method of operation, concept, principle, or discovery, regardless of the form in which it is described, explained, illustrated, or embodied in such work.<p>I think what that means is that just because your copyrighted work describes or represents some system it doesn&#x27;t mean that you have copyrighted the system itself.  For example if you write a book that describes an operating system in general terms it doesn&#x27;t mean that you have any rights to the general concept of an operating system as it exists in any form apart from your book.<p>So I don&#x27;t think that paragraph is relevant to whether a work made of LEGO bricks is copyrightable or not (I think that the answer to that question would typically be yes)."],"time":["2020-09-19 23:43:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jacquesm"],"id":[24530104],"kids":[24530128,24530241,24530850],"parent":[24529835],"text":["Not a lawyer, but I&#x27;d be happy to bet that works in LEGO are copyrightable. After all, LEGO is just the medium for an expression here, and by creating something with LEGO as that medium you have made a (hopefully) original work.<p>I don&#x27;t see the difference between LEGO, bits of code, a book, an audio recording or a work of art such as a sculpture or a painting.<p>That said, since LEGO itself started out by infringing on the intellectual property rights of others as far as I&#x27;m concerned they can jump into a lake, but that&#x27;s not something that will get you very far in a court in case you get sued.<p><a href=\"https:&#x2F;&#x2F;www.todayifoundout.com&#x2F;index.php&#x2F;2011&#x2F;03&#x2F;lego-stole-their-now-patented-bricks-from-kiddicrafts-patented-self-locking-bricks&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.todayifoundout.com&#x2F;index.php&#x2F;2011&#x2F;03&#x2F;lego-stole-...<\/a>"],"time":["2020-09-19 22:24:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bawolff"],"id":[24530756],"kids":{},"parent":[24529835],"text":["IANAL<p>I suspect that plain lego bricks are not original enough to warrant copyright (threshold of originality and also very utilitarian - utility objects dont have copyright in usa) but the little lego figurines might be copyrighted.<p>Basing this on: <a href=\"https:&#x2F;&#x2F;commons.wikimedia.org&#x2F;wiki&#x2F;Commons:Derivative_works#I_know_that_I_can&#x27;t_upload_photos_of_copyrighted_art_(like_paintings_and_statues),_but_what_about_toys?_Toys_are_not_art%21\" rel=\"nofollow\">https:&#x2F;&#x2F;commons.wikimedia.org&#x2F;wiki&#x2F;Commons:Derivative_works#...<\/a>"],"time":["2020-09-20 00:33:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["chx"],"id":[24530973],"kids":{},"parent":[24529835],"text":["While the interpretation of the Berne Convention will vary from jurisdiction to jurisdiction, Chief Justice McLachlin of Canada&#x27;s Supreme Court offers significant guidance <a href=\"https:&#x2F;&#x2F;www.canlii.org&#x2F;en&#x2F;ca&#x2F;scc&#x2F;doc&#x2F;2004&#x2F;2004scc13&#x2F;2004scc13.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.canlii.org&#x2F;en&#x2F;ca&#x2F;scc&#x2F;doc&#x2F;2004&#x2F;2004scc13&#x2F;2004scc1...<\/a><p>&gt;  In addition, an original work must be the product of an author’s exercise of skill and judgment.  The exercise of skill and judgment required to produce the work must not be so trivial that it could be characterized as a purely mechanical exercise.<p>We should check the German Supreme Court as well <a href=\"https:&#x2F;&#x2F;www.lexology.com&#x2F;library&#x2F;detail.aspx?g=347fb9e3-0348-4af9-b7cf-ed1d7449dbf0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lexology.com&#x2F;library&#x2F;detail.aspx?g=347fb9e3-0348...<\/a><p>&gt; for the protection of works of applied art under copyright law “a degree of creativity which allows, from the view of a public open to art and sufficiently skilled in ideas of art, to be called an ‘artistic’ performance”<p>In both of your examples and your further question alas there is nothing clear cut here. If someone copied Example 2 and decided to sell it to a museum as a piece of modern art and the museum decided to accept it as such, there&#x27;s a very high chance of a successful lawsuit of infrigement. In most cases, however, you might find it extremely challenging to prove in a lawsuit that something made from LEGO reaches the treshold of originality.<p>And can you sell instructions and LEGO pieces? Sure, why not. You own the LEGO pieces, under the first sale doctrine, LEGO has exhausted their rights to them. Creating new instructions are free speech and as such, they are absolutely impossible to stop. Even in jurisdictions where free speech is more limited in the United States, legislators have been extremely careful on setting those limits. (Even where lockpicking is not legal, lockpicking videos absolutely are. Agatha Christie novels are sold despite they could be viewed as recipes on how to commit murder. And so forth.) Now, if someone produces a different set of instructions that results in the same thing, there&#x27;s nothing you can do to stop them as ideas are not copyrightable. You could patent it should it rise the level of patentability."],"time":["2020-09-20 01:31:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mensetmanusman"],"id":[24530516],"kids":[24530788],"parent":[24529835],"text":["Interlocking blocks are like words. You can string them together in any number of ways, most of which have no value.<p>However, some of these ways are aesthetically or mechanically interesting, and are up to the designer to discover.<p>After this pattern&#x2F;arrangement is discovered, it’s exact layout can be copyrighted.<p>Now, modifications by others to the layout would not be protected so long as it was different enough. (Fashion has this same issue, the difference can be extremely minor, and then it is not covered)."],"time":["2020-09-19 23:45:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ghaff"],"id":[24530113],"kids":[24530271],"parent":[24529835],"text":["Not a lawyer but I&#x27;d just point out that your example 2 isn&#x27;t just a picture of something built with LEGO bricks. I&#x27;m assuming the original LEGO bricks are out of patent (which may be relevant here as well) but other parts may not be.<p>In addition, while it&#x27;s presumably not applicable in this case, some LEGO sets are presumably licensed from the holders of trademarks or other IP (as in the case of Star Wars sets). Whereas a knock off would not be.<p>But again IANAL."],"time":["2020-09-19 22:27:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["alexchamberlain"],"id":[24530486],"kids":{},"parent":[24529835],"text":["IANAL etc<p>Recipes are not copyrightable, in general - though that is a complex question in its own right - but the text is. So I think you&#x27;re correct in saying if someone follows a set of instructions and rewrites them in their own words, they are probably fine. That being said, Lego is awesome and I wouldn&#x27;t want to annoy them, as they might stop selling me the bricks..."],"time":["2020-09-19 23:39:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mikerg87"],"id":[24530370],"kids":[24530406],"parent":[24529835],"text":["This sounds like, what is Is known in the world of LEGO as a My Own Creation (MOC). Tons is sites sell plans and brick kits to build all manner of sculptures and dioramas. Maybe this will give you a research avenue to answer your question."],"time":["2020-09-19 23:17:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Fire-Dragon-DoL"],"id":[24532313],"kids":{},"parent":[24529835],"text":["There is an artist that makes lego sculpture. Since he is famous, I&#x27;d imagine he solved whatever problem is related to the fact that he uses lego."],"time":["2020-09-20 08:39:58"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24530348],"kids":{},"parent":[24529835],"text":{},"time":["2020-09-19 23:13:35"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["Alex3917"],"id":[24528622],"kids":[24529656,24529493,24529917],"parent":[24527835],"text":["Is there a good place to learn about new apple cultivars? I want to plant some apple trees, but since they would be in a backyard orchard there isn&#x27;t any need for them to be commercially viable, just whatever tastes good. I know there are heirloom Apple orchards and festivals I can go to, but not sure where to find info on more modern cultivars beyond the ones like SnapDragon and Cosmic Crisp that have huge commercial releases.<p>It&#x27;s a lot easier to learn about things like North American Pawpaws and American persimmons, because there are only a couple people working on the genetics for each and you don&#x27;t have millions of dollars worth of SEO spam preventing any useful information from surfacing."],"time":["2020-09-19 18:35:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["anfilt"],"id":[24530233],"kids":{},"parent":[24527835],"text":["A wax apple... Not the most solid proof. That just proves it has the right appearance. (although if there is a distinctive feature might be good enough) Honestly, was expecting that they found either an old seed or dried sample to compare genetics. Better than nothing though.<p>Honestly, surprised no has even a dried leaf."],"time":["2020-09-19 22:50:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jerrysievert"],"id":[24529118],"kids":{},"parent":[24527835],"text":["I&#x27;d love for there to be an affordable way to test wild growing or even &quot;abandoned&quot; apples to figure out their genetics.  it you can do it easily with cannabis, why not fruits and vegetables?"],"time":["2020-09-19 19:37:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24528404],"kids":[24528755,24528492],"parent":[24527835],"text":["A lot of naming is misleading, in this case “extinct” should probably have been called “believed to be extinct”.<p>Of course proving something is extinct is quite difficult, perhaps infeasible for the small organisms. So maybe also a “provisionally extinct” category?"],"time":["2020-09-19 18:07:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24528551],"kids":{},"parent":[24515504],"text":["The thrust of the article is right. Though defining “embedded science” so broadly means every construct in the modern world has “embedded science”.<p>It may be better to say that our creations better incorporate an understanding of the true nature of reality."],"time":["2020-09-19 18:26:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["londons_explore"],"id":[24526232],"kids":[24527505],"parent":[24507840],"text":["It seems almost impossible to measure the &quot;return&quot; on most government investments...<p>How much exactly did the economy benefit from building a new road?"],"time":["2020-09-19 11:26:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["xiphias2"],"id":[24526098],"kids":[24526166],"parent":[24507840],"text":["I&#x27;m happy that government contracts are being analyzed as investments, but the goals are generally different:<p>- Infrastructure investments inside a nation can make workers depend more on government and can get politicians elected&#x2F;reelected<p>- As they are simple businesses without many risks, they are a great way for corruption, which helps politicians to keep and strengthen their power.<p>The investments should be viewed as getting ROI for the politicians themselves as well.<p>As I&#x27;m living through a democracy turning into a dictatorship, I can attest that so far it works."],"time":["2020-09-19 10:42:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sideshowb"],"id":[24526213],"kids":{},"parent":[24507840],"text":["Title should add &quot;in China&quot;<p>Not saying that&#x27;s true or false elsewhere, indeed I&#x27;d be interested to know."],"time":["2020-09-19 11:19:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["paulv"],"id":[24525902],"kids":{},"parent":[24513858],"text":["This looks interesting, but be careful of the license. It is only &quot;free for research purposes&quot;."],"time":["2020-09-19 09:49:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["daef"],"id":[24513874],"kids":{},"parent":[24513858],"text":["It stuffed with features:<p><pre><code>  * OpenSCAD like modeler\n  * with GPU support everywhere\n  * various parameters for support&#x2F;infill&#x2F;...\n    cannot only be defined for layer ranges\n    but also as vector fields\n  * experimental slicing features not seen anywhere else\n    e.g. &#x27;cavity&#x27;: makes parts as hollow as\n          possible while keeping them printable\n    or &#x27;wings&#x27;: support that avoids the part itself\n    or direction agnostic infill patterns,\n    ...<\/code><\/pre>"],"time":["2020-09-18 09:18:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jmiskovic"],"id":[24527618],"kids":{},"parent":[24513858],"text":["Last time I came across IceSL I was searching for Lua code that implements operations on 3D meshes. Operations like extrude, bevel, intersect, union and so on. This project has bunch of stuff in open source but some parts are clearly missing. Maybe someone has better idea where to find such core mesh manipulation algorithms for Lua?"],"time":["2020-09-19 16:21:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dahartigan"],"id":[24527009],"kids":{},"parent":[24513858],"text":["I&#x27;m happy to see innovation in the slicing side of 3D printing, it&#x27;s going to only get better at this rate I hope."],"time":["2020-09-19 14:38:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["spians"],"id":[24527582],"kids":[24531689,24529602],"parent":[24527565],"text":["Hey HN,<p>We&#x27;ve created an RSS feed and offline reader app for android that doesn&#x27;t show ads&#x2F;track your activity. The app is a combination of a feature rich RSS reader, minimalist podcast player and an offline article downloader (similar to read it later apps). The app has novel ways to add RSS feeds and has an offline first strategy.<p>Please try out the app and let us know if you have any questions or what you&#x27;d like to see in coming versions!"],"time":["2020-09-19 16:16:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["llarsson"],"id":[24529995],"kids":[24532856,24530275],"parent":[24527565],"text":["What&#x27;s the in-app purchase one can make, according to the Play store?<p>Also, just noting that Feeder is open source and pretty good. Does not play podcasts, but I have AntennaPod for that."],"time":["2020-09-19 22:01:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cormacrelf"],"id":[24528341],"kids":[24528446],"parent":[24526861],"text":["The traits section seems to be more a problem of the author seeing object and classes instead. Calling them traits and not classes should have been enough, IMO, to dispel that, but it is a common mistake so fair enough. You should think of them, as the compiler devs do, as Prolog code interpreted at compile time.<p>Traits are sets. “Impl” means a type, or any type described by the constraints, is in that set.<p><pre><code>    trait A {}\n    struct S;\n    impl A for S {} &#x2F;&#x2F; S is in A\n    impl&lt;T&gt; A for Vec&lt;T&gt; where T: A {} &#x2F;&#x2F; Vecs of A are also in A\n<\/code><\/pre>\nType constraints are a way to use those sets to specify which types are allowed in which places. The compiler then tries to prove that the types you do use are in fact in the sets you say they have to be in.<p>That’s it."],"time":["2020-09-19 17:59:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Gys"],"id":[24527902],"kids":[24527956],"parent":[24526861],"text":["Once I regularly see the bashing of a language I know that language is generally accepted and therefore mature."],"time":["2020-09-19 17:10:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["staticassertion"],"id":[24528066],"kids":[24528348],"parent":[24526861],"text":["No real argument about this, seems to be essentially true. I just have never cared about anything in this article while writing Rust. The maturity I care far more about is &quot;if I want a library is it available, documented, api stable, and relatively bug free&quot;, which Rust does <i>okay<\/i> at."],"time":["2020-09-19 17:29:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jedisct1"],"id":[24529052],"kids":[24532197,24529662,24529603],"parent":[24526861],"text":["In spite of its currently growing adoption, my prediction is that Rust will be replaced in a foreseeable future.<p>Rust brought a novel idea to the landscape of programming languages. The borrow checker is a great invention, and a great contribution to making applications more secure.<p>The language itself is way too complicated. The learning curve is steep. Improvements are made (e.g. lifetime elision) but they don&#x27;t flatten the curve.<p>Macros are very hard to debug and understand. Which is even more of an issue when they are used by dependencies and something goes wrong. Error messages don&#x27;t help. Macros are powerful but can hide too much magic. Plus, they are a language of their own.<p>&quot;Why doesn&#x27;t have this structure any methods?&quot; &quot;Oh, they are hidden in traits, provided by other crates, themselves leveraging other traits from other crates&quot;. &quot;Still, it doesn&#x27;t compile. Why?&quot; &quot;Oh, because of that generic that requires traits from yet another crate that are only available when some Cargo features has been enabled&quot;. Once again, this is difficult to follow and debug.<p>Zero-cost abstractions are great, but in Rust, they are overused. This makes the language less accessible, but also constantly causes dependency issues due to incompatible versions.<p>Rust is powerful but it is not optimized for developer happiness. Fighting the compiler brings anger, not joy. Sure, the compiler may have good reasons to complain. But as a developer, I&#x27;m happier and more productive when code immediately runs, even if that means having to fix bugs later. This is from a happiness view, not from a security perspective. But eventually, happiness turns into productivity.<p>It&#x27;s too late to fix this. But now that Rust demonstrated that memory safety and speed were not incompatible, future system languages will feel obligated to provide the same properties, maybe by using mechanisms similar to Rust.<p>So, my prediction is that Rust will slowly be replaced by new safe languages that will be more accessible, more productive, more stable, and bring novel ideas of their own. But Rust will have made history no matter what."],"time":["2020-09-19 19:27:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["steveklabnik"],"id":[24527117],"kids":[24528453,24527970,24527997,24527917],"parent":[24526861],"text":["Everyone is going to have a different definition of &quot;mature&quot;, and that&#x27;s fine :) Obviously lots of respect for Kostya. I do think that framing these as &quot;maturity&quot; is a good framing, that is, fundamentally, he&#x27;s right. A lot of this stuff has to do with Rust being so young, and in the future, it will be taken care of. I would argue that this is a significantly <i>higher<\/i> maturity requirement than most people actually need, and that Rust is more mature in other places and so may be for other people, but that&#x27;s a different thing.<p>My take on the state of these issues:<p>&gt; Rust does not have a formal language specification...  I understand that adding new features is more important than documenting them but this is lame.<p>Most languages do not. It also really depends on what you mean by &quot;formal.&quot;<p>It&#x27;s not about being more important, it&#x27;s that we value stability <i>very<\/i> strongly, and don&#x27;t have the ability to document things with the guarantees we&#x27;d prefer. You might call it... not mature enough yet :)<p>There&#x27;s been a bunch of movement here, I&#x27;m excited to see it continue to develop!<p>&gt; Function&#x2F;method calling convention. ...  I’m told that newer versions of the compiler handle it just fine but the question still stands<p>The objection here doesn&#x27;t have to do with calling conventions, actually, this is about &quot;two-phase borrowing,&quot; described in a series of blog posts ending here <a href=\"http:&#x2F;&#x2F;smallcultfollowing.com&#x2F;babysteps&#x2F;blog&#x2F;2017&#x2F;03&#x2F;01&#x2F;nested-method-calls-via-two-phase-borrowing&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;smallcultfollowing.com&#x2F;babysteps&#x2F;blog&#x2F;2017&#x2F;03&#x2F;01&#x2F;nest...<\/a><p>I believe this will get even better with polonius <a href=\"https:&#x2F;&#x2F;nikomatsakis.github.io&#x2F;rust-belt-rust-2019&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;nikomatsakis.github.io&#x2F;rust-belt-rust-2019&#x2F;<\/a><p>Regarding argument evaluation order, technically it is not yet documented <a href=\"https:&#x2F;&#x2F;github.com&#x2F;rust-lang&#x2F;reference&#x2F;issues&#x2F;248\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;rust-lang&#x2F;reference&#x2F;issues&#x2F;248<\/a> but has been left-to-right for basically forever <a href=\"https:&#x2F;&#x2F;internals.rust-lang.org&#x2F;t&#x2F;rust-expression-order-of-evaluation&#x2F;2605&#x2F;34\" rel=\"nofollow\">https:&#x2F;&#x2F;internals.rust-lang.org&#x2F;t&#x2F;rust-expression-order-of-e...<\/a> and I actually thought that it <i>was<\/i> documented as such. I would expect this to shake out the exact same way as struct field destruction order, that is, something that&#x27;s been one way for a long time and so we wouldn&#x27;t change it even if maybe it&#x27;s a good idea to.<p>&gt; Traits...  the problem is not me being stupid but rather the lack of formal description on how it’s done and why what I want is so hard. Then I’d probably at least be able to realize how I should change my code to work around the limitations.<p>Upcasting&#x2F;downcasting is rarely used, and so has less love, generally, it&#x27;s true.<p>&gt; First of all, bootstrapping process is laughably bad.<p>So, Kostya acknowledges<p>&gt;  Of course it’s a huge waste of resources for rather theoretical problem but it may prove beneficial for compiler design itself.<p>Which is I think the way most feel about it. <i>However<\/i>, there is <i>some<\/i> desire to improve this, for other, related reasons. <a href=\"https:&#x2F;&#x2F;matklad.github.io&#x2F;2020&#x2F;09&#x2F;12&#x2F;rust-in-2021.html\" rel=\"nofollow\">https:&#x2F;&#x2F;matklad.github.io&#x2F;2020&#x2F;09&#x2F;12&#x2F;rust-in-2021.html<\/a> talks about some of them.<p>&gt; Then there’s LLVM dependency.<p>While this stuff is all true, we wouldn&#x27;t be where we are without it. Everything has upsides and downsides.<p>&gt; And finally there’s a thing related to the previous problem. Rust has poor support for assembly.<p>He mentions asm; we&#x27;re almost there! It took some time because it is not a simple problem. At the end of this, we&#x27;ll have <i>better<\/i> support than C or C++ according to his metrics; these are not part of the language standard, so give his previous comments about maturity, I find this one a <i>little<\/i> weird, but it is what it is. :)<p>&gt; There’s also one problem with Rust std library that I should mention too. It’s useless for interfacing OS.<p>Yes, the intention of the standard library is to be <i>portable<\/i>, so that&#x27;s not really a goal.<p>&gt; But the proper solution would be to support at least OS-specific syscall() in std crate<p>This may in fact be a good idea! I&#x27;m not sure how much use it would actually get."],"time":["2020-09-19 14:57:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["notamy"],"id":[24527994],"kids":[24528369],"parent":[24526861],"text":["It&#x27;s not loading for me, so here&#x27;s an archive: <a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20200919120933&#x2F;https:&#x2F;&#x2F;codecs.multimedia.cx&#x2F;2020&#x2F;09&#x2F;why-rust-is-not-a-mature-programming-language&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20200919120933&#x2F;https:&#x2F;&#x2F;codecs.mu...<\/a>"],"time":["2020-09-19 17:20:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rudolph9"],"id":[24528398],"kids":{},"parent":[24526861],"text":["Anyone interested in formal language specification should check out k-framework! This space is pretty mind blowing.<p><a href=\"http:&#x2F;&#x2F;www.kframework.org&#x2F;index.php&#x2F;Main_Page\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kframework.org&#x2F;index.php&#x2F;Main_Page<\/a>"],"time":["2020-09-19 18:06:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["chrismorgan"],"id":[24528193],"kids":[24528243],"parent":[24526861],"text":["Adding a few more things to Steve’s response:<p>&gt; <i>Rust does not have a formal language specification […] A proper mature language (with 1.0 in its version) should have a formal specification<\/i><p>Python doesn’t have a formal specification. It doesn’t even have a <i>semi<\/i>-formal specification. I would consider Python a proper mature language. (… even if it doesn’t have 1.0 in its version!)<p>Some recently-published work in the general direction of formally specifying Rust behaviour: <a href=\"https:&#x2F;&#x2F;people.mpi-sws.org&#x2F;~jung&#x2F;thesis.html\" rel=\"nofollow\">https:&#x2F;&#x2F;people.mpi-sws.org&#x2F;~jung&#x2F;thesis.html<\/a><p>&gt; <i>In Rust it’s undefined because there’s no format specification to tell you even that much.<\/i><p>That seems to me an very unreasonable definition of “undefined”. By that token, <i>nothing<\/i> in Rust is defined, which renders the term “undefined” devoid of meaning and completely useless. Rather, the implementation defines the specification, which, yes, is weaker than a formal specification, but not <i>that<\/i> much weaker. (Rust’s stability guarantees do allow it to retcon, but only if safety is on the line, or sometimes if you can convince people that affected code probably doesn’t exist, or was wrong anyway. Changing argument order evaluation in this sort of case would break plenty of real-life code, and so will never happen.)<p>&gt; <i>[…] traits […] the problem is not me being stupid but rather the lack of formal description on how it’s done and why what I want is so hard.<\/i><p>I disagree that the lack of a formal description of how it’s done is the problem, though such a description would certainly help. I feel that the real problem here is that you’re trying to treat traits as something that they’re not, trying to do things that you’re used to doing in dynamic&#x2F;GC languages that just don’t map to Rust because of it being a thin abstraction over what can be fastest. Upcasting and downcasting trait objects is <i>really<\/i> rare, because other constraints of the language make them just not very useful operations. The main reason you want those operations in other languages is inheritance, not interfaces, and Rust doesn’t do inheritance, and traits aren’t inheritance.<p>&gt; <i>rustc problems<\/i><p>The bootstrapping process is not laughably bad, the developers have merely prioritised their own ergonomics rather than pandering to making proving a theoretical problem false easier. Still more, they’ve prioritised actually <i>using<\/i> new functionality, which helps make sure that it both works properly, and is the <i>right<\/i> new functionality. So I find two or three good reasons for doing it the way they have, and one weak reason not to do it that way.<p>The LLVM dependency: I feel that this complaint is more about there being only a single Rust backend, rather than about the LLVM dependency. This point is then debatable. Yeah, Rust would be <i>more<\/i> mature if it had more backends (or better, more full implementations), but does having only a single implementation make it immature? Eh. Plenty of mature languages functionally have but a single implementation.<p>———<p>I definitely consider Rust not yet mature, I just don’t think that most of the reasons in this article are legitimate. I <i>would<\/i> focus in no small part on documentation, just not requiring <i>formality<\/i> of specification or documentation before I’d consider those parts mature. But note that I said that I’d consider <i>Rust<\/i> not yet mature, rather than the Rust <i>programming language<\/i>. Because in most regards I <i>do<\/i> actually consider the programming language itself mature, and a lot of its tooling (more than popular languages thrice its age), though there are definitely still gaps in both. But the ecosystem <i>around<\/i> the programming language, that’s the area where it’s not yet mature. Rust is much more complex than many languages (e.g. Go), so it takes a lot longer to fill in the spaces in library availability, and there are many very significant gaps that haven’t been filled yet. GUI, for example, is very immature space. Audio is… eh, it’s getting somewhere, but I wouldn’t call it <i>mature<\/i>. Web is approaching maturity for some sorts of tasks, but is not generally mature."],"time":["2020-09-19 17:43:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ch_123"],"id":[24533732],"kids":{},"parent":[24526861],"text":["I find it odd that inline assembly is considered the sign of a mature systems language when not even all C&#x2F;C++ compilers have it (for example, the last I checked, Microsoft&#x27;s x86-64 C++ compiler lacks it)"],"time":["2020-09-20 14:55:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ufmace"],"id":[24527912],"kids":[24528032],"parent":[24526861],"text":["Well the server for this page seems to be dead. I wonder what language it&#x27;s written in? ;)"],"time":["2020-09-19 17:11:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jjpe"],"id":[24527949],"kids":[24527991],"parent":[24526861],"text":["The problem with this article is that the first example is wrong, as in it compiles fine. I could even tell without running it that it would compile.<p>Therefore the article as a whole cannot be taken seriously, and reflecting that I stopped reading it immediately after."],"time":["2020-09-19 17:16:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["zmmmmm"],"id":[24530595],"kids":[24530634],"parent":[24530155],"text":["Half of this rationale seems to assume that TikTok can&#x27;t modify the app to work independently of Play Services. But that is completely something they could do. In fact, I&#x27;d assume they have a Chinese version already developed with separate infrastructure. Not sure why it is assumed that is so hard. It would be fascinating to see what would happen if a super popular app like that went all in on a side loaded distribution mechanism."],"time":["2020-09-20 00:00:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["on_and_off"],"id":[24530618],"kids":{},"parent":[24530155],"text":["Site doesn&#x27;t open.<p>I wonder how this would work ? Google can for sure remove an app from the play store and maybe even remove it from play services enabled phones.<p>If I am European and travel (in some hypothetic future where it is possible) to the USA, does tiktok get removed from my phone ?<p>Edit : I can open now. Some notes\nre : different apks for sideloading. I don&#x27;t know if the author is being malicious here but they are inventing problems that don&#x27;t exist. Yeah, there can be multiple apks for a given app (that&#x27;s the main idea behind app bundles). However if you distribute your app yourself you either<p>- provide an universal apk that will install on all devices. It will be way larger since it needs to incorporate all the different possible configurations, but is trivial to make for a dev.<p>- detect the user device config and provide a download link tailored to that device. I guess tiktok is popular enough to go that route, but that&#x27;s just a minor engineering point.<p>Also wow, very classy to insult people who use an app. Of course if you don&#x27;t like a service people who do have to be dumb."],"time":["2020-09-20 00:04:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["imglorp"],"id":[24530718],"kids":[24530768],"parent":[24530155],"text":["I&#x27;m concerned about the precedent of the government getting involved in app censorship on ideological grounds.<p>Today TT, tomorrow whatever the Party or our Dear Leader doesn&#x27;t find complimentary?"],"time":["2020-09-20 00:24:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sheeshkebab"],"id":[24530485],"kids":[24530497,24530562],"parent":[24530155],"text":["Devices - no, but it sure can be removed from Play Store entirely (not just US), and banned from using all US based cdn’s and hosting providers... pretty much killing it."],"time":["2020-09-19 23:39:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["4cao"],"id":[24530765],"kids":{},"parent":[24530155],"text":["Not sure what the article says (doesn&#x27;t open for me at the moment) but to answer the question:<p>Access to Play Store apps can be restricted to certain countries. Such apps do not appear in search results. So it&#x27;s possible for Tik Tok to disappear for anyone looking to install it in the US, or with a US-based Google account.<p>However, as long as a device allows sideloading (installing apps from other, &quot;unknown&quot; sources), and most of them do, it&#x27;s debatable whether it could be banned from people&#x27;s <i>devices<\/i>.<p>Google has some mechanisms to counter malware (Play Protect) but these are supposed to be used against &quot;harmful&quot; apps. It&#x27;s debatable whether they would want to be involved in enforcing these restrictions this way.<p>It might be difficult for most users to follow the instructions to sideload an app, however there was the precedent with Fortnite, where users were asked to download it directly from fortnite.com&#x2F;android (or use a QR code), and it seems to have worked. As far as I recall the Fortnite app was also preloaded on some phones.<p>The real difficulty for ByteDance might be something else altogether: namely, if the US prohibits doing business with the company, and the US users could no longer be monetized. Such a restriction would be very difficult to work around."],"time":["2020-09-20 00:35:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["liopleurodon"],"id":[24530502],"kids":{},"parent":[24530155],"text":["Great article. This answered a lot of questions that I was wondering about."],"time":["2020-09-19 23:41:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Sargos"],"id":[24530733],"kids":{},"parent":[24530155],"text":["Yes it can due to all phone apps being funneled through only 2 corporations. Until we get a more open mobile platform and a more decentralized mobile app store then governments have easy access to strict controls over what apps we are allowed to use."],"time":["2020-09-20 00:28:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["CreepGin"],"id":[24530678],"kids":{},"parent":[24530155],"text":["So, how does China ban things like Youtube and Facebook? Both on the app store level and IP&#x2F;Firewall level?"],"time":["2020-09-20 00:18:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nzha"],"id":[24530643],"kids":{},"parent":[24530155],"text":["Couldn&#x27;t the US government tell the cloud providers that TikTok uses (supposing they are American as well) to stop serving requests from American IP addresses?<p>TikTok could serve those requests from China but serving video from China would make the app unusable."],"time":["2020-09-20 00:11:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Firebrand"],"id":[24530676],"kids":{},"parent":[24530155],"text":["&gt;Let’s be very clear here. I am not a fan of TikTok. I had the misfortune of coming across it when it was still called Musically and I had to explain to a little girl that she, unlike her friends, was not allowed to dance for strangers. That ruined an otherwise perfect evening.<p>I realize this isn’t the main point of the post but I’m very surprised this is pretty much an accepted thing now. \nI would have thought the Trump administration or the media would weaponize the potential exploitation of children and turn a complex geopolitical struggle into a moral panic for the public to more easily understand."],"time":["2020-09-20 00:17:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pjc50"],"id":[24530644],"kids":[24530707],"parent":[24530155],"text":["If you&#x27;re missing Tiktok content, open the Instagram search tab and you&#x27;ll see all their &quot;reels&quot; ... complete with tiktok watermarks in the corner.<p>(this is a joke, but seriously I see quite a lot of them are just reposts; I believe the tiktok video editor is still best in class, although I&#x27;ve never tried it)"],"time":["2020-09-20 00:11:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nickmooney"],"id":[24530046],"kids":[24530134,24530125],"parent":[24529965],"text":["Speaking about conspiracy by &quot;pseudo-feminists and simps&quot; doesn&#x27;t lend a lot of credibility to the argument."],"time":["2020-09-19 22:10:46"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ab_testing"],"id":[24531745],"kids":{},"parent":[24529965],"text":["Since you are from India, you already know that 40% of the kids in your class are there due to their caste, 20% are there due to the state of their domicile.<p>You gotta get used to this in life. You get very few things due to merit. Mostly it is due to who you are or whom you know.<p>You can try and come to US for masters etc but then again don’t be surprised when a lot of companies will pass you over for needing H1. You will get your H1 eventually but then don’t be surprised when you stay on H1 for life while your roommates from Sri Lanka and Nepal will become green card holders and citizens while you and your company’s lawyers will be answering RFE’s for life.<p>This is life. It is never fair. You gotta take it in stride and try to do the best you can."],"time":["2020-09-20 05:46:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["yodsanklai"],"id":[24530161],"kids":[24533582,24533147],"parent":[24529965],"text":["I don&#x27;t know what we can deduced from these anecdotal evidences. But would that be legal for a US company or university (e.g. academic job) to enforce quotas based on gender?<p>BTW, I remember a Facebook (or Google, dont remember) recruiter mentioning gender diversity in their company. He told me that they tried to be as diverse as possible, but that the bar was the same for everybody..."],"time":["2020-09-19 22:36:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["throwawardauto"],"id":[24530476],"kids":[24533607],"parent":[24529965],"text":["I would like to give you an advice on this matter, don&#x27;t fight against it at all. Why? Because you are bound to lose . You&#x27;ll only fill yourself with rage and might be able to help a few individuals, but in long run it&#x27;s not worth it at all.<p>Yes there is blatant sexism happening in Indian IT industry&#x27;s Tech Giants and yes many more people are going to get rejected, but theres nothing you can do about it. Those who don&#x27;t believe this, just ask placement interview experience from a coed university vs a girls only college. See I&#x27;m not against women empowerment or existence of girls only college here, but when one party gets grilled on advanced cp problems and the other gets asked about why should we hire you as their sole question (yes the only question they be asked about for a tech position like sdeI) then theres ought to be questions here. There are companies that are just ticking&#x2F;filling their diversity quotas. I&#x27;ve many many examples(or anecdotal experiences) from me and many other people I know of and I am willing to share then if anyone wants to hear.<p>But we&#x27;ve come to a point where anything said against such rigged systems will get you labelled as women hater or anti_feminist. So what did I do? I caved in.\nI asked my girlfriend who got placed in a mass recruiter Company with mere 3.4 lpa to prepare for 1-2 months and give interviews for a big tech company in blore region and guess who gets 15 lpa package? I told her small sister who still was in last year of her girl&#x27;s only college about diversity hiring and she got placed in another tech giant.<p>Don&#x27;t fight them, instead go with the flow. At this point no one cares about your hardwork or actually helping under priveleged girls, all they care about is how to fill the diversity quota. Girls in  those quota based hiring are already equipped with enough resources to get them jobs in tech giants without any external help, girls in ignou or not having formal degrees but great hands on experiences are severely neglected.<p>Anyways I know there&#x27;s a big chance your post will be deleted or shadowbanned, most likely mine too so good luck with that. I just hope this messages reaches you and you move on past this problem."],"time":["2020-09-19 23:37:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["klyrs"],"id":[24530126],"kids":[24533430],"parent":[24529965],"text":["This is a very small number of anecdotes with heaps of conjecture and outrage."],"time":["2020-09-19 22:30:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Zenst"],"id":[24530089],"kids":[24530111,24533449],"parent":[24529965],"text":["Facts are that many of these companies do not have the 50&#x2F;50 perfect split of genders and are actively encouraged by some higher-ups to be able to tick that box as it is viewed as something that without could effect the share price.<p>How companies get to that ideal balance is questionable in some cases and the crux is that until the whole gender aspect is taken of the table and we just call each other humans, such things will always play out.<p>If it bothers you - just tick the &quot;other&quot; box in gender based forms, of which that option is provided by such companies."],"time":["2020-09-19 22:22:27"],"type":["comment"],"deleted":{},"dead":{}},{"by":["namanaggarwal"],"id":[24531922],"kids":[24533161],"parent":[24529965],"text":["Why is this flagged"],"time":["2020-09-20 06:37:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["GenerocUsername"],"id":[24530032],"kids":[24530047],"parent":[24529965],"text":["Sounds immoral and possibly illegal. Good luck ever proving it to the degree necessary to enact change"],"time":["2020-09-19 22:07:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["truckeelake"],"id":[24530044],"kids":{},"parent":[24529965],"text":["Oh look, another reactionary article on HN. Shocking that tech bros are anti feminist."],"time":["2020-09-19 22:10:39"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["gatvol"],"id":[24530042],"kids":{},"parent":[24529965],"text":["Blatant discrimination, utterly immoral."],"time":["2020-09-19 22:10:19"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["benmmurphy"],"id":[24530115],"kids":{},"parent":[24529965],"text":["It&#x27;s India so maybe the guys were in the wrong caste in the girls were in the right caste."],"time":["2020-09-19 22:28:02"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["ajharrison"],"id":[24530064],"kids":{},"parent":[24529965],"text":["If you have a masters and your applying for an internship at Google you’re doing it wrong."],"time":["2020-09-19 22:16:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24530121],"kids":[24530166],"parent":[24529965],"text":{},"time":["2020-09-19 22:29:40"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["WoahNoun"],"id":[24527747],"kids":[24527937],"parent":[24521279],"text":["This seems to fundamentally miss the reason why we forecast. To quote Eisenhower:<p>&gt;Peace-time plans are of no particular value, but peace-time planning is indispensable.<p>The end result of these forecasts isn&#x27;t particularly valuable, but the thinking used to develop the forecast can help us preempt, react, and respond. This is like criticizing climate scientists because they didn&#x27;t get the exact amount of warming or sea level rise correct in their predictions. I&#x27;m not saying every (or any) consultant forecast is worth reading, but to dismiss the idea of forecasting because we are wrong is a fundamental misunderstanding of the value of forecasts."],"time":["2020-09-19 16:45:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sega_sai"],"id":[24527597],"kids":[24537926],"parent":[24521279],"text":["The only way in my opinion to really separate snake oil sellers from serious forecasters is to require that the companies or pundits register their predictions in some database, so one can then assess how often they are wrong."],"time":["2020-09-19 16:18:27"],"type":["comment"],"deleted":{},"dead":{}},{"by":["anarbadalov"],"id":[24521332],"kids":{},"parent":[24521279],"text":["Hat tip to the fantastic Browser newsletter (<a href=\"https:&#x2F;&#x2F;thebrowser.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;thebrowser.com&#x2F;<\/a>) for this one. As its editor &amp; head curator writes:<p>&quot;How can it be that forecasts of global trends and outcomes are almost always wrong, yet nobody seems to mind, no stigma attaches, and the appetite for them seems only to grow?&quot;<p>From the article: &quot;To understand the extent of our forecasting fascination, I analysed the websites of three management consultancies looking for predictions with time frames ranging from 2025 to 2050. Whilst one prediction may be published multiple times, the size of the numbers still shocked me. Deloitte’s site makes 6904 predictions. McKinsey &amp; Company make 4296. And Boston Consulting Group, 3679. ...<p>I believe the vast majority of these to be not forecasts but fantasies. Snake oil dressed up as science. Fiction masquerading as fact.&quot;"],"time":["2020-09-18 22:06:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mlthoughts2018"],"id":[24527646],"kids":{},"parent":[24521279],"text":["The article is misguided in thinking anyone cares about forecast accuracy in the first place. Accurate forecasting would usurp political authority, since it would provide a mechanism by which you can accurately hold policy creators accountable.<p>“It’s hard to get someone to understand something when their job depends on not understanding it.”<p>Robin Hanson wrote very well about this years ago:<p><a href=\"https:&#x2F;&#x2F;www.cato-unbound.org&#x2F;2011&#x2F;07&#x2F;13&#x2F;robin-hanson&#x2F;who-cares-about-forecast-accuracy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cato-unbound.org&#x2F;2011&#x2F;07&#x2F;13&#x2F;robin-hanson&#x2F;who-car...<\/a>"],"time":["2020-09-19 16:26:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jariel"],"id":[24527757],"kids":{},"parent":[24521279],"text":["We can predict GDP. Everyone knows ballpark where it will be without calamity.<p>The GDP is an overal measure of something not based on &#x27;events&#x27;.<p>What we cannot predict are &#x27;events&#x27; - like COVID, or a rash of market information coming to light like 2008 causing a domino effect.<p>Predicting marketing spend is like predicting what colour someone will chose for their favorite colour: it&#x27;s within some range, but it&#x27;s a choice."],"time":["2020-09-19 16:46:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["di4na"],"id":[24527571],"kids":{},"parent":[24521279],"text":["I want to point out that Tetlock went into checking if there were ways to get better forecast and better forecaster.<p>It was the Good Judgement Project, and the results are slightly more positive"],"time":["2020-09-19 16:15:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["wodenokoto"],"id":[24527875],"kids":{},"parent":[24521279],"text":["To what degree does the predictions alter the future?"],"time":["2020-09-19 17:06:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["slg"],"id":[24531063],"kids":[24531075,24531272,24531357],"parent":[24530968],"text":["Perfect example of how not proactively making an algorithm anti-racist can yield results that end up being racist.  If you train a machine learning algorithm on photos with predominantly white faces, your algorithm is going to think people with lighter skin are more important thank people with darker skin."],"time":["2020-09-20 01:55:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tzs"],"id":[24531719],"kids":{},"parent":[24530968],"text":["In case anyone else did not realize this and is as confused as I was, apparently you can attach more than one photo to a tweet, and Twitter will then show previews of all of them in a gallery. The previews are formed by taking some part of the original image. Clicking on any of the previews opens a view of the corresponding full image.<p>I knew about twitter taking a part of an image and using that for a preview, but had not realized that there could be more than one image in a tweet."],"time":["2020-09-20 05:37:12"],"type":["comment"],"deleted":{},"dead":{}},{"by":["d0ne"],"id":[24534551],"kids":{},"parent":[24530968],"text":["Why is this flagged?"],"time":["2020-09-20 17:28:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nokya"],"id":[24531184],"kids":{},"parent":[24530968],"text":["Wow.<p>(nothing else to say)"],"time":["2020-09-20 02:32:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nzha"],"id":[24531078],"kids":{},"parent":[24530968],"text":["Knowing the owners of Twitter I hope they completely shut down the service while they fix this."],"time":["2020-09-20 01:59:43"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["rvz"],"id":[24531072],"kids":[24531105],"parent":[24530968],"text":["So was all this BLM virtue signalling by Twitter Inc. all for nothing? Since they have a biased algorithm failing to detect non-white faces and preferring to select lighter faces in the same picture? Oh dear.<p>Companies pointing fingers at &#x27;the system&#x27; should really use a mirror and ask themselves if they are really the baddies, since there&#x27;s always three fingers point back at you. Looks like it was really an empty gesture after all."],"time":["2020-09-20 01:57:22"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["benmmurphy"],"id":[24532455],"kids":{},"parent":[24530968],"text":["Consistent in the title is misleading because this is essentially n=1. The Twitter user did try to transform the image in order to produce a different result but we don’t know if there is something not race based in Mitch’s face that the algorithm prefer’s over Obama’s. We also don’t know if the user has cherry picked this example."],"time":["2020-09-20 09:20:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["AH4oFVbPT4f8"],"id":[24527395],"kids":[24527452],"parent":[24527168],"text":["To check yourself, press the Windows Start Key and enter a single letter to start the search then backspace the letter.<p>The message will be at the bottom of the start menu.  If you are on a new install of Windows, the message instead will be Try Edge.  Once you clear that message and try again, you&#x27;ll get the register to vote message."],"time":["2020-09-19 15:49:05"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Fellshard"],"id":[24527450],"kids":[24527627],"parent":[24527168],"text":["Big tech in the US feels responsible - and has been scolded - for the results of the 2016 election, so this is their mea culpa: to help drive out complacent voters."],"time":["2020-09-19 15:58:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["notadog"],"id":[24527202],"kids":{},"parent":[24527168],"text":["Screenshot of what the notification looks like: <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;LHfKkDh.png\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;LHfKkDh.png<\/a>"],"time":["2020-09-19 15:13:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["captain_price7"],"id":[24527274],"kids":[24527574,24527446],"parent":[24527168],"text":["Fyi, this prompt was shown to a Dutch user, to register for US election."],"time":["2020-09-19 15:27:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["phkahler"],"id":[24527410],"kids":[24527481,24527445,24527455,24527611,24527587,24527525,24527453,24527519],"parent":[24527168],"text":["Why TF are people using an OS that has ads? Whatever the reason I just dont get it."],"time":["2020-09-19 15:51:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["1f60c"],"id":[24527447],"kids":[24527529,24527743],"parent":[24527168],"text":["OP: why did you feel the need to editorialize “Windows 10 prompted me to register to vote” into “Windows 10 prompted me to vote”?"],"time":["2020-09-19 15:58:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rehemiau"],"id":[24527429],"kids":[24527449],"parent":[24527168],"text":["&quot;We&#x27;re all living in America&quot;..."],"time":["2020-09-19 15:55:05"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Jonnax"],"id":[24527476],"kids":[24527516],"parent":[24527168],"text":["The start menu integrates Bing web search so I&#x27;m presuming it&#x27;s an advert from that.<p>It also looks like you need to change a registry key if you want to disable it."],"time":["2020-09-19 16:01:24"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bob1029"],"id":[24527454],"kids":[24527538],"parent":[24527168],"text":["This kind of shit is why I am starting to use Windows Server 2019 as my daily driver workstation OS."],"time":["2020-09-19 15:59:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["throws1aways1"],"id":[24527563],"kids":{},"parent":[24527168],"text":["At this point why not just say &quot;Vote blue&quot; or &quot;Vote Biden&quot;. Does it really matter? I mean this will happen sooner or later, most likely sooner if the POTUS gets reelected"],"time":["2020-09-19 16:14:31"],"type":["comment"],"deleted":{},"dead":[true]},{"by":{},"id":[24527534],"kids":{},"parent":[24527168],"text":{},"time":["2020-09-19 16:10:17"],"type":["comment"],"deleted":[true],"dead":[true]},{"by":["mylons"],"id":[24527421],"kids":[24527438],"parent":[24527168],"text":["on the one hand, this is indeed a shitty precedent. but on the other hand we have a shitty president and government in general."],"time":["2020-09-19 15:53:02"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["aronpye"],"id":[24527491],"kids":[24527779],"parent":[24527168],"text":["Seems that the left wing tech companies are getting nervous."],"time":["2020-09-19 16:04:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Guthur"],"id":[24527235],"kids":[24527280,24527252,24529126,24527313,24527744,24527302,24527247,24528590,24527256],"parent":[24527138],"text":["It&#x27;s not racist and to say as such is just stupid. The model might be a poor but it has no concept of race.<p>And actually think implying that the authors of the algo and model are racist equally stupid."],"time":["2020-09-19 15:20:09"],"type":["comment"],"deleted":{},"dead":{}},{"by":["notadog"],"id":[24527227],"kids":{},"parent":[24527138],"text":["Related Wired and NY Times articles linked further down the Twitter thread: <a href=\"https:&#x2F;&#x2F;www.wired.com&#x2F;story&#x2F;best-algorithms-struggle-recognize-black-faces-equally&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wired.com&#x2F;story&#x2F;best-algorithms-struggle-recogni...<\/a> and <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2020&#x2F;06&#x2F;24&#x2F;technology&#x2F;facial-recognition-arrest.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2020&#x2F;06&#x2F;24&#x2F;technology&#x2F;facial-recogni...<\/a>"],"time":["2020-09-19 15:18:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["overboard2"],"id":[24527229],"kids":[24527243,24527245,24527257],"parent":[24527138],"text":["Oh no, you&#x27;re telling me that reduced contrast impairs facial recognition algorithms? This is clearly racist."],"time":["2020-09-19 15:18:22"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["bsanr2"],"id":[24527241],"kids":{},"parent":[24527138],"text":["We can do so much better than this<p>Racist algorithms, and faces that we miss"],"time":["2020-09-19 15:21:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["chapium"],"id":[24527239],"kids":[24527404],"parent":[24527138],"text":["Its easy to criticize this crappy, trash, algorithm.  Before one declares something trash, they had better have an alternative that fits the use case."],"time":["2020-09-19 15:21:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["praptak"],"id":[24529930],"kids":[24534292,24533387],"parent":[24529486],"text":["<i>&quot;US government is the most noble customer in history&quot;<\/i><p>Noble people don&#x27;t kidnap and don&#x27;t torture people[0]<p>[0]<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24522378\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24522378<\/a>"],"time":["2020-09-19 21:46:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gameswithgo"],"id":[24529758],"kids":[24529935],"parent":[24529486],"text":["&gt;The U.S. government is the most noble customer in history, whether you support the person in the White House or not.<p>That is a non argument for how nobel the US government is.  This seems to be a disingenuous way of pretending that the current administration doesn&#x27;t have serious problems by suggesting it is just down to a matter of people&#x27;s minor preferences.  Even before the current administration it would be a tough argument to call our government the most nobel."],"time":["2020-09-19 21:14:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["thundergolfer"],"id":[24534269],"kids":{},"parent":[24529486],"text":["Peter Thiel is a scary person to leave around with so much power. He’s a brilliant technologist and so unconcerned with cloaking his selfishness and will-to-power he seems somethings like a fiction character.<p>Power in Facebook and Palantir, media and government. It’s certainly relieving to hear Scott argue the latter company is not gathering strength, but he also doesn’t argue that Palantir is impotent.<p>I am pretty curious whether Thiel has a third chess piece in play. What other industry would most attract a techno-megalomaniac?"],"time":["2020-09-20 16:32:08"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cafard"],"id":[24522749],"kids":[24524666],"parent":[24514277],"text":["I have recently found it curious how the voice is tied into the emotions, at least for me. A few years ago, when reading a section of a novel to my wife, I found it hard not to start crying at a passage I found moving enough when reading silently, but that did not nearly bring on tears. And more recently I repeatedly revised and reread a eulogy for a friend dry-eyed, then found myself struggling not to break down when I delivered it a the memorial service."],"time":["2020-09-19 01:10:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Wowfunhappy"],"id":[24524524],"kids":[24573695,24524626,24524598],"parent":[24514277],"text":["I <i>like<\/i> reading aloud—but I find that when I do it, my actual reading comprehension goes down. I noticed it just now, again, when I tried to do as the title suggested and read the BBC article allowed. I had to re-read several paragraphs, because they went in one ear and out... well, my mouth.<p>I wonder if the word recall task they mentioned in the article would continue to hold true for remembering larger paragraphs. Because I think that&#x27;s the problem—I have to spend two much mental energy reading the whole sentence without tripping up. If it was just a list of words, I can see how it might be different."],"time":["2020-09-19 04:55:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bem94"],"id":[24528301],"kids":{},"parent":[24527975],"text":["The RISC-V core in question is the VexRISCV core[0]. It comes in two flavours depending on the kind of FPGA[1]:<p>- 100 MHz VexRISC-V, RV32IMAC + MMU, 4k L1 I&#x2F;D cache on the Xilinx FPGA<p>- 8 MHz VexRISC-V, RV32I, no cache on the Lattice iCE40UP5K FPGA<p>0. <a href=\"https:&#x2F;&#x2F;github.com&#x2F;SpinalHDL&#x2F;VexRiscv\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;SpinalHDL&#x2F;VexRiscv<\/a>\n1. <a href=\"https:&#x2F;&#x2F;www.crowdsupply.com&#x2F;sutajio-kosagi&#x2F;precursor\" rel=\"nofollow\">https:&#x2F;&#x2F;www.crowdsupply.com&#x2F;sutajio-kosagi&#x2F;precursor<\/a>"],"time":["2020-09-19 17:55:45"],"type":["comment"],"deleted":{},"dead":{}},{"by":["merricksb"],"id":[24528416],"kids":{},"parent":[24527975],"text":["Posted first here:<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24527846\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24527846<\/a>"],"time":["2020-09-19 18:09:27"],"type":["comment"],"deleted":{},"dead":{}},{"by":["haunter"],"id":[24529871],"kids":{},"parent":[24529261],"text":["Don&#x27;t worry Twitter already suspended her account, all good. Just keep going and smile"],"time":["2020-09-19 21:33:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gridlockd"],"id":[24529748],"kids":{},"parent":[24529261],"text":["<i>&quot;It would be premature to draw any conclusion about the origins of the virus from this paper. But what is not premature is that social media giants deciding for us what is true and what is false may turn out to be as big a threat as the virus. It is unfair to dismiss ideas that one doesn&#x27;t want to hear as “conspiracy theories” as many people are doing.&quot;<\/i>"],"time":["2020-09-19 21:12:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["daly"],"id":[24529799],"kids":[24529950],"parent":[24529261],"text":["This Week in Virology, Episode 664, where virologists discuss this paper. Get an expert opinion. (<a href=\"https:&#x2F;&#x2F;www.microbe.tv&#x2F;twiv&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.microbe.tv&#x2F;twiv&#x2F;<\/a>)"],"time":["2020-09-19 21:19:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kichik"],"id":[24529754],"kids":[24529792],"parent":[24529261],"text":["It strikes me as somewhat disingenuous to not mention why this article was &quot;cancelled&quot; in the first place."],"time":["2020-09-19 21:14:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24529598],"kids":[24530555],"parent":[24527941],"text":["What exactly qualifies a protein as being conductive? There’s not enough detail in the article to understand that."],"time":["2020-09-19 20:46:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rvz"],"id":[24530436],"kids":{},"parent":[24529869],"text":["&gt;  Does anyone know the reason, and whether it is a permanent or temporary change?<p>Because it&#x27;s Facebook. They did it to Instagram because that&#x27;s also Facebook.<p>They will do <i>whatever<\/i> it takes to get &#x27;real users&#x27; logging in and not window shopping on their website."],"time":["2020-09-19 23:27:39"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cipherzero"],"id":[24530919],"kids":{},"parent":[24529869],"text":["Any chance this change was related to the recent scraping decision from the Supreme Court (I think) against linked in? Maybe this is to prevent people scraping content front public pages.<p>That and as others have mentioned I’m sure they’d love everyone to always be logged in for ad tracking purposes..."],"time":["2020-09-20 01:17:35"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Engineering-MD"],"id":[24531041],"kids":{},"parent":[24529869],"text":["Just to confirm this has also happened to me in UK overnight, so definitely a new change and international. To echo others, I wonder what will happen to all the businesses using facebook as their main site. I’m sure some won’t care but others might see a gradual drop in foot fall"],"time":["2020-09-20 01:48:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kpocza"],"id":[24532072],"kids":{},"parent":[24529869],"text":["Quite interesting.\nI just woke up (it&#x27;s 7AM here). A quick check and everything works as before, so public pages are showing up without requiring login and with the old design.\nI don&#x27;t understand what kind of human experimentation we were facing."],"time":["2020-09-20 07:25:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["4cao"],"id":[24530364],"kids":{},"parent":[24529869],"text":["The immediate reason might have something to do with the recent redesign of the Facebook website to make it more like their apps.<p>But broadly it&#x27;s because they can."],"time":["2020-09-19 23:16:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["CameronNemo"],"id":[24529877],"kids":[24530022],"parent":[24529869],"text":["Because they own the network and they want to track you. Expect it to get progressively worse before Facebook finally implodes."],"time":["2020-09-19 21:34:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["illuminated"],"id":[24529897],"kids":[24530164,24529927],"parent":[24529869],"text":["<a href=\"https:&#x2F;&#x2F;lmgtfy.app&#x2F;?q=Why+Facebook+requires+login+to+view+public+pages%3F\" rel=\"nofollow\">https:&#x2F;&#x2F;lmgtfy.app&#x2F;?q=Why+Facebook+requires+login+to+view+pu...<\/a><p>See the second link shown above: <a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;help&#x2F;537592652938493\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;help&#x2F;537592652938493<\/a>"],"time":["2020-09-19 21:39:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["poormystic"],"id":[24530301],"kids":{},"parent":[24529869],"text":["I alwayd thought its because fb wants to get power over me. \nI don&#x27;t want that."],"time":["2020-09-19 23:04:25"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kevingadd"],"id":[24530323],"kids":{},"parent":[24529869],"text":["Seeing that here too. Definitely wasn&#x27;t the case until recently."],"time":["2020-09-19 23:09:35"],"type":["comment"],"deleted":{},"dead":{}},{"by":["anonzzz"],"id":[24530429],"kids":{},"parent":[24529869],"text":["Because they want to own you."],"time":["2020-09-19 23:26:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["_trampeltier"],"id":[24530576],"kids":{},"parent":[24529869],"text":["That&#x27;s pretty bad, I think. A lot restaurants and events (mis)used facebook as there website. We will see what does happen with these sites .."],"time":["2020-09-19 23:57:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["stickyricky"],"id":[24523014],"kids":[24524033,24523259,24523173,24523086,24526084,24525648,24523864,24525709,24524552,24524657,24524114,24524268,24523363],"parent":[24522908],"text":["I think reading about Ruth and Antonin Scalia&#x27;s friendship was the most wholesome political reading I&#x27;ve ever done.  Hearing people divided in opinion, but not bitterly so, working together to figure out the best framework to construct American society from was inspirational.  I hope the two halves of the political world can become friends in the way they were.<p>Rest in peace Ruth.  I hope if there&#x27;s an after you and Antonin are living it up."],"time":["2020-09-19 01:47:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["adzm"],"id":[24522992],"kids":[24523153,24523024,24523055,24524964,24524465,24523120,24523579,24523599],"parent":[24522908],"text":["&gt; According to her granddaughter Clara Spera, Ginsburg said, “My most fervent wish is that I will not be replaced until a new president is installed.”<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;briantylercohen&#x2F;status&#x2F;1307101417522561025\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;briantylercohen&#x2F;status&#x2F;13071014175225610...<\/a>"],"time":["2020-09-19 01:45:05"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mrkstu"],"id":[24523984],"kids":[24524333,24524020,24524449,24524216,24524207,24524157,24524235,24524730,24525022,24524229,24524317],"parent":[24522908],"text":["For those so certain that the Republican Senate is going to ram though someone, there are a few moderates left, and they&#x27;ve already decided thing can wait until after the election:<p>&quot;So far the following GOP Senators have pledged that they will not consider a Supreme Court appointment until after the next inauguration.<p>Susan Collins \nChuck Grassley \nLisa Murkowski&quot;<p>[0]:<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;yashar&#x2F;status&#x2F;1307115333669580807\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;yashar&#x2F;status&#x2F;1307115333669580807<\/a><p>The Senate is currently split 53&#x2F;47, I don&#x27;t believe Romney has addressed the issue yet. No one should get too bitter and divisive just yet."],"time":["2020-09-19 03:30:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bonzini"],"id":[24522958],"kids":[24523007,24523030,24523828,24523047,24523291,24523033,24524166,24523345,24524311,24522973],"parent":[24522908],"text":["Of course a president should not appoint a judge on the last few months of his term, should he?"],"time":["2020-09-19 01:42:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["michaelmcdonald"],"id":[24522953],"kids":[24523026],"parent":[24522908],"text":["For as worthless as this comment will ultimately be: my thoughts go to her family."],"time":["2020-09-19 01:41:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mindfulhack"],"id":[24523776],"kids":{},"parent":[24522908],"text":["After watching a 2018 documentary on Ruth Bader Ginsburg and seeing her work as a lawyer in the 70&#x27;s, fighting and making and winning cases for pure social justice in the highest court of the land, RBG became an instant hero to me.<p>She will always inspire me, here or not, to fight for justice and what my <i>conscience<\/i> tells me is right. I have a great deal to say and a great deal to fight for. When it gets tough, she will be there to keep me standing.<p>Thank you, Ruth, for being such a fully self-actualised individual. You have shown the way. I am forever grateful.<p>A giant has fallen."],"time":["2020-09-19 03:03:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ianai"],"id":[24523001],"kids":[24526076,24523306,24523478],"parent":[24522908],"text":["I mourn her loss. She’s done more for my life and the average americans life than quite a significant many.<p>Extremism in any shape breeds further extremism. I hope society is about to do a “big blink”.<p>It only takes a majority in the senate and house to add a seat to the SCOTUS or a state to the union."],"time":["2020-09-19 01:45:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tasty_freeze"],"id":[24523474],"kids":{},"parent":[24522908],"text":["One thing I like to point out is between Johnson and Clinton, Republican presidents placed 11 Supreme Court justices in a row (Nixon 4, Ford 1, Carter 0, Reagan 4, GW Bush 2), though the picks were usually not extreme because Democrats controlled the Senate except during six of Reagan&#x27;s years.<p>After Bill Clinton seated two liberal justices there has been an unending cry about how liberal the court is."],"time":["2020-09-19 02:33:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["areoform"],"id":[24523351],"kids":{},"parent":[24522908],"text":["There is no more fitting of an eulogy than what she stated for herself,<p>&quot;Q. When the time comes, what would you like to be remembered for?<p>RBG: Someone who used whatever talent she had to do her work to the very best of her ability, and to help repair tears in her society. ‘To do something,&#x27; as my colleague David Souter would say, ‘outside myself.’ Because I’ve gotten much more satisfaction for the things that I’ve done for which I was not paid.&quot;<p>I made this in her honor, <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;3OlCIum.png\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;3OlCIum.png<\/a>"],"time":["2020-09-19 02:22:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["spodek"],"id":[24523081],"kids":[24523121],"parent":[24522908],"text":["I saw her speak at West Point about a year and a half ago. In a room including colonels, generals, and cadets, she riveted the audience with humor, stories, wit, and insight. My favorite insight was her sharing her friendship with Scalia. Their nearly opposite politics didn&#x27;t stop them from things like he would secretly pass her notes while hearing cases to try to make her laugh.<p>Her sharing contributed to my befriending a few people with opposite political views, against this nation&#x27;s tide of increasing polarization and beating opponents without trying to understand (Jonathan Haidt&#x27;s book <i>The Righteous Mind<\/i> contributed too). Among the results: less anger, more understanding, more self-awareness, though also more confusion among friends and family to why I would talk to someone who voted that way."],"time":["2020-09-19 01:55:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["server_bot"],"id":[24522994],"kids":{},"parent":[24522908],"text":["Sad day, she was a champion of the people - a fighter for both women&#x27;s rights and civil rights. Her iconic status was earned. Would recommend the 2018 documentary &quot;RBG&quot; for anyone interested in her life and career."],"time":["2020-09-19 01:45:08"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hprotagonist"],"id":[24523032],"kids":{},"parent":[24522908],"text":["<i>Barukh atah Adonai Eloheinu melekh ha&#x27;olam, dayan ha-emet.<\/i><p>i pray for peace and rest to her and her family, and grace and mercy, wisdom and forebearance for us."],"time":["2020-09-19 01:48:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["WhompingWindows"],"id":[24523485],"kids":[24524661,24523512,24524849,24523952,24526300,24524544,24527640],"parent":[24522908],"text":["Why are there life-terms on the Supreme Court? Doesn&#x27;t that incentivize the justices to hold on past their prime, dying waiting for a new president or resigning in a politically motivated fashion? And don&#x27;t life terms create a race to the bottom where younger justices are favored for longer remaining life?<p>Why not 20 year limits?"],"time":["2020-09-19 02:34:58"],"type":["comment"],"deleted":{},"dead":{}},{"by":["baryphonic"],"id":[24523011],"kids":[24523357],"parent":[24522908],"text":["I mean, holy sh<i><\/i>. This election is going to be insane."],"time":["2020-09-19 01:46:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["alasdair_"],"id":[24523592],"kids":[24523633,24523639],"parent":[24522908],"text":["Just in case it becomes relevant in the next few days:<p>&quot;&#x27;The American people should have a voice in the selection of their next Supreme Court Justice. Therefore, this vacancy should not be filled until we have a new president,&#x27;&#x27;<p>-Senator Mitch McConnell in 2016"],"time":["2020-09-19 02:44:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hota_mazi"],"id":[24524422],"kids":[24524478],"parent":[24522908],"text":["It&#x27;s depressing how much better Republicans are at politics than Democrats are.<p>Because of that, they will get their way."],"time":["2020-09-19 04:38:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mmaunder"],"id":[24522970],"kids":[24523650,24523061,24523039,24523119],"parent":[24522908],"text":["Worked right to the end even with her health challenges. What a role model."],"time":["2020-09-19 01:42:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hindsightbias"],"id":[24522987],"kids":{},"parent":[24522908],"text":["And so it ends.<p>I weep for those without, you will not have the recourse those of the last half century had."],"time":["2020-09-19 01:44:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["TheAdamAndChe"],"id":[24523054],"kids":[24523270,24523643,24523372],"parent":[24522908],"text":["The potential ramifications of this are chilling. If the Republicans mishandle this, it could drastically increase the chances of widespread conflict around the time of the elections."],"time":["2020-09-19 01:51:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["d0ne"],"id":[24526617],"kids":[24530028],"parent":[24522908],"text":["11 hrs after this was submitted:<p>1627 points and 1263 comments yet no longer on the front page.<p>A moderator, please explain."],"time":["2020-09-19 13:12:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ThinkBeat"],"id":[24526139],"kids":{},"parent":[24522908],"text":["I really liked her and her opinion was often something I learned from.<p>I do think there should be a mandatory retirement age in the Supreme Court.<p>I also think so for being president or governor.<p>I think that RBG was laser sharp till the end but I can think of many presidents and wannabes that are and were not.<p>I don’t want that to devolve into a political debate over specific candidates.    It is just a fact that on average health and cognitive abilities and flexibility decline with age. An for one of the most difficult and stressful jobs in the world you need to try and ensure someone who is still on top of their game.<p>For POTUS we have a law stating the minimum age for the president. Since we already have that imposing a maximum age is reasonable and not ageist<p>Or I would support doing away with both and define a series of physical, cognitive tests as well as knowledge of the world and general knowledge.  All of which would score a candidates suitability for the job.  To be administered by a non partisan agency that is aggressively independent from new or old administrations.  That would have weeded out some horrific presidents we have had. And will have."],"time":["2020-09-19 10:55:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kelnos"],"id":[24523276],"kids":[24523469,24523612,24523568],"parent":[24522908],"text":["Here&#x27;s my prediction:<p>Trump will nominate a successor in the next couple weeks.  McConnell will start the process, but delay the vote until after the November election.  This way:<p>If Trump wins, McConnell can say that he was entirely reasonable and consistent, and he waited until after the election to ensure that the people really wanted Trump&#x27;s SCOTUS nomination to be confirmed.<p>If Trump loses, McConnell still has the option say hell with it, and ram Trump&#x27;s nomination through anyway.  Any Republican Senators who might be worried about re-election chances will already have kept or lost their seats.  I expect election results won&#x27;t be final enough to call by the end of election day like they usually are, but even if it takes a couple weeks, that still leaves over a month for the Senate to vote on the nomination before their session ends at the beginning of January.<p>The other possibility is that McConnell will just get it all done immediately.  He likely has the numbers now -- I doubt any of the fence-sitting Republican Senators would vote no, even those who are up for re-election this year -- and it&#x27;s not clear that he actually gives a damn about appearances at this point.  Waiting could also have a downside: it&#x27;s possible that enough Republican Senators who have lost their seats in the election could feel too uncomfortable confirming a nomination of this magnitude during their own lame-duck session.  But again, not sure how much these people will care about fairness when the chips are down."],"time":["2020-09-19 02:16:39"],"type":["comment"],"deleted":{},"dead":{}},{"by":["a2tech"],"id":[24522947],"kids":[24522989],"parent":[24522908],"text":["This year keeps on giving."],"time":["2020-09-19 01:40:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["grugagag"],"id":[24525724],"kids":{},"parent":[24522908],"text":["Long term I think we&#x27;re good, eventually somehow things will settle. Short term it&#x27;s going to be horrible no matter what outcome in the November elections, the country appears divided beyond repair. Two steps forward one backwards as the saying goes but it appears we&#x27;re now taking more like ten backwards."],"time":["2020-09-19 09:00:39"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24524450],"kids":{},"parent":[24522908],"text":{},"time":["2020-09-19 04:42:37"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["yangmaster"],"id":[24523170],"kids":{},"parent":[24522908],"text":["I hope that RBG&#x27;s replacement will be selected and sworn after Inauguration Day – but I have a chilling feeling that it will happen before."],"time":["2020-09-19 02:05:55"],"type":["comment"],"deleted":{},"dead":{}},{"by":["drainge"],"id":[24523079],"kids":[24523235,24523732],"parent":[24522908],"text":["Vote"],"time":["2020-09-19 01:54:36"],"type":["comment"],"deleted":{},"dead":{}},{"by":["BooneJS"],"id":[24523799],"kids":[24523815],"parent":[24522908],"text":["Unsurprising. <a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;politics&#x2F;2020&#x2F;09&#x2F;18&#x2F;reaction-ruth-bader-ginsburg-death&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;politics&#x2F;2020&#x2F;09&#x2F;18&#x2F;reaction-...<\/a><p>&gt; Breaking: Senate Majority Leader Mitch McConnell (R-Ky.), who refused to consider President Obama’s choice months before the 2016 election, said in a statement Friday hours after Ginsburg’s death: “President Trump’s nominee will receive a vote on the floor of the United States Senate.”"],"time":["2020-09-19 03:06:47"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Hnrobert42"],"id":[24524398],"kids":[24524658,24524441,24529224],"parent":[24522908],"text":["There is nothing good left in this world. I don’t plan to kill myself, but I don’t see much value in living."],"time":["2020-09-19 04:33:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pdxandi"],"id":[24522961],"kids":{},"parent":[24522908],"text":["This is awful for multiple reasons."],"time":["2020-09-19 01:42:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["alkonaut"],"id":[24526082],"kids":{},"parent":[24522908],"text":["I’m pretty sure that if this was a D congress and a conservative dying then Republicans would simply not acknowledge the death until January. The weekend at Bernie’s solution."],"time":["2020-09-19 10:37:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["michaelsbradley"],"id":[24523142],"kids":{},"parent":[24522908],"text":["Eternal rest grant to her, O Lord; and let light perpetual shine upon her. May her soul, and the souls of all the faithful departed, through the mercy of God, rest in peace. Amen."],"time":["2020-09-19 02:03:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["alkonaut"],"id":[24525870],"kids":{},"parent":[24522908],"text":["These justices should be appointed by 2&#x2F;3 majority in both chambers. That way we’d be talking about RBG now rather than the replacement."],"time":["2020-09-19 09:42:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["MichaelZuo"],"id":[24522996],"kids":{},"parent":[24522908],"text":["Rest in Peace Justice RBG.\nConsidering the effect that lawyer hours must have put on her for decades she seemed reasonably okay in the last few years."],"time":["2020-09-19 01:45:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bryanmgreen"],"id":[24525889],"kids":{},"parent":[24522908],"text":["Damn.<p>Time to watch “The Supremes” episode of West Wing and cry."],"time":["2020-09-19 09:46:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["blondie9x"],"id":[24524274],"kids":[24524484],"parent":[24522908],"text":["293 days the Senate didn’t vote on Merrick Garland because it was an election year. Can they wait 45 now?"],"time":["2020-09-19 04:15:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["CalChris"],"id":[24522984],"kids":{},"parent":[24522908],"text":["A great lady."],"time":["2020-09-19 01:44:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24522945],"kids":{},"parent":[24522908],"text":{},"time":["2020-09-19 01:40:22"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["tyre"],"id":[24523095],"kids":[24523148,24523262,24523293,24524520,24523804,24523269,24524015,24523465,24523927,24523525,24523264],"parent":[24522908],"text":["For every one of the coming takes that Republicans will be hypocrites to appoint and confirm a justice (which they will)<p>They do not give a fuck.<p>That’s not how they see power and it is why they have a far disproportionate share of power&#x2F;representation than their support across the electorate.<p>This is about power.\nIn politics, nothing else matters."],"time":["2020-09-19 01:58:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["yyyk"],"id":[24523780],"kids":{},"parent":[24522908],"text":["RIP. 2020 just keeps getting worse.<p>Also, the US needs a maximum age limit for SCOTUS justices."],"time":["2020-09-19 03:04:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24523106],"kids":{},"parent":[24522908],"text":{},"time":["2020-09-19 02:00:01"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["RivieraKid"],"id":[24523137],"kids":{},"parent":[24522908],"text":["This is really depressing, even for a non-American. The only question is whether they appoint a new justice before election or after."],"time":["2020-09-19 02:03:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Imagenuity"],"id":[24524064],"kids":{},"parent":[24522908],"text":["R.I.P. Notorious R.B.G."],"time":["2020-09-19 03:40:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["syedkarim"],"id":[24522955],"kids":[24523028,24522971,24523016,24522962],"parent":[24522908],"text":["Does Trump have enough time to get a new justice nominated and confirmed?"],"time":["2020-09-19 01:41:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24524291],"kids":{},"parent":[24522908],"text":{},"time":["2020-09-19 04:17:33"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["jgowdy"],"id":[24527154],"kids":{},"parent":[24522908],"text":["McConnell has already released a statement saying there WILL be a vote on a Trump nomination."],"time":["2020-09-19 15:04:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["vmception"],"id":[24523312],"kids":{},"parent":[24522908],"text":["Rest in Peace RGB<p>Rest in Peace American Republic"],"time":["2020-09-19 02:19:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["op03"],"id":[24523265],"kids":[24523493,24523582,24523290,24523844,24523562,24524202,24524068,24524069,24523728,24523294],"parent":[24522908],"text":["Remove the Publicly visible Like Count and those kind of conversations and connections are easy.<p>The Like count makes people defensive or aggressive especially when they are called out in public leading to never ending reaction and counter reaction cycles.<p>Without that dumb random signal interfering in conversations all kinds of strange connections are possible.<p>I see it at work meetings between highly competitive people who dont have anything in common with each other. I see it on whatsapp chat groups.<p>But I don&#x27;t see it happening on FB, Twitter and on the News. These mediums favor reaction-counter reaction over solutions.<p>Connection takes time and the right environment. Anyone who wants connection and solutions to trump reactions, please have those conversation in an environment without random signals interfering with the process."],"time":["2020-09-19 02:15:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["glenstein"],"id":[24523611],"kids":[24524694,24530600,24525107,24524702,24523899],"parent":[24522908],"text":["I wonder if he will go down in American history as a more poisonous senator than McCarthy."],"time":["2020-09-19 02:46:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Oricle"],"id":[24525710],"kids":{},"parent":[24522908],"text":["Oh fuck off, I can tell by her name she is a filthy jew pushing anti family, anti Christian, anti man etc etc agendas. Turkish jew, not isralites either!<p>And I dont even know who this person is! All from reading 1 sentence about her!<p>Prove me wrong? Go on!<p>Time for people wake up to theis over 2000 year old war!"],"time":["2020-09-19 08:57:15"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["deathgrips"],"id":[24523183],"kids":[24523563,24523258,24524071],"parent":[24522908],"text":["Unfortunately modern activists and politicians want to make it seem like no reasonable person could disagree with them. This makes it impossible to engage in a dialogue and bridge a gap."],"time":["2020-09-19 02:07:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["elbigbad"],"id":[24524061],"kids":[24529087,24524296,24524488,24524113,24524273],"parent":[24522908],"text":["This won’t happen. I’m a reasonable person and happy to change my mind with evidence, and don’t say this lightly, but the republicans do not give a crud about any of this. They are the most conniving and soulless individuals that exist. This is coming from a recent former republican. I miss George Will’s Republican party."],"time":["2020-09-19 03:40:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["throwaway122378"],"id":[24523154],"kids":{},"parent":[24522908],"text":["Everyone here saying the republicans did this to Obama so how could they appoint a judge clearly don’t understands leverage."],"time":["2020-09-19 02:04:36"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["singemonkey"],"id":[24526704],"kids":{},"parent":[24522908],"text":["Not at all surprised at most Republicans trying to justify their hypocrisy. A party that once stood for values now only represents the basest of values - a tribal need to won at all costs.<p>The era of the US is coming to an end, Anericans have lost all moral authority, and the world has discovered over the last 4 years how exist without the US being central."],"time":["2020-09-19 13:32:32"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["rhastings"],"id":[24525337],"kids":{},"parent":[24522908],"text":["You get what you deserve you liberal fucking piece of shit.<p>Fuck you un-American asshole!"],"time":["2020-09-19 07:19:59"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["strikenow"],"id":[24524845],"kids":{},"parent":[24522908],"text":["it is time to strike while the iron is hot:<p>* round up all the asshole vcs &amp;&amp; sv companies that paid $$ to burn down our cities and imprison their asses<p>* anyone that produced false&#x2F;misleading covid information needs to be imprisoned NOW<p>* all SIH orders should be revoked today<p>* remove nancy pelosi (ideally in chains)<p>* any asshole posting videos to twitter of burning down police precincts needs to be immediately arrested and given a 20 year sentence - <i>hint<\/i> hit all the sv companies that pay these assholes first<p>* institute cifius rules on any company that bails those out that are burning down cities; institute the same rules for those that have mandatory racial classes or those that employ D&amp;I people<p>YOU FUCKED UP LIBERALS - ITS TIME TO PAY!"],"time":["2020-09-19 05:51:09"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["rhastings"],"id":[24525340],"kids":{},"parent":[24522908],"text":["SUCK DICK RUTH!"],"time":["2020-09-19 07:20:20"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["no1name"],"id":[24526007],"kids":{},"parent":[24522908],"text":["Good news!"],"time":["2020-09-19 10:15:59"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["strikenow"],"id":[24524866],"kids":{},"parent":[24522908],"text":["suck ass liberal fuck"],"time":["2020-09-19 05:54:23"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["rhastings"],"id":[24525342],"kids":{},"parent":[24522908],"text":["Eat shit and die liberals!"],"time":["2020-09-19 07:20:31"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["throwaway6000"],"id":[24522954],"kids":[24523282,24523022,24523068,24523029,24522977,24523065,24523070,24522969],"parent":[24522908],"text":["Guess the republican SCOTUS replacement."],"time":["2020-09-19 01:41:27"],"type":["comment"],"deleted":{},"dead":{}},{"by":["throwaway6000"],"id":[24523585],"kids":[24524111,24524230,24524129,24524403],"parent":[24522908],"text":["&quot;BREAKING: Trump will quickly pick a replacement for Justice Ginsburg, and Sen. Mitch McConnell &amp; the Republican-controlled Senate will move to confirm his nominee,creating a new political flashpoint in election while firing up evangelicals &amp; shoring up GOP base and vote for Trump&quot;"],"time":["2020-09-19 02:44:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["libs4jail"],"id":[24523071],"kids":{},"parent":[24522908],"text":["liberals: for all the fucking shit you pulled this year between the fake covid &amp;&amp; the riots - we are sending all of you to jail!"],"time":["2020-09-19 01:53:42"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["awnird"],"id":[24522964],"kids":{},"parent":[24522908],"text":["This turn of events means a likely ossification of American policy for a generation.<p>Whether that’s good or bad is up to you, but that’s how things now stand."],"time":["2020-09-19 01:42:23"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["gonesberg"],"id":[24523871],"kids":{},"parent":[24522908],"text":["Well, that&#x27;s your country fucked then eh? Bad luck.<p>I think your only hope now is some good old-fashioned Presidential assassination.<p>No-one would be more deserving than Trump to get a bullet between the eyes, eh?"],"time":["2020-09-19 03:17:03"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["emmelaich"],"id":[24524162],"kids":[24524184,24525319,24524816,24529059,24524233],"parent":[24522908],"text":["Only after reading about this did I realise that RBG was Catholic.  There would have been a lot of familiarity of thought and philosophy in their backgrounds.<p>In some part, it makes it easier to disagree.  Some of the arguments have been going on for centuries."],"time":["2020-09-19 03:55:09"],"type":["comment"],"deleted":{},"dead":{}},{"by":["spiritplumber"],"id":[24523110],"kids":[24523342,24523433,24523692],"parent":[24522908],"text":["This turn of events means a likely ossification of American policy for a generation. Much like in Iran, you risk ending up with a &quot;council of sages&quot; who is out of step and out of touch with the will of the people.<p>I say &quot;you&quot; because I can go elsewhere. My extended family wishes for me to return to Italy for my own safety."],"time":["2020-09-19 02:00:22"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["theshadowknows"],"id":[24523225],"kids":[24524076,24523253,24523855,24523835,24523711,24523610,24524485,24524316,24523277,24523660,24523284,24523289],"parent":[24522908],"text":["Absolutely. My family is feverishly working on how to leave this hellscape of a country we’re in. The United States is dead."],"time":["2020-09-19 02:11:38"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["disown"],"id":[24523099],"kids":[24523216,24523383,24523464,24523302],"parent":[24522908],"text":["I think this is the first time in a long while that a non-nytimes obituary post leads on HN. Did the nytimes social media team all move to npr?<p>Anyways I think ginsburg is the perfect example of why we need age, health and&#x2F;or term limits for SCOTUS. Lifetime appointments should not exist in any government position and health should be a consideration on whether someone can hold  a major government position.<p>It&#x27;s embarrassing to see both sides ( including ginsburg herself ) use ginsburg&#x27;s life as a political football.<p>Also &quot;champion of gender equality&quot;? Was she a judge or a political activist? Or is she just another example of the politization of the courts, media and every aspect of our lifes?"],"time":["2020-09-19 01:58:41"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["kwhat4"],"id":[24523391],"kids":[24523852,24523431,24524182,24523454,24524149,24523532],"parent":[24522908],"text":["The republicans know how to win, and will do so by any means necessary. The democrats seem happy taking the high road to yet another humiliating defeat.  This is why I&#x27;m done voting and pretending it makes a difference."],"time":["2020-09-19 02:26:50"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["tus88"],"id":[24523010],"kids":[24523161,24523102],"parent":[24522908],"text":["&gt; That was never more evident than in 1996 when, as a relatively new Supreme Court justice, Ginsburg wrote the court&#x27;s 7-to-1 opinion declaring that the Virginia Military Institute could no longer remain an all-male institution. True, said Ginsburg, most women — indeed most men — would not want to meet the rigorous demands of VMI. But the state, she said, could not exclude women who could meet those demands.<p>What&#x27;s the bet she was OK with male-only conscription though?"],"time":["2020-09-19 01:46:33"],"type":["comment"],"deleted":{},"dead":[true]},{"by":["cletus"],"id":[24524118],"kids":[24525400,24524340],"parent":[24522908],"text":["Go back 10 years and as apathetic as voters were in much of the developed world, I had a hard time envisioning how these democracies&#x2F;republics could fall. Boy was I naive.<p>There was a time in the US that as bitter as partisan politics could be there seemed to be a level of decency on both sides and a higher loyalty to the institutions of our government.<p>Nixon resigned in disgrace because it became clear even his own party would not support him. I honestly think that if Watergate happened today, the president&#x27;s party would defend the president regardless of what happened.<p>You see active and organized voter suppression, politicization of the election process itself and gerrymandering on a massive yet accurate scale.<p>The attitude seems to have set in that the ends justify the means. &quot;Look at what the other side does.&quot; Abortion in particular seems to be one of those issues where self-described moral voters seem to view anything as justified. Like how anyone can justify to thsmselves bombing an abortion clinic or a church is in any way justifiable is beyond me.<p>The level of GOP obstruction in the Obama era was utterly unprecedented. The filibuster was defended until it was politically expedient to get rid of it. A simple majority for Supreme Court justices is unprecedented, at least in the modern era. Refusing to even hold a hearing for a Supreme Court nominee is unprecedented and everyone knew that too would be abandoned if ever convenient.<p>Take Kavanaugh&#x27;s confirmation. Of course a conservative president is going to nominate a conservative justice. Kavanaugh I believe was on the Federalist Society&#x27;s list of 25 potential nominees where they expressed no preference among the 25.<p>The hearings produced some pretty serious baggage for Kavanaugh (ie Ford&#x27;s accusations). He could&#x27;ve had his nomination withdrawn (or he could&#x27;ve withdrawn himself) and been replaced with another conservative justice with no such baggage but that didn&#x27;t happen.<p>What you have is privileged white men, in particular Trump and McConnell, who didn&#x27;t want to lose face by backing down. Arguably they didn&#x27;t like the idea that Kavanaugh, another white man, would be held accountable for something that he simply wouldn&#x27;t have been 20 years ago. So getting him confirmed became a way of rubbing this victory in the face of opponents.<p>This is what I find utterly unfathomable: so much of Trump&#x27;s support is essentially religious. By any objective measure, Trump is a reprehensible human being. How any &quot;moral voters&quot; can look passed that because abortion I would never have predicted. It&#x27;s utterly indefensible.<p>And this is what concerns me the most: it seems like Trump can do nothing that will rock his base. Arguably colluding with foreign governments, his love affair with despots and tyrants, the political scapegoating of the poor and immigrants and the dog-whistle (some would say steam-whistle) politics of white supremacism. It&#x27;s so depressing.<p>So yeah, it&#x27;s weeks until the election and the standard used to stall Merrick Garland&#x27;s nomination is completely forgotten (of course). That seat will be filled by the election. McConnell has already come up and said Trump&#x27;s nominee would get a vote on the Senate floor.<p>Personally I don&#x27;t generally have an issue with conservative jurisprudence. At its core, it&#x27;s a belief the the Constitution is literal. It says what it says and it doesn&#x27;t say what it doesn&#x27;t say. If you want it to say something else, there&#x27;s a process for that (ie a constitutional amendment). Personally I find the &quot;living document&quot; interpretation of the Constitution to be nothing more than populism.<p>This can be taken too far. Constitutional literalism was used in the post-Civil War era (ie the Redeemer era) to dismantle the rights of former slaves.<p>As you see in this thread, Scalia is scapegoated by some of the Left as a hater but this is (IMHO) an ignorant view. Read the man&#x27;s opinions.<p>What does sadden me is the utterly self-serving, completely hypocritical and utterly inconsistent &quot;the ends justify the means&quot;, institution-eroding and obstructionist approach that will inevitably lead us there."],"time":["2020-09-19 03:47:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tomcat27"],"id":[24524215],"kids":{},"parent":[24522908],"text":["Trump will win! sorry."],"time":["2020-09-19 04:04:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24523640],"kids":{},"parent":[24522908],"text":{},"time":["2020-09-19 02:49:46"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["dboreham"],"id":[24524101],"kids":{},"parent":[24522908],"text":["Presumably post-election, Biden can appoint, and the new democrat senate can confirm, 2 justices."],"time":["2020-09-19 03:44:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["awat"],"id":[24522949],"kids":[24522988],"parent":[24522908],"text":[":("],"time":["2020-09-19 01:40:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mitchbob"],"id":[24523203],"kids":{},"parent":[24522908],"text":["I&#x27;d like very much to see a black bar for her on Hacker News. She did as much to promote gender equality as any American ever."],"time":["2020-09-19 02:09:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["meundies9"],"id":[24523222],"kids":{},"parent":[24522908],"text":["Alright, it&#x27;s finally time for a court packing. Let&#x27;s be real, NO ONE is expecting Trump not to fill her seat.<p>Also why we need to win the Senate as well.<p>I&#x27;m also curious about how John Roberts is going to react to what comes after her seat&#x27;s filled."],"time":["2020-09-19 02:11:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gautamcgoel"],"id":[24523354],"kids":[24523448,24523473],"parent":[24522908],"text":["This will probably be downvoted, but I think it was incredibly arrogant and selfish of RBG not to retire when Obama was in office so that he could pick her successor. She knew she was getting old and had already had brushes with cancer. If she really cared about feminism and liberalism, why not let Obama appoint a younger justice to the court, someone who would fight for those values for years to come? It&#x27;s not like there is a shortage of great choices."],"time":["2020-09-19 02:22:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["phobosanomaly"],"id":[24523405],"kids":[24523606,24523770,24523922],"parent":[24522908],"text":["Due to a really old technicality in our electoral system, we keep putting people in the presidency that the American people didn&#x27;t actually vote for. Both Bush and Trump were not elected by a popular vote.<p>The majority of American are being held hostage by a minority of voters with a disproportionate amount of political power.<p>These un-elected presidents have had such incredibly far-reaching influences on the American political landscape, economy, and infrastructure (setting aside the fallout of the neocon&#x27;s foreign military adventures)."],"time":["2020-09-19 02:28:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["xmly"],"id":[24523208],"kids":[24523244],"parent":[24522908],"text":["Time to vote!\nTime to vote!\nVote!"],"time":["2020-09-19 02:10:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dexterdog"],"id":[24523090],"kids":[24523128],"parent":[24522908],"text":["This is Trump&#x27;s chance to score some points. If he defers the appointment he will score some points with people and have a better chance of re-election.  If they ram it through his chances of winning will be worse than they already are. This is at most a 2d chess move. They&#x27;ll probably still screw it up."],"time":["2020-09-19 01:57:15"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bleepblorp"],"id":[24523019],"kids":[24523097,24523088,24523040,24523266,24523064,24523329,24523341],"parent":[24522908],"text":["I think we can all be certain that whoever is appointed by the Federalist Society and approved by Mitch McConnell will make sure Trump wins a second (or third, or fourth, or fifth) term.<p>The American experiment as a free and democratic country is over.<p>Unless you want to live in a real world version of The Handmaid&#x27;s Tale, get the fsck out if you still can."],"time":["2020-09-19 01:47:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Kattywumpus"],"id":[24523167],"kids":[24523246,24523207,24523346,24523496],"parent":[24522908],"text":["If Trump and the Republicans confirm a new Justice, Democrats have indicated they will pack the Supreme Court, appointing as many Justices as they feel necessary to get the rulings they want.<p>&quot;If they show that they&#x27;re unwilling to respect precedent, rules and history, then they can&#x27;t feign surprise when others talk about using a statutory option that we have that&#x27;s fully constitutional in our availability,&quot; he said. &quot;I don&#x27;t want to do that. But if they act in such a way, they may push it to an inevitability. So they need to be careful about that.&quot;<p>-- Tim Kaine, D-Va, \n<a href=\"https:&#x2F;&#x2F;www.nbcnews.com&#x2F;politics&#x2F;supreme-court&#x2F;democrats-warn-gop-don-t-fill-supreme-court-vacancy-2020-n1234885\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nbcnews.com&#x2F;politics&#x2F;supreme-court&#x2F;democrats-war...<\/a><p>The Constitution and Bill of Rights are interpreted through the Supreme Court. If you pack the court, you have essentially destroyed the legitimacy of Constitutional government. The consequences of this cannot be overstated.<p>All Constitutional rights will be up for reinterpretation and elimination. This is a very precarious moment in history. Perhaps the end of American history as we have known it. That&#x27;s a grandiose statement, but it&#x27;s not an incorrect one."],"time":["2020-09-19 02:05:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["magicroot75"],"id":[24522972],"kids":{},"parent":[24522908],"text":["She lived well from conception to a natural death."],"time":["2020-09-19 01:42:50"],"type":["comment"],"deleted":{},"dead":{}},{"by":["RickJWagner"],"id":[24523983],"kids":[24524416,24525820,24524301,24524586],"parent":[24522908],"text":["RBG was also the voice of reason when Justice Kavanaugh was under attack by an unhinged mob.<p>She truly could see beyond politics, and will be missed by both sides of the aisle."],"time":["2020-09-19 03:30:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["neycoda"],"id":[24524710],"kids":{},"parent":[24522908],"text":["I can&#x27;t believe the amount of hate and flaming and demonization of a lady I&#x27;ve seen online as this one, she cared about people and the poor and the abused, I think our country is losing its way, and I don&#x27;t know when we&#x27;ll ever see her kind of compassion on the bench again."],"time":["2020-09-19 05:25:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["slothtrop"],"id":[24521495],"kids":[24521595,24527057,24521900,24522107,24521851,24521537,24521654,24521685,24521753,24522643,24531139,24533923,24528197,24524192,24528293,24531498,24522679,24521545,24521633,24526373],"parent":[24519684],"text":["New hot take: I&#x27;m addicted to my laptop. The phone barely registers in terms of interest because I work on my laptop anyway, which is less cumbersome to navigate.<p>Notwithstanding the need to separate work from leisure life, much of leisure is just attached to this device. Even the less consumptive activities, like writing or playing music, benefit from it. And anything to do with innovation or research is absolutely tied to it. This has been amplified somewhat owing to the pandemic, keeping me from activities out-in-the-world, but even before it all happened I merely had the gym and the odd outing to the coffee shop on the regular, and weekly&#x2F;bi-weekly outings with friends.<p>It&#x27;s a mechanical issue. By which I mean, I enjoy research at leisure and relatively solitary activities, but at the same time I want to pull away from being in front of a screen; it hasn&#x27;t to do with consumption versus creativity or challenge. I try to remedy this with scheduled walks, and enough social time. Historically I imagine a person like myself would just be stuck in front of books instead, which I do also, but so much info can be gleaned from the web particularly research papers.<p>EDIT: this concerns me more-so now as we&#x27;ll be trying for a kid, and I&#x27;d like to lead by example.<p>What I&#x27;d like to see in the future is AR tech that rewards mobility and in-person interaction, creating collaborative spaces anywhere. That may seem like more of the same problem, but the marriage with technology will only deepen, so it&#x27;s up to us to set the terms."],"time":["2020-09-18 22:22:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["perlgod"],"id":[24519976],"kids":[24520016,24520075,24521172,24521302,24520751,24522186,24520680,24522527,24520084,24521040,24520615,24520168,24520100,24525620,24520460,24521034,24525997],"parent":[24519684],"text":["Getting rid of my smartphone was without a doubt the most positive thing I ever did for myself.<p>I&#x27;m sure some people have the self-control to use it sparingly. But for me, not having to constantly fight the urge to check my always-connected magic pocket internet portal has freed up a huge amount of my mental willpower, which I can now redirect to other more important things.<p>Now that everything is closed, I don&#x27;t even miss having the convenience of Uber&#x2F;Google Maps. Additionally, without social media, I remain blissfully unaware of whatever corona hysteria or political drama is consuming the minds of my peers.<p>These devices have a veritable legion of engineers working to make the smartphone experience as addictive as possible. For some people, the only winning move it not to play."],"time":["2020-09-18 20:07:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["joshe"],"id":[24520031],"kids":[24520094,24520687,24520548],"parent":[24519684],"text":["&quot;Journal of the Association for Consumer Research&quot; and vague implied effects on mental state both pretty good indicators that this will not replicate. About half of psychology papers don&#x27;t replicate anyway, the field has been doing some house cleaning, which is awesome, but needs to do a lot more.<p>Oh you can add that all the researchers are marketing professors at business schools (one now at Snap). Good job on the marketing though, perfectly designed to get headlines.<p><a href=\"https:&#x2F;&#x2F;www.colorado.edu&#x2F;business&#x2F;adrian-f-ward\" rel=\"nofollow\">https:&#x2F;&#x2F;www.colorado.edu&#x2F;business&#x2F;adrian-f-ward<\/a><p><a href=\"https:&#x2F;&#x2F;www.rotman.utoronto.ca&#x2F;FacultyAndResearch&#x2F;Faculty&#x2F;FacultyBios&#x2F;Duke\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rotman.utoronto.ca&#x2F;FacultyAndResearch&#x2F;Faculty&#x2F;Fa...<\/a><p><a href=\"https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;people&#x2F;faculty&#x2F;ayelet-gneezy&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;people&#x2F;faculty&#x2F;ayelet-gneezy&#x2F;<\/a><p><a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;maartenbos&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;maartenbos&#x2F;<\/a>"],"time":["2020-09-18 20:11:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":["chadlavi"],"id":[24520969],"kids":[24521415,24521701,24524201],"parent":[24519684],"text":["Not to brag, but I&#x27;m often able to maintain low levels of cognitive ability even while my phone is stowed away."],"time":["2020-09-18 21:31:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ardillamorris"],"id":[24519871],"kids":[24520291,24519950],"parent":[24519684],"text":["I get it - the act of staying away from your phone is taking up cognitive capacity. And if you&#x27;re addicted, the constant reminder to check also takes cognitive capacity. Sex is no different - if you&#x27;re single, or married and you want more sex than your significant other - believe me, sex will reduce your available cognitive capacity. The constant thought of how do I get more of it (single or married) I&#x27;m sure does more than your smartphone and probably the smartphone is just a tool to the idea of getting more sex."],"time":["2020-09-18 19:57:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rland"],"id":[24520489],"kids":[24527180],"parent":[24519684],"text":["&gt; Participants in the “desk” condition left mostof their belongings in the lobby but took their phones into the testing room “for use in a later study;” once in the testing room, they were instructed to place their phones facedown in a designated location on their desks.<p>Yeah, color me skeptical. You&#x27;re in a study currently, and you&#x27;re asked to place your phone on your desk for a later study. This is quite different from just having your phone around, because you&#x27;re basically thinking about &#x27;phones&#x27; and &#x27;studies&#x27; together <i>while you&#x27;re in the study.<\/i><p>That&#x27;s very different from &#x27;mere presence&#x27; in my mind."],"time":["2020-09-18 20:47:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gooseus"],"id":[24519880],"kids":[24523087,24520516],"parent":[24519684],"text":["I think this needs a (2017), here is a link to a PDF - <a href=\"https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;docs&#x2F;faculty&#x2F;aGneezy&#x2F;Published%20Papers&#x2F;BrainDrain_Published.email.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;docs&#x2F;faculty&#x2F;aGneezy&#x2F;Published%20Paper...<\/a>"],"time":["2020-09-18 19:58:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["disown"],"id":[24523897],"kids":[24530190,24527199],"parent":[24519684],"text":["Isn&#x27;t this true for any source of distraction? What about a baseball or a book or a dvd or anything?<p>The presence of a distraction reduces cognitive capacity? Other than superficially padding their &quot;researchers&#x27;&quot; resume, what is gained by this &quot;study&quot;?<p>We&#x27;ve know this for years. It&#x27;s why teachers insist kids put away their smartphones, etc."],"time":["2020-09-19 03:20:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kashyapc"],"id":[24522160],"kids":[24522381,24524362],"parent":[24519684],"text":["Many here might know this, but worth mentioning again: A simple but underrated remedy to reduce the colourful appeal of a &quot;smartphone&quot; is to put it in black-and-white mode (i.e. gray scale).  On Android you can do it this way:<p>&#x27;Developer options&#x27; --&gt; &#x27;Simulate color space&#x27; --&gt; &#x27;Monochromacy&#x27;<p>I couple that with:<p>+ Turning off <i>all<\/i> notifications.<p>+ I don&#x27;t use any of the run-of-the-mill social media for about 7 years.<p>+ Most of my serious reading is largely via old-fashioned books.<p>All of the above makes it for a damn calm device."],"time":["2020-09-18 23:41:45"],"type":["comment"],"deleted":{},"dead":{}},{"by":["phobosanomaly"],"id":[24520429],"kids":[24520852],"parent":[24519684],"text":["Perhaps it&#x27;s functioning as a substitute for the constant social interaction that was once a facet of living in a tribal society.<p>We always had someone near us we were chatting with, but now that we have eliminated that level of social connection in the modern social environment, we have replaced it with the smartphone. It may just be satisfying a hardwired biological need for constant chit-chat.<p>If you look at it that way, as a coping technique for loneliness, it doesn&#x27;t seem too bad."],"time":["2020-09-18 20:43:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["justinlloyd"],"id":[24520527],"kids":[24521272],"parent":[24519684],"text":["I lack a lot of self-control in many areas of my life. Except when it comes to my smartphone which for me is a tool rather than an entertainment device. Most of my day the phone is in DnD&#x2F;flipped over on the second desk in my office and not within arm&#x27;s reach. I don&#x27;t know how much having the device in the same room as me is a &quot;cognitive capacity reducer&quot; but for the most part, my smartphone is a forgotten device except for when I need to use it for something.<p>My needs in a smartphone are: Maps &amp; navigation. Local business lookup. Bank account. Audible. Camera. Password manager. Calculator. Grocery shopping list. Recipe book for when at the grocery store. Authenticator. Uber. Check email. SMS.  Occasional voice call.<p>All audible notifications except for alarms and calendar are disabled. All visual notifications are disabled except for SMS. I get conversation starter SMS messages once, maybe twice a month, at most. I don&#x27;t even have games &amp; apps that I worked on installed on my device. I just keep shortcuts to videos of them on the device in case I need to show them off.<p>I don&#x27;t know if this is a normal behaviour for people that have smartphones. I do see an awful lot of people totally engrossed in their devices to the exclusion of all others. I also see, anecdotally, some people, software developer colleagues, who don&#x27;t get anything more than a few minutes before the smartphone cheeps or chirps with a new notification or distraction.<p>I&#x27;ve actually thought about getting rid of my oh-so-delicate-dont-ever-drop-it smartphone and just going back to a flip phone, though I&#x27;d miss the camera. I take a lot of pictures of things for reference, e.g. disassembling a piece of electronics or a piece of furniture I want to copy."],"time":["2020-09-18 20:50:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["roedog"],"id":[24523993],"kids":[24528639],"parent":[24519684],"text":["I made my largest gains in programming competence almost \n10 years ago when working on a system with no connection to the internet and no cell phone at hand.  I was working a development assignment on an air-gapped network.  Not being able to search google every time I got stuck forced me to actually read the documentation, man pages, and reference books and think through what was going on and come up with solutions.  The internet terminal was a 10 minute walk away so I treated it like a trip to the library for research only after I had spent time working on the problem myself."],"time":["2020-09-19 03:32:00"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ed25519FUUU"],"id":[24520007],"kids":[24520139,24520890,24520029,24520095,24520737,24522658,24520530],"parent":[24519684],"text":["I was just remarking the other day while doing my morning constitutional that I can&#x27;t remember what I used to do while sitting on the john when I didn&#x27;t have a cell phone. I honestly couldn&#x27;t remember. Probably just sit quietly and think and be bored.<p>I wonder if boredom is good for us. Our brains probably need time not to be engaged with our eyes do mental housecleaning.  Meditation is good but it&#x27;s not the same as sitting and being bored."],"time":["2020-09-18 20:10:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["m0zg"],"id":[24521342],"kids":[24522237,24521672],"parent":[24519684],"text":["More broadly, I think the mere availability of mindless entertainment reduces one&#x27;s ability to do anything else. I observe this in myself and others. In order to willingly do useful things, I need to be bored. That&#x27;s when I feel a need to do something, and if that &quot;something&quot; is not Instagram or YouTube, I go for the more salient things. So for me boredom is a very useful state to be in. If I can&#x27;t get bored (if entertainment is immediately available) I will not do anything useful at all. I have to make a conscious decision to not access entertainment during the day in order to get anything done. Fortunately I can do that without much of a drain on my willpower reserves.<p>But my son (and his peers) grew up in a world where everyone has Internet at all times, and the problem is more severe there. I&#x27;m trying to convince him that the way he&#x27;s doing things now (basically 8 hours of YouTube and games a day, and lots of missing homework) will cause much regret in the future and will lead to a much worse lifestyle. So far I have failed to convince him of that though."],"time":["2020-09-18 22:07:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["didibus"],"id":[24521012],"kids":[24521212,24521134,24521717,24521740],"parent":[24519684],"text":["I want a smartphone that only has useful apps and nothing else.<p>I want it to have SMS and Phone, Google Maps, Uber, Lyft, Uber Eats, and such.<p>But I don&#x27;t want social media, I don&#x27;t want news, I don&#x27;t want a browser, I don&#x27;t want email, etc."],"time":["2020-09-18 21:35:55"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bigdict"],"id":[24519887],"kids":{},"parent":[24519684],"text":["I keep my smartphone in a different room when I’m working from home. When it’s on my desk, even covering it with a piece of paper helps."],"time":["2020-09-18 19:58:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["daniel_iversen"],"id":[24524259],"kids":[24524733],"parent":[24519684],"text":["I wrote 5 simple things you can do to improve calm, productivity and focus using your phone:<p><a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;5-simple-immediate-hacks-improving-your-mobile-phone-calmness-daniel&#x2F;?trackingId=8U0joNfvRC6NLEk2ocaCpg%3D%3D\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;5-simple-immediate-hacks-impr...<\/a><p>My favorite personal tip is to turn off colors on the phone and run in pure black and white mode :) I&#x27;ve done this for about 2 years now and I loove it!<p>IF you try any tricks to reduce reliance, stimulation and&#x2F;or distraction on your phone, go into Screen Time (or Android equivalent) and take a screenshot of how much you&#x27;ve picked up  your phone in the last 7 days (because Screen Time doesn&#x27;t maintain history) so you can compare later on to see if you&#x27;ve improved!"],"time":["2020-09-19 04:12:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Nbox9"],"id":[24520355],"kids":[24521530],"parent":[24519684],"text":["Do you believe this effect applies to you?  If not, why.<p>If you believe in this effect, and still keep a smartphone, why?"],"time":["2020-09-18 20:37:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Terretta"],"id":[24521185],"kids":{},"parent":[24519684],"text":["Turn off all notifications.  Turn off all badges.<p>Change default text tone and ring tone to silence (make or purchase a ringtone of silence).  Set custom ring tone for your partner or other key people (you will always be happy to be interrupted by) to whatever sound you would want in emergency.<p>At this point, only those you would welcome interruption from can get your attention.   For meetings, toggle phone to silent, so even the custom ring people won’t make noise.<p>If you “must” be reachable in real time for work, consider scheduling DND for all hours outside work hours.  You can, on a contact by contact basis, designate individuals as able to dial through DND for emergencies."],"time":["2020-09-18 21:50:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nbzso"],"id":[24523050],"kids":[24526913],"parent":[24519684],"text":["Just sharing my approach. Phone is for calls and short messages, banking apps. After 6pm I reply only for close friends&#x2F;family. No gaming. No movies. No tv. Old Ipad Air for casual browsing&#x2F;rss. Work computer is only for work. Different machine is research and learning. Book reading on e-reader and paper. Drinking lot of water, active breaks every 30 minutes. When I feel that I have reached my cognitive daily peak - I stop everything and focus on relaxation. Never been so happy and productive in my life:)"],"time":["2020-09-19 01:51:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["RIMR"],"id":[24523686],"kids":{},"parent":[24519684],"text":["This is reinforcing my theory that the ideal mobility solution is a limited-feature cell phone primarily used for messaging and calls, and a full-featured tablet that you have to keep in a bag, plus a bunch of accessories that tie everything together.<p>Smartphones are inconvenient in size and don&#x27;t fit in pockets.  There&#x27;s no great solution for running with a phone.  They&#x27;re fragile and heavy making them easy to break when dropped. They act as a constant attention drain alerting you to every tiny thing that happens.  They have terrible battery life.<p>You could go back to having a flip&#x2F;candybar&#x2F;slider phone with multiple days of battery life on a single charge that can use all of your messaging services and make calls.  Add a few Uber shortcuts, a media controller, and a nice camera and you have the perfect pocket companion.<p>You could have a nice tablet for everything else like social media, multimedia, games, and streaming,  - even one that is functionally a laptop if you&#x27;re going to need a bag for it.  Let it run in a low power mode so that it can drive streaming music to your bluetooth headset and you can use your cell phone as a basic media remote.<p>Basically run the iPhone&#x2F;Apple Watch model, but with more devices with strict (but customizable) limitations.<p>If you go jogging, let the cell phone consume more power to stream music so you don&#x27;t have to carry any other heavy gadgets to stream to your headphones.  If you have a smart watch, let it stream cached songs and make calls in case of an emergency and ditch the phone altogether.<p>And you could even have a regular smart phone in the mix if that format is the best for the situation, but I really hate constantly needing my giant phone when I go anywhere."],"time":["2020-09-19 02:53:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["zaidf"],"id":[24522021],"kids":{},"parent":[24519684],"text":["I can vouch for this :) From Jan to March (when covid hit), I started leaving my phone at work on Fridays. People would ask me &quot;why not just leave it in another room or in your bag at home?&quot; and I would say &quot;it is not the same!&quot;. Indeed, the mere knowledge that I have the phone within reach was noticeably more distracting than knowing it was a mile away."],"time":["2020-09-18 23:24:22"],"type":["comment"],"deleted":{},"dead":{}},{"by":["charlesju"],"id":[24520112],"kids":{},"parent":[24519684],"text":["One trick I&#x27;ve been doing recently is I&#x27;ve reduced my cell phone internet plan to a monthly cap with rollover. And then I only turn on my cell internet when I really need it for something. This has changed my default behavior pattern outside to disconnect from the internet, and that has let me feel a lot more present in whatever I&#x27;m doing."],"time":["2020-09-18 20:19:21"],"type":["comment"],"deleted":{},"dead":{}},{"by":["crazygringo"],"id":[24520910],"kids":[24521000],"parent":[24519684],"text":["First of all, with the caveat that, as is so common with psych studies, this was performed <i>on undergraduates only<\/i>. There is no reason to assume that this would necessarily extend to a 30-year-old mother, a 40-year business executive, etc. (To the contrary, one could also imagine that having their phone on them <i>increased<\/i> their capacity to think about other things, with the peace of mind that they can get things done efficiently.)<p>But secondly, the headline to the paper &quot;reduces available cognitive capacity&quot;, while written to sound bad, <i>isn&#x27;t obviously bad at all<\/i>.<p>Your <i>overall<\/i> cognitive capacity isn&#x27;t reduced -- it&#x27;s just some is being taken up by thinking about your phone. One hypothesis could be that if you&#x27;re able to be reached, then you spend time worrying about the things people will be reaching you for -- if you&#x27;ve sent that e-mail, if you&#x27;ve finished that report, if you&#x27;ve decided whether or not to go to that event.<p>That these are things you have to figure out or do <i>anyways<\/i>, and if you&#x27;re not worrying about them now, you&#x27;ll still have to later. Yes, removing the smartphone lets you relax <i>for now<\/i>, but that&#x27;s just temporary. Otherwise it might be happening later over dinner instead.<p>What would be <i>more<\/i> interesting would be to find <i>variance<\/i> in the data -- which participants had reduced cognitive capacity and which <i>didn&#x27;t<\/i> -- and then correlate that with other reported differences, such as their stress levels, to-do&#x27;s, obligations, etc.<p>I&#x27;m <i>quite<\/i> sure the answer isn&#x27;t as simple as &quot;smartphones make us dumb&quot;, but closer to the truth that in being instantly connected to other people, that&#x27;s something our brain is busy managing. But you know what? That may very well be a net benefit -- that being connected allows us to achieve our goals better, more, faster. That the cognitive capcity it&#x27;s using is a <i>good<\/i> use."],"time":["2020-09-18 21:27:04"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sasaf5"],"id":[24524911],"kids":{},"parent":[24519684],"text":["I wanted to get rid of my phone, but the leverage given by my portable emacs machine + instant Wikipedia lookup was just too much to give away.<p>Without much success I have tried for a long time to quit the most addictive things on my phone (reading news, watching videos), until I recently came up with a doctrine that has been working well: I keep the fun for my laptop, and away from my phone. This way I am not constantly attracted to it, but also not completely out of the loop in a way that would make me abandon my discipline.<p>Texting remains an unsolved problem... Bantering with all my friend circles at multiple timezones the whole day does distract me very much, but is also a big source of non-programming happiness, which I am in dire need during the pandemic."],"time":["2020-09-19 06:01:26"],"type":["comment"],"deleted":{},"dead":{}},{"by":["smartphone91643"],"id":[24529660],"kids":{},"parent":[24519684],"text":["i thanked my last smartphone in Magic of Tidying Up induced tearful mania then crushed it with a small boulder. weirdest dreams ever as my brain went ohno there went my backup how does physical space work. since ditched pc, ereader, internet, and finally flip phone, going paper purist for 4 months. typing this now on an olympically defunct 3g numpad phone so listen up. it&#x27;s a cruel lie that living without the stuff is hard. taking the plunge will take months and leave you weeping in the shower. or maybe i have a mind that naturally reacts strongly to it idunno nobody like that here right. the part that can take weeks of stressfull time work is deleting accounts. digital detox whoo sure great but imagine the freedom of having nothing to return to. all the Kondo insight maps over: does this device, login, file, data in the cloud somewhere bring me joy? my digital closet had millions of identifiable objects, taking up no less space for being virtual. there is aversion in the ambiguous task each represents. gonna drop social media? gotta at least consider you might need that squash recipe burried in chat. glance over every app and service you use and ask how do i live without it -and- where do i find the time and wheelbarrow to get myself out. more saliently, which of the people on the other side do i say bye to or ask for more intimate contact info? the dauntingness of unknowns can only be faced with the will to exit. the only ultimate fate of the unrefactorable is deletion. if you&#x27;re even a little concerned about the tools you use robbing some magic alternative future for yourself, dont detox, switch."],"time":["2020-09-19 20:56:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ChrisCinelli"],"id":[24521386],"kids":[24521550],"parent":[24519684],"text":["I used to be addicted to my laptops. I used to over-work and when I was not working I was reading a lot of articles and spending time on news and some social networks. Even if I am selective with who I add as friends and follow, it is a lot of time that does not have good ROI. It was pretty much no stop activity since I woke up to when I was going to sleep.<p>I stopped completely using computers except for work. It has been pretty hard transition.<p>What happened is that I shifted to use a lot more my smartphone.<p>I tried to keep it in airplane mode or turn off the data for most of the time. I also tried to have different devices for different activities.<p>Switching to a dumb phone seems extreme but I am wondering if it is the final solution."],"time":["2020-09-18 22:11:48"],"type":["comment"],"deleted":{},"dead":{}},{"by":["mtalantikite"],"id":[24522580],"kids":{},"parent":[24519684],"text":["Lately I’ve just been completely powering off my phone and leaving it in another room while I’m coding. Not that it ever was much of a problem for me, but I’ve really been enjoying one less (massive) distraction."],"time":["2020-09-19 00:45:54"],"type":["comment"],"deleted":{},"dead":{}},{"by":["tester756"],"id":[24520639],"kids":{},"parent":[24519684],"text":["I almost never used smartphone and I&#x27;m in early 20s<p>I just know I&#x27;d spend way too much time on surfing the net.<p>It&#x27;s not hard but sometimes I worry that some situation will occur where access to the internet would really help"],"time":["2020-09-18 21:00:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["idiocrat"],"id":[24528327],"kids":{},"parent":[24519684],"text":["One possible factor could be that if those researchers are taking away the source of my happiness hormones (the sweet cloud of mindless meme browsing) that then my brain goes in overdrive and releases fighter hormones, so I can quickly finish with that stupid experiment and that I get my toy back quickly.<p>I think they are measuring the wrong thing.<p>A junkie can get very creative and intelligent just to get his&#x2F;her next shot."],"time":["2020-09-19 17:58:11"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ashutoshgngwr"],"id":[24528781],"kids":{},"parent":[24519684],"text":["Apparently the link submitted here requires you to pay $20 in order to access the content. I emailed one of the authors and he was unaware of this. In response, he added a PDF version of the article on his website. <a href=\"http:&#x2F;&#x2F;www.adrianfward.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adrianfward.com&#x2F;<\/a> (third publication from the top as of now)."],"time":["2020-09-19 18:56:56"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ezekiel68"],"id":[24522367],"kids":[24522451],"parent":[24519684],"text":["I find the majority of responses to these published findings to be fascinating.  It&#x27;s like when we learned in the past few years that humans only have a finite capacity for willpower within a given (short) timeframe.  The near universal reaction among my intelligent friends was something like, &quot;Well, I&#x27;m sure that&#x27;s true for all those OTHER people...&quot;<p>Disclosure: My smartphone (currently) remains by my side.  But this has got me thinking about the dilemma."],"time":["2020-09-19 00:10:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["omgwtfbyobbq"],"id":[24519883],"kids":[24519953,24519978],"parent":[24519684],"text":["I feel like this applies to just about anything that compels us to pay attention to it (TV, video games, etc...), albeit in different ways depending on the media."],"time":["2020-09-18 19:58:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["frank2"],"id":[24523703],"kids":{},"parent":[24519684],"text":["<a href=\"https:&#x2F;&#x2F;sci-hub.tw&#x2F;10.1086&#x2F;691462\" rel=\"nofollow\">https:&#x2F;&#x2F;sci-hub.tw&#x2F;10.1086&#x2F;691462<\/a>"],"time":["2020-09-19 02:55:42"],"type":["comment"],"deleted":{},"dead":{}},{"by":["_bramses"],"id":[24520818],"kids":{},"parent":[24519684],"text":["I actually use two phones. One is an old one I planned on recycling, but now I use it as my &quot;focus&quot; phone. The only apps on it are: Forest, Spotify, Kindle, and the ones Apple won&#x27;t let me remove.<p>When I&#x27;m working I put my main driver phone in another room entirely. This strategy has been doing wonders for my focus, and I still get to jam to my favorite tunes while working."],"time":["2020-09-18 21:17:32"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dagaci"],"id":[24526353],"kids":{},"parent":[24519684],"text":["Unable to read past the abstract here, so I&#x27;m guessing that the the mere presence of the smartphone causes an unconscious distraction because the phone might &quot;do something&quot;.<p>Is it possible the that simply switching off the device will eliminate the distraction and impact on attention?"],"time":["2020-09-19 12:02:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["abhayhegde"],"id":[24526029],"kids":[24526324],"parent":[24519684],"text":["How do you guys cope up with the lack of social media presence? I understand the drama and inattention it brings, but what about the urge to connect with people or learn from others? Also, is it beneficial not to have an online portfolio when it comes to jobs or opportunities?"],"time":["2020-09-19 10:20:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["jupp0r"],"id":[24520146],"kids":{},"parent":[24519684],"text":["I came here to criticize the clickbait title only to find out that the clickbait title is on the actual paper as well! Of course the &quot;presence&quot; of smart phones cannot reduce cognitive capacity, it&#x27;s the things we&#x27;ve learned to associate with smart phones (if it&#x27;s true at all)."],"time":["2020-09-18 20:22:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["agumonkey"],"id":[24520109],"kids":{},"parent":[24519684],"text":["I can personally say the same for internet. When my ISP goes down my brain unfold 2x and time slows down."],"time":["2020-09-18 20:19:09"],"type":["comment"],"deleted":{},"dead":{}},{"by":["gexla"],"id":[24526754],"kids":{},"parent":[24519684],"text":["I&#x27;m the same as many here for whom the computer is the problem rather than the cell phone. What&#x27;s interesting is that the computer is simultaneously a bicycle for the mind and a handicap."],"time":["2020-09-19 13:42:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["darosati"],"id":[24522681],"kids":{},"parent":[24519684],"text":["<a href=\"https:&#x2F;&#x2F;scite.ai&#x2F;reports&#x2F;brain-drain-the-mere-presence-2NEepVn\" rel=\"nofollow\">https:&#x2F;&#x2F;scite.ai&#x2F;reports&#x2F;brain-drain-the-mere-presence-2NEep...<\/a><p>Interesting support for this article"],"time":["2020-09-19 01:00:03"],"type":["comment"],"deleted":{},"dead":{}},{"by":["quantumwoke"],"id":[24526429],"kids":{},"parent":[24519684],"text":["During COVID I threw my phone out as a potential infection risk, and my life has been all the better for it. I&#x27;m happier, less sick, and I feel more intelligent. Win win! :)."],"time":["2020-09-19 12:25:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rajeshmr"],"id":[24520020],"kids":[24521573,24521231],"parent":[24519684],"text":["Quitting smartphone has been incredible for me and i don&#x27;t miss it at all. :)"],"time":["2020-09-18 20:10:52"],"type":["comment"],"deleted":{},"dead":{}},{"by":["anthk"],"id":[24521565],"kids":{},"parent":[24519684],"text":["- Use ed as a text editor\n- go back to usenet with slrn. Less noise, a slower pace\n- get gamebooks\n- use youtube-dl, listen to media offline\n- code or write a book, stop consuming and sharing"],"time":["2020-09-18 22:28:34"],"type":["comment"],"deleted":{},"dead":{}},{"by":["kuharich"],"id":[24524913],"kids":{},"parent":[24519684],"text":["Past comments: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14639967\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14639967<\/a>"],"time":["2020-09-19 06:01:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["dang"],"id":[24521702],"kids":{},"parent":[24519684],"text":["Discussed at the time: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14639967\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14639967<\/a>"],"time":["2020-09-18 22:43:31"],"type":["comment"],"deleted":{},"dead":{}},{"by":["anonytrary"],"id":[24526083],"kids":{},"parent":[24519684],"text":["Extremely fascinating and an instanceof &quot;people who are given everything in life don&#x27;t know how to take care of themselves&quot;."],"time":["2020-09-19 10:39:09"],"type":["comment"],"deleted":{},"dead":{}},{"by":["_def"],"id":[24520480],"kids":[24520656],"parent":[24519684],"text":["I recently took a camping trip with some friends (one weekend) and left my phone at home. Except for not knowing which time it is, it was a very positive experience."],"time":["2020-09-18 20:46:57"],"type":["comment"],"deleted":{},"dead":{}},{"by":["ChrisCinelli"],"id":[24522034],"kids":{},"parent":[24519684],"text":["<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Low_technology\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Low_technology<\/a>"],"time":["2020-09-18 23:25:33"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rkunal"],"id":[24525616],"kids":{},"parent":[24519684],"text":["Is there a metric that directly or indirectly indicates the amount of cognitive capacity used&#x2F;spent ? Something like maybe calories."],"time":["2020-09-19 08:32:24"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nix23"],"id":[24526306],"kids":{},"parent":[24519684],"text":["It&#x27;s not the presence, it&#x27;s the operating mode of your Smartphone...namely Airplanemode, which is my main-mode."],"time":["2020-09-19 11:46:16"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cmoscoso"],"id":[24534718],"kids":{},"parent":[24519684],"text":["All these people addicted to their phone.<p>Glad I only use mine to call my drug dealer."],"time":["2020-09-20 18:00:02"],"type":["comment"],"deleted":{},"dead":{}},{"by":["balola"],"id":[24520467],"kids":{},"parent":[24519684],"text":["I guess using a really old model helps avoid it."],"time":["2020-09-18 20:46:06"],"type":["comment"],"deleted":{},"dead":{}},{"by":["germinalphrase"],"id":[24520002],"kids":{},"parent":[24519684],"text":["As a teacher of high schoolers, I believe this."],"time":["2020-09-18 20:09:41"],"type":["comment"],"deleted":{},"dead":{}},{"by":["solidist"],"id":[24527023],"kids":{},"parent":[24519684],"text":["The Presence of One’s Smart Friend&#x2F;Coworker Increases Available Cognitive Capacity (always)"],"time":["2020-09-19 14:41:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["bitxbitxbitcoin"],"id":[24520521],"kids":{},"parent":[24519684],"text":["I wonder just how much worse it is if you have two phones? One for work use and one for personal use."],"time":["2020-09-18 20:49:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["poma88"],"id":[24526713],"kids":{},"parent":[24519684],"text":["Please could you provide the same study type for each social network, thanks!"],"time":["2020-09-19 13:34:19"],"type":["comment"],"deleted":{},"dead":{}},{"by":["nerdponx"],"id":[24519960],"kids":{},"parent":[24519684],"text":["I wonder if this has implications for our understanding of addiction more generally in humans."],"time":["2020-09-18 20:05:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["firstSpeaker"],"id":[24521609],"kids":[24521744],"parent":[24519684],"text":["Anyone has access to the source of the article? Aka, the full text&#x2F;PDF to share it?"],"time":["2020-09-18 22:33:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["atarian"],"id":[24521521],"kids":{},"parent":[24519684],"text":["That&#x27;s a funny way of saying &quot;smartphones are distracting&quot;.."],"time":["2020-09-18 22:24:37"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hexbinencoded"],"id":[24532976],"kids":{},"parent":[24519684],"text":["TL;DR: Smartphones with either productivity or socialization don&#x27;t mix.<p>I don&#x27;t doubt it. During work, notes should be taken on paper and smartphones should be left away as a general guide.<p>I also think the same should apply to social gatherings and meetings because the point of being with others hinges on attention. (Otherwise, it could&#x27;ve been done over email.) What does it say to others when someone doesn&#x27;t appear to be listening or their speech slows because they&#x27;re trying to read a notification?"],"time":["2020-09-20 11:53:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hindsightbias"],"id":[24520581],"kids":{},"parent":[24519684],"text":["“Point of View is worth 80 IQ points.” — Alan Kay<p>Your phone gates yor viewpoint."],"time":["2020-09-18 20:55:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":["known"],"id":[24526790],"kids":{},"parent":[24519684],"text":["Does Calculators reduce Arithmetic capabilities ?"],"time":["2020-09-19 13:49:40"],"type":["comment"],"deleted":{},"dead":{}},{"by":["takeda"],"id":[24521027],"kids":{},"parent":[24519684],"text":["Is there a way to access the paper without the subscription?"],"time":["2020-09-18 21:36:51"],"type":["comment"],"deleted":{},"dead":{}},{"by":["corytheboyd"],"id":[24521202],"kids":{},"parent":[24519684],"text":["We got to smart phones for a reason.<p>Keep your phone.<p>Use services through a web browser instead of standalone applications, then delete said applications.<p>Turn off notifications for remaining applications that do not warrant the urgency of push notifications.<p>Live your life."],"time":["2020-09-18 21:52:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["hk__2"],"id":[24520266],"kids":{},"parent":[24519684],"text":["This should be suffixed with &quot;(2017)&quot;"],"time":["2020-09-18 20:31:28"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24521100],"kids":{},"parent":[24519684],"text":{},"time":["2020-09-18 21:43:30"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["justizin"],"id":[24520070],"kids":{},"parent":[24519684],"text":["somehow this is not surprising at all. :&#x2F;"],"time":["2020-09-18 20:15:43"],"type":["comment"],"deleted":{},"dead":{}},{"by":{},"id":[24520538],"kids":{},"parent":[24519684],"text":{},"time":["2020-09-18 20:51:33"],"type":["comment"],"deleted":[true],"dead":{}},{"by":["jessaustin"],"id":[24519812],"kids":[24520003],"parent":[24519684],"text":["I know a couple of old guys who will <i>love<\/i> this."],"time":["2020-09-18 19:53:30"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Uehreka"],"id":[24520883],"kids":[24520956,24521099],"parent":[24520397],"text":["This sounds pretty cool! Features like this really open up exciting ways to deploy RPis, even for DIY folks like me who use them to do things like control projectors in a theatre show.<p>But man oh man, this page is a striking reminder that GitHub could probably use finer grained controls for commenting on issues. I sympathize with the person who wanted to close the issue originally, it looks like it just became a magnet for &quot;Are we there yet?&quot; seat-kicking and &quot;I prefer commenting to thumbs-upping&quot; spam. If there isn&#x27;t already, there should be a way to toggle a single issue so that anyone can react but only org members can comment."],"time":["2020-09-18 21:24:08"],"type":["comment"],"deleted":{},"dead":{}},{"by":["LeoPanthera"],"id":[24521263],"kids":[24521374,24523774,24526948,24521368,24521763,24527039,24525781,24521437,24523986,24521720,24525778,24525295,24521902],"parent":[24520397],"text":["Best decision I ever made was setting up a Pi netboot server on my LAN. Now I have a whole bunch of Pi 3&#x27;s and 4&#x27;s scattered around my home with no local storage at all doing cool things, and I can make them boot into a completely different OS just by renaming a symlink on the server."],"time":["2020-09-18 21:59:55"],"type":["comment"],"deleted":{},"dead":{}},{"by":["vkaku"],"id":[24521089],"kids":[24521101],"parent":[24520397],"text":["This is such a misleading title. 2 and 3 have had this for a while, one can do this with 4.<p>I&#x27;m currently using a recent MicroSD card on my Pi 4 though, haven&#x27;t had any real issues with it."],"time":["2020-09-18 21:42:32"],"type":["comment"],"deleted":{},"dead":{}},{"by":["loop0"],"id":[24520958],"kids":[24526410],"parent":[24520397],"text":["Honest question, why did this take so long? Is this feature technically too difficult to implement?"],"time":["2020-09-18 21:30:32"],"type":["comment"],"deleted":{},"dead":{}},{"by":["rwmj"],"id":[24520578],"kids":{},"parent":[24520397],"text":["Good timing!  Only today I was following these instructions to install 64 bit Fedora on a RPi 4B, booting from a USB 3 drive:<p><a href=\"https:&#x2F;&#x2F;fwmotion.com&#x2F;blog&#x2F;operating-systems&#x2F;2020-09-04-installing-fedora-server-onto-pi4&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fwmotion.com&#x2F;blog&#x2F;operating-systems&#x2F;2020-09-04-insta...<\/a><p>(Unfortunately I didn&#x27;t get to the end because my ancient spinning-rust USB drives take up a bit too much power to work reliably without a powered USB hub, so now I have to wait for some SSD-based USB drives to be delivered.)"],"time":["2020-09-18 20:55:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["sdfhbdf"],"id":[24520447],"kids":[24520919,24520676,24522316,24521019,24521273,24521026,24520519],"parent":[24520397],"text":["From this page [1] on Raspberry Pi&#x27;s Docs it seems like it&#x27;s been like that for a while. Had there been a big change with this ROM specifically?<p>[1]: <a href=\"https:&#x2F;&#x2F;www.raspberrypi.org&#x2F;documentation&#x2F;hardware&#x2F;raspberrypi&#x2F;bootmodes&#x2F;msd.md\" rel=\"nofollow\">https:&#x2F;&#x2F;www.raspberrypi.org&#x2F;documentation&#x2F;hardware&#x2F;raspberry...<\/a>"],"time":["2020-09-18 20:45:17"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pronoiac"],"id":[24521006],"kids":[24521178],"parent":[24520397],"text":["Oh man I feel for the maintainers here, with the many &quot;this isn&#x27;t the place for that&quot; and now-deleted comments.<p>It&#x27;s on my mind, as I just set up a vpn gateway on a Pi, and while I sorta want to document the process, I don&#x27;t want to support randos."],"time":["2020-09-18 21:35:14"],"type":["comment"],"deleted":{},"dead":{}},{"by":["systemvoltage"],"id":[24521265],"kids":[24522027,24521351,24521839,24525557,24524517,24527148,24521338,24522905,24521658,24522072,24527716,24524732,24521834,24526163,24525294],"parent":[24520397],"text":["Not a fan of Raspberry Pi. It hides behind proprietary Broadcom chip, no DSI&#x2F;MIPI support and you&#x27;re at the mercy of Raspberry PI for any sort of commercial implementation (RPi Zero and independent module). They do guarantee upto 2026 availability for their DIMM modules which is nice. We wanted to build commercial device using RPi but its a no go due to its blackbox nature.<p>What they should do is to leverage their position in the market and convince Broadcom to open source the bootloader and drivers. There are a bunch of binary blobs from Broadcom that are a mystery as to what they do. No docs, no anything. HAL layer is completely at the mercy of Raspbery Pi.<p>Raspberry Pi is an ecosystem which is based on proprietary technologies and masquerading as an open source friendly thing.<p>If you want to support proper open source development (I understand, at some point things get proprietary the closer you get to the hardware, but with RPi, there isn&#x27;t even a datasheet for the processor that you can get your hands on), buy Beagle board and other alternatives."],"time":["2020-09-18 22:00:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["silicon2401"],"id":[24521924],"kids":[24522067,24522243,24529254,24524859],"parent":[24520397],"text":["As a pi noob: does this make it more reliable&#x2F;feasible to use a pi to run a home server&#x2F;application&#x2F;etc? I&#x27;ve read in the past that SD cards aren&#x27;t good with repeated read&#x2F;writes, which makes it somewhat unreliable in the long run. If a pi is configured to run via USB, does that make it as reliable as other consumer hardware like a pc&#x2F;laptop?"],"time":["2020-09-18 23:13:18"],"type":["comment"],"deleted":{},"dead":{}},{"by":["del_operator"],"id":[24527517],"kids":{},"parent":[24520397],"text":["Been using my Pi 4 8GB with K3s and found it to already be quite enjoyable. I’ve seen some odd things being new to the Pi. I started off with the full desktop raspberry os and saw my usb storage devices weren’t mounted when I did not connect my a monitor or set a default resolution in rasp config."],"time":["2020-09-19 16:07:23"],"type":["comment"],"deleted":{},"dead":{}},{"by":["627467"],"id":[24521167],"kids":[24521661],"parent":[24520397],"text":["I&#x27;d love to boot my por from usb as I have plenty of usb sticks&#x2F;disks and not many as cards. Is there a performance benefit to this?"],"time":["2020-09-18 21:49:20"],"type":["comment"],"deleted":{},"dead":{}},{"by":["AgloeDreams"],"id":[24520791],"kids":{},"parent":[24520397],"text":["I have a Pi4 set up to do this with a cheap Walmart portable SSD, it all has been far more reliable and faster than microSD."],"time":["2020-09-18 21:14:13"],"type":["comment"],"deleted":{},"dead":{}},{"by":["etaioinshrdlu"],"id":[24520559],"kids":[24521209,24520743],"parent":[24520397],"text":["Which devices now support this? Does this require updating some built-in flash&#x2F;eeprom memory?"],"time":["2020-09-18 20:52:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["Abishek_Muthian"],"id":[24525420],"kids":[24525440],"parent":[24520397],"text":["Almost all of my SBCs run from USB storage, the performance improvements over SD card are obviously night and day; but I never had success with the direct boot from USB(official methods) and had to jump from SD card to USB storage after boot i.e. having only &#x2F;boot on SD card. RPi 4 being newer, I assume it&#x27;s designed with USB boot in mind and perhaps USB boot might work better than earlier iterations."],"time":["2020-09-19 07:39:29"],"type":["comment"],"deleted":{},"dead":{}},{"by":["snvzz"],"id":[24527182],"kids":[24528764,24528050],"parent":[24520397],"text":["Rpi4 and still no usb version of bootloader. What am I missing?<p><pre><code>    # rpi-eeprom-update\n    BCM2711 detected\n    BOOTLOADER: up-to-date\n    CURRENT: Tue 10 Sep 2019 10:41:50 UTC (1568112110)\n     LATEST: Tue 10 Sep 2019 10:41:50 UTC (1568112110)\n    VL805: up-to-date\n    CURRENT: 000137ab\n     LATEST: 000137ab\n<\/code><\/pre>\nI wish this was better documented."],"time":["2020-09-19 15:10:59"],"type":["comment"],"deleted":{},"dead":{}},{"by":["geerlingguy"],"id":[24521070],"kids":{},"parent":[24520397],"text":["FYI the EEPROM page in the Raspberry Pi docs still says:<p>&gt; USB boot support is currently being beta-tested. See\n&gt; the &quot;USB mass storage boot&quot; section of the Bootloader\n&gt; Configuration Page for further details.<p>But in general, it seems like it works without having to change your &#x27;FIRMWARE_RELEASE_STATUS&#x27; setting from &#x27;critical&#x27; to &#x27;stable&#x27; anymore."],"time":["2020-09-18 21:41:10"],"type":["comment"],"deleted":{},"dead":{}},{"by":["omnifischer"],"id":[24520941],"kids":{},"parent":[24520397],"text":["Please add rpi4 to the title"],"time":["2020-09-18 21:29:44"],"type":["comment"],"deleted":{},"dead":{}},{"by":["cogburnd02"],"id":[24521255],"kids":[24522602],"parent":[24520397],"text":["I wonder if this will help improve its status on <a href=\"https:&#x2F;&#x2F;www.fsf.org&#x2F;resources&#x2F;hw&#x2F;single-board-computers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fsf.org&#x2F;resources&#x2F;hw&#x2F;single-board-computers<\/a>, moving it out of the category of SBCs which have &quot;fatal flaws&quot;"],"time":["2020-09-18 21:58:39"],"type":["comment"],"deleted":{},"dead":{}},{"by":["maxioatic"],"id":[24521591],"kids":[24521925],"parent":[24520397],"text":["Might be a silly question because I&#x27;m a noob in this area, but:<p>Does this work with the official Ubuntu images or only Raspbian?"],"time":["2020-09-18 22:31:07"],"type":["comment"],"deleted":{},"dead":{}},{"by":["amelius"],"id":[24521601],"kids":[24522597],"parent":[24520397],"text":["Now if someone could make this possible across NVidia&#x27;s Jetson platform ..."],"time":["2020-09-18 22:32:35"],"type":["comment"],"deleted":{},"dead":{}},{"by":["teslalang"],"id":[24530613],"kids":{},"parent":[24520397],"text":["Big improvement over having to use SD chip!"],"time":["2020-09-20 00:03:49"],"type":["comment"],"deleted":{},"dead":{}},{"by":["FullyFunctional"],"id":[24521078],"kids":[24521871,24521799,24522999,24521109],"parent":[24520397],"text":["It&#x27;s nice but I&#x27;m honestly baffled that it&#x27;s seen as such a big deal as it&#x27;s pretty trivial to make grub boot off USB, leaving the SDcard only being used doing the initial boot.\nIs it just about the convenience?"],"time":["2020-09-18 21:41:38"],"type":["comment"],"deleted":{},"dead":{}},{"by":["agustif"],"id":[24522287],"kids":[24522590,24524766,24525773],"parent":[24520397],"text":["Is thhere any way to use OS X on a Pi?<p>Asking for a friend"],"time":["2020-09-18 23:58:01"],"type":["comment"],"deleted":{},"dead":{}},{"by":["pmarreck"],"id":[24524058],"kids":{},"parent":[24520397],"text":["Can I boot on ZFS root yet?"],"time":["2020-09-19 03:39:58"],"type":["comment"],"deleted":{},"dead":{}}]
